
[
{
"id": "31952",
"title": "Hide And Seek Horror Escape",
"description": "Hide And Seek: Horror Escape is an asymmetric horror escape game. Abandoned schools and haunted hospitals, heres a lot of hidden secrets and treasures are waiting to be discovered. During the game, there are two identities for you to choose, hide or seek?",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/bqy19lboh88foefy68nejkp3zemz6c2a/",
"category": "Puzzles",
"tags": "Escape, Horror",
"thumb": "https://img.gamemonetize.com/bqy19lboh88foefy68nejkp3zemz6c2a/512x384.jpg",
"width": "1334",
"height": "750"
},
{
"id": "31951",
"title": "My City Hospital",
"description": "My City Hospital is a sophisticated digital doll placement game. Have you ever thought about being a doctor or running a hospital to help others?",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/h1klvtd268m5dea93y1zwuntir8bqay1/",
"category": "Hypercasual",
"tags": "Doctor, Simulation",
"thumb": "https://img.gamemonetize.com/h1klvtd268m5dea93y1zwuntir8bqay1/512x384.jpg",
"width": "1600",
"height": "768"
},
{
"id": "31950",
"title": "Cat Life Merge Money",
"description": "Experience the life of a stray cat, beg from humans, earn money to buy food, and merge the money you beg to get more money. Only by acting quickly can you enter the rich cat life! First of all,all you need to do is click on the cat and let it beg all the time. Otherwise, it will be lazy.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/02oaz5794rypk5gf2x113fxeibwrh1po/",
"category": "Hypercasual",
"tags": "Cat, Click",
"thumb": "https://img.gamemonetize.com/02oaz5794rypk5gf2x113fxeibwrh1po/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31949",
"title": "Space Survivor Shooting",
"description": "Space Survivor Shooting is a challenging online game. As an impostor, your task is to plan, move fast, and use your shooting skills to defeat enemies and save allies. Use your intelligence and tactics to kill your opponents quickly.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/fgc6kf9h3gtckyse3xsoqx3tubxzg4g5/",
"category": "Shooting",
"tags": "Battle, Shoot",
"thumb": "https://img.gamemonetize.com/fgc6kf9h3gtckyse3xsoqx3tubxzg4g5/512x384.jpg",
"width": "1136",
"height": "640"
},
{
"id": "31948",
"title": "StickMan Defense",
"description": "Dive into the thrilling world of StickMan Defense, a captivating game where strategy meets action. In this game, players are tasked with defending their base against waves of incoming enemies, using a variety of stickman warriors. Each level challenges your tactical skills, requiring careful placement of troops and timely upgrades. With intuitive controls and engaging graphics, StickMan Defense offers an immersive experience for both casual and hardcore gamers. Web Dev &lt;a href='https://www.insanegamesonline.com/'&gt;https://www.insanegamesonline.com/&lt;/a&gt;",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/xnm06hp9o6dt48fua7g3jzoddqnkc5fs/",
"category": "Action",
"tags": "Android, Click, Defense, HTML5, iPad, iPhone, Mentolatux, Mobile, Stickman, WebGL",
"thumb": "https://img.gamemonetize.com/xnm06hp9o6dt48fua7g3jzoddqnkc5fs/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31947",
"title": "Dark Assassin",
"description": "Escape from the Dark Assassin full of traps and mysterious adventures. This Dark Castle adventure game will challenge your capability to solve the mysterious traps in each level. Explore the world of darkness with a smooth simulation with Zenith, be careful when crossing above the spikes and movable spikes. If player falls down from platform or movable platform, the game will be over. So be wise and control your player as required. Main object is the Key , find the key and the castle door will open then you can go towards the next level. Features of this game: High Quality graphics Game size is minimal Super simple controls",
"instructions": "Use ldquo Arrow Buttons rdquo or ldquo WASD rdquo to control the player",
"url": "https://html5.gamemonetize.com/wfnltos144ugjg2j7rh8my5c9qa0hgkf/",
"category": "Hypercasual",
"tags": "Adventure, Casual, Platform, survival",
"thumb": "https://img.gamemonetize.com/wfnltos144ugjg2j7rh8my5c9qa0hgkf/512x384.jpg",
"width": "480",
"height": "270"
},
{
"id": "31946",
"title": "Fruit Candy Merge",
"description": "Welcome to Fruit Candy Merge, where juicy fruits and sweet candies come together in a delightful merging puzzle! Combine matching candies to create delicious fruit combos and watch them burst with flavor. With addictive gameplay and colorful challenges, can you merge your way to fruity success?",
"instructions": "Tap to drop fruit candies from above Merge identical candies to create new combos and score points Utilize the Remove Smallest Item button to clear tiny fruit candy instances from the stage Embark on an unstoppable fun travel ",
"url": "https://html5.gamemonetize.com/vroh2bbwwbt8q9r4js6dg2ps7gvvlhcj/",
"category": "Puzzles",
"tags": "Arcade, Fruits, Matching, Physics, Puzzle",
"thumb": "https://img.gamemonetize.com/vroh2bbwwbt8q9r4js6dg2ps7gvvlhcj/512x384.jpg",
"width": "960",
"height": "1280"
},
{
"id": "31945",
"title": "Noob Prison Escape Obby",
"description": "In this adventure, Obby needs to rescue his brother Bacon from prison. Obby teams up with Noob, who arranges a helicopter for him. Obby goes to the prison and searches for three iron bars. After finding all three, he uses them to make a key to free Bacon from the prison.With the key, Obby unlocks the iron bars and escapes with Bacon. However, Steve, the police officer, is patrolling the area, so they must be very careful not to get caught. If Steve catches them, they wont be able to escape.Obby and Bacon manage to get out of the prison, and Noob picks them up with the helicopter and they fly away.",
"instructions": " You can move by pressing the WASD keys Collect the 3 iron bars and make a key Use the key to unlock the prison iron bars Be careful of obstacles and avoid the police officer ",
"url": "https://html5.gamemonetize.com/5x2qpdxndev6a12knc0yo2ea8e8fbkpk/",
"category": "Arcade",
"tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Android, Arcade, Mobile, Pixel",
"thumb": "https://img.gamemonetize.com/5x2qpdxndev6a12knc0yo2ea8e8fbkpk/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31944",
"title": "Mrs. Zombie",
"description": "Mrs. Zombie is an exciting arcade game that combines quick reflexes with strategic gameplay. Set in a spooky, eerie environment, players must slice through hordes of zombies before they reach the ground. Each zombie type presents unique challenges, making every level a thrilling experience.",
"instructions": "Start the Game Tap on the Start button to begin your zombie-slicing adventure Slice the Zombies Swipe your finger across the screen to slice the zombies before they reach the bottom Avoid Obstacles Watch out for bats and other obstacles that can redu",
"url": "https://html5.gamemonetize.com/pmqat5se5i4j77bnxfkqdyijp2il02xt/",
"category": "Shooting",
"tags": "1 Player, 2D, Action, Air, amazing, Android, angry, Baby Games, Brain, Collection, Zombie",
"thumb": "https://img.gamemonetize.com/pmqat5se5i4j77bnxfkqdyijp2il02xt/512x384.jpg",
"width": "720",
"height": "1280"
},
{
"id": "31943",
"title": "Rabbit Punch Rabbit ",
"description": "Are you ready to dive into the exciting world of reaction and competition? Then this game is created especially for you! Whether you prefer to battle a car or a friend on the same device, youre guaranteed a dose of adrenaline and fun every time you touch the screen. The hare is our main character. He will appear at the most unexpected moment and only for a moment. Your job is to be quick and hit him before he disappears. After all, the one who manages to hit the hare first will be rewarded with points. In this game, reaction is your main tool, and you must use it to its full potential to win.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/pgdivazlfi4x3u9byflherbvhelzpif8/",
"category": "Clicker",
"tags": "1 Player, 2 Player, 2 Player Games, Arcade, Arena",
"thumb": "https://img.gamemonetize.com/pgdivazlfi4x3u9byflherbvhelzpif8/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31942",
"title": "angry bird vs pig",
"description": "Descending from the skies, Angry Bird engages in a mortal battle against Heel. This is an exciting adventure in which you have to skillfully knock down buildings so that the bird can fall right on the heel and destroy it with its menacing chase. The game requires high skill and strategic thinking to succeed. The angry bird can use its abilities to destroy various buildings and move to new objects. Each level is a unique puzzle that requires quick solutions and good accuracy.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/prfqweqswkh5tvtsy2s7uhombdapvo6c/",
"category": "Puzzles",
"tags": "angrybirds, Arcade",
"thumb": "https://img.gamemonetize.com/prfqweqswkh5tvtsy2s7uhombdapvo6c/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31941",
"title": "Green Clicker Game",
"description": "In this game, all you have to do is click on the screen or mouse. You can see your clicks per second and your total clicks. Its a very simple game.",
"instructions": "All you have to do is click on the screen or mouse ",
"url": "https://html5.gamemonetize.com/li1n6uejdfkd0gm7s25mptf2la2h4ar0/",
"category": "Clicker",
"tags": "1 Player, Click, Clicker",
"thumb": "https://img.gamemonetize.com/li1n6uejdfkd0gm7s25mptf2la2h4ar0/512x384.jpg",
"width": "800",
"height": "450"
},
{
"id": "31940",
"title": "Hungry Cat",
"description": "In this game where we control two hungry cats, we try to catch the fish hovering in the air and try to eat more fish than our opponent. 10 fish eaters win",
"instructions": "PC -player 1 space -player 2 up arrow MOBLE -player 1 left of the screen -player 2 right of the screen",
"url": "https://html5.gamemonetize.com/djw8vqjdhtlj54ba02jic7wlec0xeqto/",
"category": "Arcade",
"tags": "Animal, Best Games, Cat, Fish, Pixel, two player games",
"thumb": "https://img.gamemonetize.com/djw8vqjdhtlj54ba02jic7wlec0xeqto/512x384.jpg",
"width": "960",
"height": "540"
},
{
"id": "31939",
"title": "Gun Up Weapon Shooter",
"description": "Gun Up Weapon Shooter is a wonderful parkour game. Pick from a variety of cool and powerful weapons to start your adventure. Collect rewards, upgrade your weapons, and become more destructive. You can choose to increase fire frequency, increase income, or upgrade the year to help you successfully pass. But beware of moving knives, they can stop you from moving forward. Complete all challenges, you can travel longer distances and earn more income.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/fo4t0uu0sdcd78l71ntdtam2j8bd5s68/",
"category": "Shooting",
"tags": "Racing, Shoot",
"thumb": "https://img.gamemonetize.com/fo4t0uu0sdcd78l71ntdtam2j8bd5s68/512x384.jpg",
"width": "720",
"height": "1280"
},
{
"id": "31938",
"title": "Fairy Land Rescue",
"description": "Fairy Land Rescue is a creative and fantasy educational game. Winter Queen loves to cause trouble.This time, she turned the fantasy kingdom that was supposed to be in winter into a desert. Many animals are in trouble because of her destruction. As a caring child, help the fairy to save the animals homes. In this game, you will not only help the little dinosaur, snail, and polar bear out of trouble but also master the fairys spells and the use of the magic wand. If you are interested, come and try this game!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/63d8w4x3ta8ag1v2j6z4vk6vxm7yzles/",
"category": "Hypercasual",
"tags": "Educational",
"thumb": "https://img.gamemonetize.com/63d8w4x3ta8ag1v2j6z4vk6vxm7yzles/512x384.jpg",
"width": "1920",
"height": "1080"
},
{
"id": "31937",
"title": "Cat Evolution",
"description": "Cat Evolution is a fun parkour game. You will play as a cat, as a carnivore, collecting pieces of meat for you to evolve faster, light vegetables will degrade you. Also, dont forget to collect diamonds, which can be used for upgrades! Evolve from a cat to a tiger or even farther to the finish line to conquer the animals!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/g0uzstfcytak4mvcouj3jnjhfezg6nmr/",
"category": "Racing",
"tags": "1 Player, Cat",
"thumb": "https://img.gamemonetize.com/g0uzstfcytak4mvcouj3jnjhfezg6nmr/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31936",
"title": "Protect The Thief ",
"description": "Protect The Thief is an engaging and strategic puzzle game where you play the role of a sneaky thief trying to collect treasures without getting caught. Navigate through various challenging levels, dodge obstacles, and outsmart guards to secure the loot. With its colorful graphics and addictive gameplay, Protect The Thief will keep you entertained for hours.",
"instructions": "Start the Game Tap the Play button on the main screen Control the Thief Use the on-screen controls to move the thief Collect Treasures Navigate through the grid to collect treasures while avoiding obstacles Avoid Detection Be cautious and avoid get",
"url": "https://html5.gamemonetize.com/dgf2xipzb7hxdk3uifrqtuykmqkwivsy/",
"category": "Puzzles",
"tags": "1 Player, 2 Player Games, 2048, 2D, Air, Arcade, Baby Games, Best Games, Collecting",
"thumb": "https://img.gamemonetize.com/dgf2xipzb7hxdk3uifrqtuykmqkwivsy/512x384.jpg",
"width": "600",
"height": "900"
},
{
"id": "31935",
"title": "Obby Barry Prison Run",
"description": "In this adventure, you need to reach the finish line of the obby, board the helicopter, and escape from the prison. You must help Obby by collecting all the gasoline cans in the prison. Collect all the gasoline cans and reach the helicopter. Be very careful as the police officer is on duty. The police officer is looking for you everywhere, so avoid them and reach the helicopter",
"instructions": " You can move by pressing the WASD keys Collect three gasoline cans and reach the helicopter Be careful of obstacles and avoid the police officer ",
"url": "https://html5.gamemonetize.com/on10ef47qqo7q3lrgb3mrcsz907yn6bj/",
"category": "Arcade",
"tags": "2D, Action, Adventure, Arcade, Block, Pixel",
"thumb": "https://img.gamemonetize.com/on10ef47qqo7q3lrgb3mrcsz907yn6bj/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31934",
"title": "Boxes Jump",
"description": "Boxes Jump Game, a single-touch jumping reaction game, has everything you need to make your next app store hit! Use your skills and agility to survive by jumping over obstacles and avoid getting hit; just tap the screen and makeup to three jumps before touching the ground again. Avoid the dangerous obstacles or your Hero will death and the game will be over!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/sw0u5m52de1cq0dqxkxotov1gk7lkxdu/",
"category": "Hypercasual",
"tags": "Arcade, Clicker, Hypercasual, jump, Jumping, mapi games",
"thumb": "https://img.gamemonetize.com/sw0u5m52de1cq0dqxkxotov1gk7lkxdu/512x384.jpg",
"width": "768",
"height": "1024"
},
{
"id": "31933",
"title": "Grab Them All",
"description": "Grab Them All is your ticket to thrilling fun as you take down robbers by putting them in the trap! Explore diverse traps on each level and get rid of all the robbers. It is suitable for all ages! Get ready for a blast of excitement and endless entertainment! We control the Hand character with drag mechanics in a 3D movement space. We capture enemies in the arena and take them to the machines. Different destructive tools are unlocked in each level. Different level designs provide the player with a minimum 30-minute experience.",
"instructions": "PC Controls Drag left-click WASD arrow keys move Shift faster movement Left-click space do the action Mobile Controls Drag move Tap do the action",
"url": "https://html5.gamemonetize.com/ebmpyq4ba3qz9bakjn7ttvzdgqwgfp06/",
"category": "Arcade",
"tags": "Casual, destroy, Platform",
"thumb": "https://img.gamemonetize.com/ebmpyq4ba3qz9bakjn7ttvzdgqwgfp06/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31932",
"title": "Knife Train Test",
"description": "Knife Train Test is a thrilling game where players master their timing and precision aboard a high-speed train. Navigate through each level by dodging obstacles and throwing knives at targets to clear your path. With escalating difficulty, the game challenges your reflexes and aiming skills under time pressure. Unlock various knives and train designs to customize your gameplay experience. Web Dev &lt;a href='https://www.coolcrazygames.com/'&gt;https://www.coolcrazygames.com/&lt;/a&gt;",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/33mv5i8jxam3pd8940ymuvqxqzivd71j/",
"category": "Arcade",
"tags": "Android, Arcade, HTML5, iPad, iPhone, Mobile, throwing, Unity3D, WebGL",
"thumb": "https://img.gamemonetize.com/33mv5i8jxam3pd8940ymuvqxqzivd71j/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31931",
"title": "House Evolution 3D",
"description": "Welcomt to House Evolution 3D Game! Swipe Left and right and choose the right door to transform from and old ancient house to a big modern Tower! Lets do it!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/5ypg02vkh7sw09wqqw25om7xxcq1dh86/",
"category": "Hypercasual",
"tags": "3D, 3D Games",
"thumb": "https://img.gamemonetize.com/5ypg02vkh7sw09wqqw25om7xxcq1dh86/512x384.jpg",
"width": "350",
"height": "600"
},
{
"id": "31930",
"title": "Sword Hunter",
"description": "Sword Hunter plays like a 2D RPG beat-em-up game. Now you have a chance to control a sword girl to eliminate incoming enemies. Your character is here to uphold justice by eliminating enemies.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/1oa8q7ngksa2dfiy7lhfqitbq75i2k1j/",
"category": "Arcade",
"tags": "Battle, Fighting",
"thumb": "https://img.gamemonetize.com/1oa8q7ngksa2dfiy7lhfqitbq75i2k1j/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31929",
"title": "Build A Rich Queen",
"description": "Make the most accurate choice and become the most beautiful queen! In Build A Rich Queen, you will bring your credit card. When you encounter a POS machine on the road, you can directly swipe the card to buy clothes and other decorations.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/cfgp0kyeoasxuesdaqln3xd8wc6tt6nb/",
"category": "Racing",
"tags": "Arcade, grow",
"thumb": "https://img.gamemonetize.com/cfgp0kyeoasxuesdaqln3xd8wc6tt6nb/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31928",
"title": "Plant Girl Defense Zombie",
"description": "Plant Girl Defense Zombie is a tower-defense shooting strategy game. With 2D cartoon plant girls and zombies, you need to defeat all of the zombies in 24 levels.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/tvmfhxxrzahsek5v97goloybsrswo07s/",
"category": "Hypercasual",
"tags": "Defense, Plant, Zombie",
"thumb": "https://img.gamemonetize.com/tvmfhxxrzahsek5v97goloybsrswo07s/512x384.jpg",
"width": "1280",
"height": "720"
},
{
"id": "31927",
"title": "Boxes Fright Night",
"description": "Help the adorable color Boxes characters collect all the missing pumpkins in this exciting and festive Halloween Puzzle Adventure Game! Use your understanding of physics to move, jump, and rotate the Boxes, solving intricate puzzles and overcoming obstacles along the way. Each level is designed with clever mechanics that will challenge your problem-solving skills and keep you entertained for hours. The charming graphics and spooky Halloween theme create an immersive experience that players of all ages will love. Get into this puzzle game and enjoy the thrill of guiding the Boxes to gather all the pumpkins!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/j51ssa9e9ztmmsldxuud6gzink8ky0bp/",
"category": "Puzzles",
"tags": "Arcade, Family, Halloween, HTML5, jump, Jumping, mapi games, Mobile, Monster, Puzzle",
"thumb": "https://img.gamemonetize.com/j51ssa9e9ztmmsldxuud6gzink8ky0bp/512x384.jpg",
"width": "1024",
"height": "768"
},
{
"id": "31926",
"title": "Fall Boys 2D Parkour",
"description": "In this adventure, you must complete the course to survive. Complete the entire course with your friend. The course may be challenging and filled with obstacles. This does not mean you cannot complete the course. As men, carefully navigate through the entire course. Obstacles are present throughout the course. Be cautious and finish the course. Reach the finish line. The royal crown awaits you. The crown at the end of the chapter is waiting for you.",
"instructions": " You can move by pressing the WASD keys Collect all the gold and reach the royal crown at the end of the level Complete the level safely with your friend ",
"url": "https://html5.gamemonetize.com/cvzmo5oppnxkmo71caz1uhe6urv5pfo5/",
"category": "Arcade",
"tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade",
"thumb": "https://img.gamemonetize.com/cvzmo5oppnxkmo71caz1uhe6urv5pfo5/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31925",
"title": "Utka Clash",
"description": "Utka Clash is a first person shooter game which features tournament deathmatch where your mission is to find weapons scattered across the map to shoot the bots in order to score given amount of frags to progress to the next levels.",
"instructions": "WASD - Move LMB - Shoot RMB - Aim Flashlight Space - Jump R - Reload G - Grenade F - Use C - Crouch ",
"url": "https://html5.gamemonetize.com/zmxjbnv63ylnzq5qvynsjj9e9h9c5mqr/",
"category": "Shooting",
"tags": "3D, 3D Games, Action, First Person Shooter, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, Unity3D, WebGL",
"thumb": "https://img.gamemonetize.com/zmxjbnv63ylnzq5qvynsjj9e9h9c5mqr/512x384.jpg",
"width": "960",
"height": "600"
},
{
"id": "31924",
"title": "Superman Rush",
"description": "Your task is to lead the guy to his beloved, turning him into a Superman. There is a platform on which your hero will walk. Ahead of him awaits various obstacles in the form of round stones with spikes, which will take away his strength.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/ryorv53w2s7r977nzwsiunp241q8rru0/",
"category": "Arcade",
"tags": "3D, Arcade, Casual, HTML5, running",
"thumb": "https://img.gamemonetize.com/ryorv53w2s7r977nzwsiunp241q8rru0/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31923",
"title": "Haggo Jaggo Runner ",
"description": "Haggo Jaggo Runner Exam Objective: The primary goal is to reach the end of the course, marked by a flag, by choosing the correct door at each stage. Setup: Course Layout: The game arena is a large, open field divided into multiple stages, each with a set of two doors. Doors: Each checkpoint features two doors, labeled A and B. Only one of the two doors at each checkpoint will allow players to advance to the next stage. The other door leads to a detour or a minor obstacle that delays the player. Flag: The final destination is marked by a flag, indicating the end of the course.",
"instructions": "Mouse Touch",
"url": "https://html5.gamemonetize.com/ocygpjn3a5svys7p3y2b6y5a21d2m8cz/",
"category": "Adventure",
"tags": ".io Games, 1 Player, Adventure, amazing, Arena, Bejeweled, huggy",
"thumb": "https://img.gamemonetize.com/ocygpjn3a5svys7p3y2b6y5a21d2m8cz/512x384.jpg",
"width": "400",
"height": "800"
},
{
"id": "31922",
"title": "I Want Ice Cream",
"description": "Dive into the frosty fun of I Want Ice Cream ! In this delightful adventure, you take on the role of an adorable penguin living in the heart of Antarctica. Your mission? Navigate the icy landscape, dodge obstacles, and find the hidden ice cream treats. With charming, cartoonish graphics and a catchy soundtrack, this game promises hours of entertainment for players of all ages.",
"instructions": "Use the arrow keys to move the penguin and get the penguin to the ice cream ",
"url": "https://html5.gamemonetize.com/sxxkcw5qy2f664bl76bcuj3lgfxj2iel/",
"category": "Puzzles",
"tags": "Cartoon, Penguin, Platform",
"thumb": "https://img.gamemonetize.com/sxxkcw5qy2f664bl76bcuj3lgfxj2iel/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31921",
"title": "Mustang City Driver 2024",
"description": "Incredible in scope and depth, Mustang City Driver 2024 offers a wide variety of game modes. The city becomes a neon-lit extravaganza at night, and you may enjoy the breathtaking images of that. Police pursuits are triggered when pedestrians are struck, adding an element of unpredictability. Personalize the look and performance of your vehicle. Your cute puppy is right there with you in the middle of all this mayhem. In order to get affluent, you must accomplish all of the games tasks.",
"instructions": "How to play Throttle - W Brake - S Steering - A and D left or right Handbrake - Space Mouse to Rotate Camera Boost - F Change Camera - C Slow Motion - Hold G Lights On Off - L",
"url": "https://html5.gamemonetize.com/q3guizz9xaghxntsfbi7y5vg7cu4za4c/",
"category": "Racing",
"tags": "3D Games, Car, Driving, kiz10, running",
"thumb": "https://img.gamemonetize.com/q3guizz9xaghxntsfbi7y5vg7cu4za4c/512x384.jpg",
"width": "900",
"height": "600"
},
{
"id": "31920",
"title": "Kids Good Habits",
"description": "Kids Good Habits is a lovely educational game. This game has beautiful graphics and animations, as well as very detailed interactive design. This game is divided into four parts, namely, helping the panda brush its teeth, helping the panda take a bath, feeding the puppy, and judging whether the lamb and giraffes behavior is correct. It helps you form good habits in your daily life by letting you play small games. Have a good time!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/lzxm2ytum4rukt7s2w8betiecwwcqpf2/",
"category": "Hypercasual",
"tags": "Educational",
"thumb": "https://img.gamemonetize.com/lzxm2ytum4rukt7s2w8betiecwwcqpf2/512x384.jpg",
"width": "1920",
"height": "1080"
},
{
"id": "31919",
"title": "Hexa Jump ASMR",
"description": "Hexa Jump ASMR is a classic game. As you drop like a ball across colorful spiral platforms, youll encounter traps and obstacles that will test your skills and strategy. One wrong move and the game is over! Your ball shatters into pieces and you have to start all over again. Whether youre waiting in line or looking for a quick break, this game is sure to wow you and fulfill your need forexcitement. Join us and experience the best arcade game!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/zqcxs1myrlq2m2rc6tz45jbxfdvs9n06/",
"category": "Arcade",
"tags": "Ball, Racing",
"thumb": "https://img.gamemonetize.com/zqcxs1myrlq2m2rc6tz45jbxfdvs9n06/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31918",
"title": "The Matrix Merge",
"description": "Step into the dynamic and intriguing world of Matrix Merge, the ultimate puzzle game that challenges your mind with a twist of personality! In this engaging and addictive game, your goal is to merge and match various iconic faces to create mega-characters and achieve high scores. Gameplay Features: Intuitive Controls: Simply swipe to combine faces and create new, larger characters. Easy to learn, but hard to master! Exciting Levels: Explore hundreds of unique levels, each with different challenges and objectives. Can you master them all? Power-Ups and Boosters: Utilize special power-ups like the Personality Blender, Bomb, and Double Points",
"instructions": "Mouse Touch",
"url": "https://html5.gamemonetize.com/i99lrifnezfrvjt692cm91mblkkro6na/",
"category": "Arcade",
"tags": "1 Player, 2 Player, 2D, Adventure, Arcade, Baby Games, Ballon, Bounce, drifting",
"thumb": "https://img.gamemonetize.com/i99lrifnezfrvjt692cm91mblkkro6na/512x384.jpg",
"width": "400",
"height": "800"
},
{
"id": "31917",
"title": "Battle Monsters",
"description": "You have to mutate and turn into a giant monster to defeat your enemies. Turn from a cute little animal into a terrifying beast capable of destroying everything in its path!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/sg33w07lhilmk6tbk6lve03f4c0bsmlk/",
"category": "Arcade",
"tags": "Arcade, bottle, Casual, Monster",
"thumb": "https://img.gamemonetize.com/sg33w07lhilmk6tbk6lve03f4c0bsmlk/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31916",
"title": "Obby Papa Pizzas Escape",
"description": "In this adventure, Obby and Bacon are doing everything they can to survive and escape from the pizza place. Help Obby and Bacon escape from the pizza place with your friend. Be careful, as Chef Papa Pizza is very angry and wants to catch you. Watch out for the pizza maker&amp;mdash;if they catch you, you cant escape and youll lose. Be very careful, as there are obstacles everywhere and the pizza maker is very angry. Bacon can defeat the pizza maker with his sword by throwing it at the pizza maker at the right time. Obby and Bacon need to collect all the pizzas and reach the red door to escape from the pizza maker",
"instructions": " You can move by pressing the WASD keys and Arrow Keys Playable on mobile Mobile controls are available Collect all the pizzas and reach the red door Press the P key to throw the sword ",
"url": "https://html5.gamemonetize.com/r3f64hwuv06hh5tcp57jxxadyn50x28o/",
"category": "Arcade",
"tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade, Mobile",
"thumb": "https://img.gamemonetize.com/r3f64hwuv06hh5tcp57jxxadyn50x28o/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31915",
"title": "Merge Battle Tactics",
"description": "Merge Battle Tactics is a thrilling merge battle game where you command an army of unique monsters. Merge identical creatures to unleash their full potential and strategically position them for combat against your foes. Master the art of merging and tactical placement to dominate the battlefield and emerge victorious in every clash!",
"instructions": "Drag the left mouse button to move and merge the monsters ",
"url": "https://html5.gamemonetize.com/6dn4lsbooah6s0q0kxn0dq0eo9xt7btq/",
"category": "Hypercasual",
"tags": "3D, Action, Animal, Arena, Battle, Casual, Defense, Dinosaur, Dragon, Mobile, Strategy, Wolf",
"thumb": "https://img.gamemonetize.com/6dn4lsbooah6s0q0kxn0dq0eo9xt7btq/512x384.jpg",
"width": "1080",
"height": "1920"
},
{
"id": "31914",
"title": "Nitro Speed Car Racing",
"description": "Nitro Speed Car Racing is a very unique racing game. You need to focus on the pointer on the dial and stop it at the right moment to get the Nitro that can help you rush to the finish line. This is a test of your quick reaction ability. Of course, you can use the coins you collected in the game to upgrade your engine and nitro. Come to a brain contest, stimulate your dopamine, and challenge your reflex limit!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/timymku4ezc41y9z48kyqpud84l8xcmp/",
"category": "Racing",
"tags": "Car, Fighting",
"thumb": "https://img.gamemonetize.com/timymku4ezc41y9z48kyqpud84l8xcmp/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31913",
"title": "Airport Master Plane Tycoon",
"description": "Airport Master - Plane Tycoon is an airport management simulation game. With 3D stickman models, you can control the manager of a larger airport. Each level has a target passenger for you to complete.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/nhpl9vz7xbopqbz155ukc2e9a2xflh3p/",
"category": "Hypercasual",
"tags": "airplane, Simulation, Stickman",
"thumb": "https://img.gamemonetize.com/nhpl9vz7xbopqbz155ukc2e9a2xflh3p/512x384.jpg",
"width": "720",
"height": "1280"
},
{
"id": "31912",
"title": "BFFs Y2K Fashion",
"description": "Welcome to BFFs Y2K Fashion, the exciting new fashion designer game that lets you explore the trend of the year 2000! With a wide selection of styles from the decade, you can create the perfect look and express your fashion sense. From skater girl skirts to ripped jeans and t-shirts, or even the classic Y2K look with fun-colored low-waisted jeans and crop tops, you can customize your outfit and become an ultimate fashion designer. Play now and let your style shine!",
"instructions": "Use your mouse to play this game on desktops or tap to play on mobile devices ",
"url": "https://html5.gamemonetize.com/p2mtojil3f0wqevmy1opkhupjz99wwff/",
"category": "Girls",
"tags": "1 Player, Coloring, Design, Dress Up, Fashion",
"thumb": "https://img.gamemonetize.com/p2mtojil3f0wqevmy1opkhupjz99wwff/512x384.jpg",
"width": "1024",
"height": "768"
},
{
"id": "31911",
"title": "Super War",
"description": "Build a base to defend against enemies. Create a variety of defensive fortifications and give a decent rebuff to every attack from the enemy.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/d0j2wzu4g7hm0dxxr062bkcw5tmrjenn/",
"category": "Arcade",
"tags": "3D, Arcade, Casual, Defense, HTML5, War",
"thumb": "https://img.gamemonetize.com/d0j2wzu4g7hm0dxxr062bkcw5tmrjenn/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31910",
"title": "Girl Game Princess Makeup",
"description": "Girl Game Princess Makeup is an addictive makeup game. In this game, you will choose one of two lovely princesses, then give her a facial spa, manicure, makeup, and stylish clothes. This game not only has beautiful graphics and smooth animations, but also allows you to learn basic skin care knowledge and makeup common sense. Come and have a try if you are interested.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/cd8epkw8ga4zv9lojmv0bttw4sphwzb8/",
"category": "Hypercasual",
"tags": "Dress Up, Makeover",
"thumb": "https://img.gamemonetize.com/cd8epkw8ga4zv9lojmv0bttw4sphwzb8/512x384.jpg",
"width": "1920",
"height": "1080"
},
{
"id": "31909",
"title": "Noob Help Sheep",
"description": "In a game filled with adventures, the noob has to protect the sheep. You must be very careful to protect the sheep. The sheep isnt very smart and cant distinguish friend from foe. As a noob, you must help the sheep. Take your sword and attack all enemies. Kill the enemies to clear the path for the sheep. Help the sheep reach the barn safely. The sheep must reach the barn unharmed. You need to clear the path for the sheep. There should be no enemies or obstacles in its way.",
"instructions": " Press wasd keys to move Press the SPACE key to attack with the sword Double Jump available Mobile Touch Control Kill all the monsters and safely escort them to the barn ",
"url": "https://html5.gamemonetize.com/95nc52yk34ik0jk3jyryp33z3gqoptqp/",
"category": "Arcade",
"tags": "Adventure, Arcade, mineblock, Minecraft, Pixel",
"thumb": "https://img.gamemonetize.com/95nc52yk34ik0jk3jyryp33z3gqoptqp/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31908",
"title": "SnowBall Speed",
"description": "Welcome to SnowBall Speed Winter Racing 3D Game! Tap or mouse click to start racing with your Snow Ball against other players. Slide left and right to dodge obstacles to reach the finish line before others. Good Luck!",
"instructions": "Tap or mouse click to play ",
"url": "https://html5.gamemonetize.com/2s2r5zow54mknn8hnm5chims2cbpaeld/",
"category": "Racing",
"tags": "3D, 3D Games, Ball, Race, Racing, Snow, Unity3D",
"thumb": "https://img.gamemonetize.com/2s2r5zow54mknn8hnm5chims2cbpaeld/512x384.jpg",
"width": "350",
"height": "600"
},
{
"id": "31907",
"title": "Help The Bird",
"description": "Help The Bird is a delightful and engaging game where players assist a little bird in navigating through the sky. Avoid obstacles, collect points, and unlock new levels. With beautiful graphics and intuitive controls, this game is perfect for players of all ages.",
"instructions": "How to Play Tap the screen to make the bird fly Avoid obstacles and enemies as you navigate through the sky Collect points and power-ups to enhance your score Progress through levels and compete for the highest score on the leaderboards Unlock new ch",
"url": "https://html5.gamemonetize.com/fayesw6sf0zvgh9lqdqbcja048bzyvtt/",
"category": "Shooting",
"tags": "1 Player, 2048, 2D, Adventure, Air, amazing, Android, Baby Games, Best Games, Bird, Brain",
"thumb": "https://img.gamemonetize.com/fayesw6sf0zvgh9lqdqbcja048bzyvtt/512x384.jpg",
"width": "1080",
"height": "1920"
},
{
"id": "31906",
"title": "Boxes Funny",
"description": "In the magical land of Bunnyville, the boxes dreams of becoming the greatest egg collector. Every year, Bunnyville hosts the Egg-stravaganza, where Boxes jump over elastics to catch magical colored eggs. Boxes must navigate through various challenging paths filled with moving elastics and tricky obstacles. As Boxes collects more eggs, new areas of Bunnyville open up, each with tougher challenges. The ultimate goal is to find the rare Rainbow Egg, hidden in the most difficult part of Bunnyville.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/hbz4nougtuei8y7f4lgcke2r3itnge5t/",
"category": "Hypercasual",
"tags": "egg, eggames, eggs, Family, HTML5, jump, Jumping, mapi games, Mobile",
"thumb": "https://img.gamemonetize.com/hbz4nougtuei8y7f4lgcke2r3itnge5t/512x384.jpg",
"width": "1024",
"height": "768"
},
{
"id": "31905",
"title": "Elemental Gloves Magic Power",
"description": "Elemental Gloves - Magic Power is a superpower arcade game. Experience the fun of superpowers in magic games? Fascinated by elemental games? In this game, you can use the superpowers in the magic gloves to fight with your enemies. Shooting with flames, attacking with lightning, and attacking with electromagnetic waves, are three ways for you to choose. Dont hesitate to take the opportunity to practice real elemental magic and wipe out the bad guys. Become the greatest elemental master!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/y95ivh95bn3pnk7gaory8rz47ymeo9gp/",
"category": "Boys",
"tags": "Magic",
"thumb": "https://img.gamemonetize.com/y95ivh95bn3pnk7gaory8rz47ymeo9gp/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31904",
"title": "Street Legends",
"description": "Race through the bustling city streets as a daring bike rider in Street Legends: Urban Bike Rider! Your goal is to weave through traffic, dodge vehicles, and overcome challenging obstacles to achieve the highest score possible. With fast-paced gameplay and responsive controls, youll need quick reflexes to avoid collisions. Can you master the art of urban biking and become a true street legend?",
"instructions": "Tap on the right side or press the right arrow key to steer right Tap on the left side or press the left arrow key to steer left ",
"url": "https://html5.gamemonetize.com/fxrupz621ovggap9mxyixwxsqlu193xv/",
"category": "Hypercasual",
"tags": "1 Player, Adventure, amazing, Best, Best Games, Bike, free games for your site, free games for your website, free html5 games for your website, games for your website, html games for your website, html5 games for your site, Hypercasual, Racing",
"thumb": "https://img.gamemonetize.com/fxrupz621ovggap9mxyixwxsqlu193xv/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31903",
"title": "Bounce Ball Timer",
"description": "Bounce Ball Timer is very fun and challenging. In the game, the player collect the three stars and avoid the obstacles to advance to the next level.",
"instructions": "Touch or keyboard",
"url": "https://html5.gamemonetize.com/trx1jai8sfawu7z2g245qb0vqiqnktra/",
"category": "Arcade",
"tags": ".io, .io Games, 2D",
"thumb": "https://img.gamemonetize.com/trx1jai8sfawu7z2g245qb0vqiqnktra/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31902",
"title": "Fashion Battle Dress",
"description": "Beautiful clothes are not enough to win this battle. Each outfit is suitable only for that section of the track if it matches the color of the outfit.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/sg4ok6641eb2lb0xhm6ckm5ub91t61nl/",
"category": "Arcade",
"tags": "3D, Arcade, Casual, Fun, Girl, HTML5",
"thumb": "https://img.gamemonetize.com/sg4ok6641eb2lb0xhm6ckm5ub91t61nl/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31901",
"title": "Escape The Wall",
"description": "Welcome to Escape The Wall, an exhilarating and fast-paced arcade game where you must help your characters swing from one platform to another, avoiding the deadly walls below. With its simple yet challenging mechanics, this game will keep you hooked for hours. Features: Fast-Paced Gameplay: Quick reflexes are essential as you swing from one platform to another. The game speeds up as you progress, adding to the excitement. Simple Controls: Easy-to-learn controls make the game accessible to players of all ages. Just tap to make your characters swing to the next platform.",
"instructions": "How to Play Tap to Swing Tap the screen to make your characters swing from one platform to the next Timing is crucial to avoid falling Avoid the Walls Ensure your characters do not hit the walls below One wrong move can end the game Score Points T",
"url": "https://html5.gamemonetize.com/7jjhgr7klqcvfvnm4p47ynfon0l9qzyg/",
"category": "Puzzles",
"tags": "1 Player, 2D, Adventure, Air, Animal, Baby Games, Best Games, Bridge, html5 games",
"thumb": "https://img.gamemonetize.com/7jjhgr7klqcvfvnm4p47ynfon0l9qzyg/512x384.jpg",
"width": "1080",
"height": "1920"
},
{
"id": "31900",
"title": "Vampire Girl Dress Up",
"description": "Vampire Girl Dress Up is a makeover game designed for girls. In this game, you will follow the vampire princess on a transformation journey. The little vampire princess, Lucy, will shoot a magazine cover with her prince.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/bphagokeqt6106ogf04jr97uqrp9t1bm/",
"category": "Hypercasual",
"tags": "Dress Up, Makeover",
"thumb": "https://img.gamemonetize.com/bphagokeqt6106ogf04jr97uqrp9t1bm/512x384.jpg",
"width": "1080",
"height": "1920"
},
{
"id": "31899",
"title": "Ocean Memory Challenge",
"description": "Dive into the depths of fun with Ocean Memory Challenge! This captivating memory game takes you on an underwater journey where you&amp;rsquo;ll test and train your memory skills. Flip over beautifully designed marine-themed cards to find matching pairs of sea creatures, corals, and treasures. Can you remember where all the treasures are hidden? Start your Ocean Memory Challenge today and find out!",
"instructions": "Tap in the cards to flip them and find out their pairs",
"url": "https://html5.gamemonetize.com/cniyp0sjzfhu2ugsngkxo39bgdrs5nlo/",
"category": "Puzzles",
"tags": "Fish, Memory, Puzzle",
"thumb": "https://img.gamemonetize.com/cniyp0sjzfhu2ugsngkxo39bgdrs5nlo/512x384.jpg",
"width": "1280",
"height": "600"
},
{
"id": "31898",
"title": "The Crazy Dentist wojak game",
"description": "Join Dr. Wojak, the friendly and knowledgeable dentist, in an exciting 2D adventure crafted especially for kids! In Dental Adventure with Dr. Wojak, young players will dive into a colorful world where learning about dental hygiene is both fun and engaging. Features: Engaging Gameplay: Assist Dr. Wojak in various mini-games that involve cleaning, brushing, and caring for patients teeth. Educational Content: Discover the importance of brushing, flossing, and regular dental check-ups through interactive lessons. Colorful Graphics: Delight in vibrant and whimsical graphics that make dental care an enjoyable experience. Customizable Characters:",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/y8iedym7u25m04ns5xdabpzxnp1pyr7h/",
"category": "Cooking",
"tags": ".io Games, 2 Player Games, Adventure, Arcade, Baby Hazel, Bejeweled, Craft, Hidden",
"thumb": "https://img.gamemonetize.com/y8iedym7u25m04ns5xdabpzxnp1pyr7h/512x384.jpg",
"width": "1270",
"height": "650"
},
{
"id": "31897",
"title": "Troll Stick Face Escape",
"description": "The Troll Stick brothers need to collect all the money and become very rich. Help the Troll Stick brothers and make sure they collect all the money. You need to gather all the gold and reach the portal. They must survive in an extreme course full of obstacles and challenges. They need to collect the coins and reach the portal before time runs out. Both Troll Stick brothers need to reach the portal. Ensure they get to the portal safely.",
"instructions": " Move to WASD Arrow Keys Double Jump available Mobile Touch Control",
"url": "https://html5.gamemonetize.com/iecnnc16bzgecvs074g1h7jdw3u1vsup/",
"category": "Arcade",
"tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Best, Mobile, Stickman",
"thumb": "https://img.gamemonetize.com/iecnnc16bzgecvs074g1h7jdw3u1vsup/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31896",
"title": "Potrick Garage Storage",
"description": "Enter the chilling world of Potrick Snaps Meatly Storage, a horror game that plunges you into dark, eerie rooms brimming with jump scares and supernatural surprises. Can you survive the night and unveil the secrets of Potricks house? In this gripping mobile puzzle game, step into the shoes of a mechanic navigating a cluttered garage. Your mission: find hidden machines and unlock them with the correct 4-digit code. Use your wits to solve intricate puzzles, revealing new parts and tools to upgrade your gear, making future tasks easier. Whether you&amp;rsquo;re a seasoned puzzle master or a novice, Meatlys Storage World offers challenges for everyone.",
"instructions": "F flashlight on and off E to interact with objects and machines W A S D to navigate ",
"url": "https://html5.gamemonetize.com/9oo46a87nxtr397y5hww6vjaxu2dpqza/",
"category": "Adventure",
"tags": "3D, Action, Adventure, Escape, Horror",
"thumb": "https://img.gamemonetize.com/9oo46a87nxtr397y5hww6vjaxu2dpqza/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31895",
"title": "Epic Hero Quest: Idle RPG",
"description": "Conquer enemies, level up heroes, unlock skills in Epic Hero Quest: Idle RPG! - Battle Through Hordes of Enemies - Earn Gold and Level Up - Unlock and Upgrade Skills Are you ready to embark on the ultimate adventure? Join the quest and become the legendary hero you were destined to be in Epic Hero Quest: Idle RPG!",
"instructions": "mouse",
"url": "https://html5.gamemonetize.com/w30mtmy14r6rn190pw512ou5o38rc0zv/",
"category": "Adventure",
"tags": "1 Player, Clicker, endless, Flight, RPG, Strategy, Superhero",
"thumb": "https://img.gamemonetize.com/w30mtmy14r6rn190pw512ou5o38rc0zv/512x384.jpg",
"width": "350",
"height": "600"
},
{
"id": "31894",
"title": "game coloring kids",
"description": "a game for children they can paint animals objects have fun painting childrens drawings of balloons tigers whale koala llama and take photos of your drawings",
"instructions": "mouse keyboard arrows",
"url": "https://html5.gamemonetize.com/8np27rvc8ebt1l57srrjnwyyoy4cbfoz/",
"category": "Arcade",
"tags": "Arcade, Coloring, Fun, Kids",
"thumb": "https://img.gamemonetize.com/8np27rvc8ebt1l57srrjnwyyoy4cbfoz/512x384.jpg",
"width": "1280",
"height": "720"
},
{
"id": "31893",
"title": "Digit Shooter 1",
"description": "Digit Shooter! plays like a vertical-version shooting running arcade game. With 3D green numbers, you can launch green numbers to shoot green numbers and numbered walls. You can shoot them and collect them to make your number bigger. Dont waste bullets and time on red walls while avoiding them. When you reach the finish line, try to focus on one line to shoot, then you will collect more rewards",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/9c323gqdrw31aduhihjg59lerxnrmjl6/",
"category": "Shooting",
"tags": "Shooting",
"thumb": "https://img.gamemonetize.com/9c323gqdrw31aduhihjg59lerxnrmjl6/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31892",
"title": "Kids Home Cleanup",
"description": "Kids home cleanup is an educational game. In this game, you can experience cleaning the rooms in Hippos house. Not only can you learn basic housework knowledge, but you can also get satisfaction from the clean results. We have also prepared professional tools for you. Have a good time!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/6hnta1kh22srge0ldhxsffmplww5zgxc/",
"category": "Hypercasual",
"tags": "Cleaning, Educational",
"thumb": "https://img.gamemonetize.com/6hnta1kh22srge0ldhxsffmplww5zgxc/512x384.jpg",
"width": "1280",
"height": "720"
},
{
"id": "31891",
"title": "Merge Cooking Game",
"description": "In this cook and merge simulator game, you will start with simple ingredients and recipes, such as bread, cheese and tomato. Merge them to create new dishes, such as pizza, sandwich and burger. Then merge those dishes to create even more tasty and exotic cuisines, such as sushi, pasta and curry. The more you merge, the more you unlock! With hundreds of different food combinations, ranging from street food staples to high-end delicacies, you can experiment with flavors and create your own unique recipes. As you progress through the game, youll unlock new restaurant themes and exciting challenges.",
"instructions": "you can merge combine and evolve delicious dishes and ingredients and serve to customers ",
"url": "https://html5.gamemonetize.com/3i6pble3gza5vq1z1w2bq473qya3m5y6/",
"category": "Puzzles",
"tags": "Food, Logic, Management, Restaurant, RPG, Simulation",
"thumb": "https://img.gamemonetize.com/3i6pble3gza5vq1z1w2bq473qya3m5y6/512x384.jpg",
"width": "1136",
"height": "640"
},
{
"id": "31890",
"title": "Candy World Saga",
"description": "Explore the candy world with a candy matching challenge. Game story begins with Mark and Julie. Once their grandfather challenged them with a candy puzzle and told them to give many candies after completing the game. So let&amp;rsquo;s help those children to get the candies and match the candy tiles as fast as possible. Make sure to give your move correctly, either game will be over. If you like genres such as tile matching games, puzzle games, quests or just want to have a good time then this game is for you. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests.",
"instructions": "How to play Android Use On-Screen touch and swipe PC Use Mouse Left Click and swipe ",
"url": "https://html5.gamemonetize.com/lkjdtk8zhks6irz0k0uzl7faiz1s2pps/",
"category": "Puzzles",
"tags": "2D, Casual, Match-3, Matching, Puzzle",
"thumb": "https://img.gamemonetize.com/lkjdtk8zhks6irz0k0uzl7faiz1s2pps/512x384.jpg",
"width": "1080",
"height": "1920"
},
{
"id": "31889",
"title": "Goal Dot 3D",
"description": "Welcome to Goal Dot 3D Soccer Game! Aim and release to shoot the ball into the grid to fill the hole with 2 or more Green Dots horizontally or vertically. You play against another player and must complete the mission before your opponent to win and unlock the next level. Can you do it?",
"instructions": "Tap or mouse click to play ",
"url": "https://html5.gamemonetize.com/ofunjjov725sve0gi4rdvdwfism6a8ul/",
"category": "Sports",
"tags": "3D Games, Hypercasual, Soccer, unity games for your website, Unity3D",
"thumb": "https://img.gamemonetize.com/ofunjjov725sve0gi4rdvdwfism6a8ul/512x384.jpg",
"width": "720",
"height": "1280"
},
{
"id": "31888",
"title": "Ultimate Goal",
"description": "Ultimate Goal is an exciting and engaging table football game that brings the fun and thrill of foosball right to your fingertips. Navigate your team through various challenging levels, strategize your moves, and score goals to become the ultimate champion. With vibrant graphics, intuitive controls, and endless gameplay possibilities, Ultimate Goal is perfect for players of all ages.",
"instructions": "Start the Game Tap the play button to begin Control Your Team Use the on-screen controls to move your players up and down Score Goals Strategize your moves to score goals against your opponent Progress Through Levels Complete levels by scoring the ",
"url": "https://html5.gamemonetize.com/zic3isd7x8bpydstdu7r0m6selizpe45/",
"category": "Sports",
"tags": "1 Player, 2 Player, 2 Player Games, 2048, 3D Games, Adult, Android, battleship, Best Games, Classic",
"thumb": "https://img.gamemonetize.com/zic3isd7x8bpydstdu7r0m6selizpe45/512x384.jpg",
"width": "1280",
"height": "720"
},
{
"id": "31887",
"title": "Noob Race Against Time",
"description": "In this adventure, you need to collect all the gold and obtain the key to the chest. You must be very careful to survive in this dangerous forest. You need to gather all the gold scattered throughout the forest. Collect all the gold and obtain the golden key. After you get the key, you must reach the chest. Reach the chest and open it. You must hurry to open the chest. The only way to escape the forest is to reach the chest and open it.",
"instructions": " You can move by pressing the WASD keys Pay attention to obstacles and collect all the gold Collect all the gold and obtain the key ",
"url": "https://html5.gamemonetize.com/8zsbtqci63mrf8i63sftn04imh6mfimf/",
"category": "Arcade",
"tags": "1 Player, Adventure, Arcade, mineblock, Minecraft, Pixel",
"thumb": "https://img.gamemonetize.com/8zsbtqci63mrf8i63sftn04imh6mfimf/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31886",
"title": "Geo Drop",
"description": "Geo Drop is an exciting 2D arcade game where precision and quick reflexes are your keys to victory. Dive into a world of geometric challenges as you strategically launch white balls from the top of the screen to hit and destroy yellow geometric shapes before they reach the top. With a sleek black background and striking red walls, the vibrant colors make every level visually engaging. Master the art of the perfect shot and watch as shapes shatter before you. Can you handle the increasing speed and complexity? Test your skills and aim for the highest score in Geo Drop!",
"instructions": "Touch and release to launch the balls and break the shapes",
"url": "https://html5.gamemonetize.com/8pdxfq6k9biqna6pqezv5b64std8b3zo/",
"category": "Hypercasual",
"tags": "Arkanoid, Ball, Bounce, Bricks, throwing",
"thumb": "https://img.gamemonetize.com/8pdxfq6k9biqna6pqezv5b64std8b3zo/512x384.jpg",
"width": "720",
"height": "1280"
},
{
"id": "31885",
"title": "Ragdoll in backrooms",
"description": "Let your imagination loose with the wide variety of items at your disposal: rangdoll weapons, guns and even bombs! A simple sandbox playground game, where you create your own scenarios.",
"instructions": "Mouse Touch",
"url": "https://html5.gamemonetize.com/vr808mp55a4twt00qur63o7acxjggml8/",
"category": "Hypercasual",
"tags": "angrybirds, Arcade, atv, Battlegrounds, Casual, huggy, Hypercasual, Sandbox, Spiderman",
"thumb": "https://img.gamemonetize.com/vr808mp55a4twt00qur63o7acxjggml8/512x384.jpg",
"width": "600",
"height": "350"
},
{
"id": "31884",
"title": "Happy Mushroom",
"description": "This is a lovely little mushroom elimination game, by clicking to eliminate the connected mushrooms, simple operation, each time the more mushrooms the higher the score, happy mushrooms waiting for you",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/f3n30l5tpch3lmw4xhpyr2moioo2aevv/",
"category": "Puzzles",
"tags": "1 Player, Casual",
"thumb": "https://img.gamemonetize.com/f3n30l5tpch3lmw4xhpyr2moioo2aevv/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31883",
"title": "Baby Panda Summer Vacation",
"description": "Baby Panda Summer Vacation is an interesting educational game. Summer is a season that people love and hate. In summer, you can wear thin clothes without worrying about the cold. But the temperature in summer is very high and the sun is particularly glaring.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/rk43nk0upyfu9g0x6tek495bvdv1q797/",
"category": "Hypercasual",
"tags": "Educational",
"thumb": "https://img.gamemonetize.com/rk43nk0upyfu9g0x6tek495bvdv1q797/512x384.jpg",
"width": "1920",
"height": "1080"
},
{
"id": "31882",
"title": "Football Penalty",
"description": "Step into an exhilarating, never-ending penalty challenge! Show your opponents the power of your accurate shots and become a real football hero. Collect points for every target hit, progress through levels, and improve your football skills. Take part in a big tournament and get more rewards.",
"instructions": "The game features unlimited penalty duels Your goal is to shoot the ball at targets while avoiding obstacles like cones and boxes Be quick and precise to earn more points and win trophies which you can use to unlock new balls Theres also a big penalty",
"url": "https://html5.gamemonetize.com/ikpi1ghjcghyj8jk95k5wif87fz7hfs2/",
"category": "Sports",
"tags": "Ball, Football, Soccer",
"thumb": "https://img.gamemonetize.com/ikpi1ghjcghyj8jk95k5wif87fz7hfs2/512x384.jpg",
"width": "600",
"height": "800"
},
{
"id": "31881",
"title": "Festival Vibes Makeup",
"description": "Join Ellie in Festival Vibes Makeup, a vibrant game radiating the spirit of the summer festivals. Delight in creating neon, boho-Aztec, and grunge makeup looks as you test your makeup artist skills in this colorful makeup game for girls. Mix, match, and shine with stunning eyeshadows, mascaras, lipsticks, and glitter eyebrows!",
"instructions": "Use your mouse to play this game ",
"url": "https://html5.gamemonetize.com/pnudqbp7gclkfw46aodhr1ch875gb66c/",
"category": "Girls",
"tags": "1 Player, Fashion, Makeover, Summer",
"thumb": "https://img.gamemonetize.com/pnudqbp7gclkfw46aodhr1ch875gb66c/512x384.jpg",
"width": "1024",
"height": "768"
},
{
"id": "31880",
"title": "GTA Car Rush",
"description": "Rev up your engines and dive into the thrilling world of GTA Car Rush, a super fun and free-to-play car chase online game perfect for kids! In this exhilarating adventure, your mission is to collect all the money scattered across each level while dodging obstacles and outrunning pursuers. Each collected coin brings you closer to unlocking new and exciting challenges.",
"instructions": "WASD or Arrow keys to drive SpaceBar or K to shoot ",
"url": "https://html5.gamemonetize.com/372nv4l7g2l1vexifnwld5z4rftwcz82/",
"category": "Shooting",
"tags": "Arcade, Avoid, Boy, Cars, Collecting, Driving, gta, Hypercasual, Racing, Skill",
"thumb": "https://img.gamemonetize.com/372nv4l7g2l1vexifnwld5z4rftwcz82/512x384.jpg",
"width": "854",
"height": "480"
},
{
"id": "31879",
"title": "Melon Maker",
"description": "Melon Maker combines classic 2048 gameplay with vibrant fruits and dazzling acrobatics for a flavorful mobile puzzle experience! Last but not least, the adorable capybara will help you drop the fruits!",
"instructions": "Tap to Drop Just tap the screen to choose where the Capybara will drop the juicy fruit Merge Frenzy Merge two identical fruits to create a new bigger one Combo Craze Chain merges to get blasting points and tropical treats ",
"url": "https://html5.gamemonetize.com/e7fv1tobkpavr281wt7cf0jgn2qkn96f/",
"category": "Clicker",
"tags": "1 Player, 2048, amazing, Best Games, Brain",
"thumb": "https://img.gamemonetize.com/e7fv1tobkpavr281wt7cf0jgn2qkn96f/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31878",
"title": "Goal Arena 3D",
"description": "Welcome to Goal Arena 3D Online Soccer Game! Swipe left and right to control your goalkeeper and prevent the ball from passing through the goalpost. You have 3 chances, so score goals against the 3 other opponents and guard your post very well to win.",
"instructions": "Tap or mouse click to play ",
"url": "https://html5.gamemonetize.com/n6rox98hlgh30vr4xqr2tjqkrstmdgrf/",
"category": "Soccer",
"tags": "3D, 3D Games, Football, Hypercasual, Soccer, Sport, Sports, Unity3D",
"thumb": "https://img.gamemonetize.com/n6rox98hlgh30vr4xqr2tjqkrstmdgrf/512x384.jpg",
"width": "350",
"height": "600"
},
{
"id": "31877",
"title": "Sigil Seeker",
"description": "Welcome to Sigil Seeker!\\\\\\\\nEmbark on a quest to collect mystical sigils by tapping tiles on the screen. Add tiles to your row, aiming to gather three identical sigils to collect them. Your goal is to gather all the sigils before time runs out. But beware, if your row overflows or the clock reaches zero, the game is over.\\\\\\\\nAre you ready to become the ultimate Sigil Seeker? Dive in and start your adventure now!",
"instructions": "Use a mouse or touchpad to play this game ",
"url": "https://html5.gamemonetize.com/q2er0px6o5woykc0abyludnhos5265ig/",
"category": "Puzzles",
"tags": "Clicker, html5 games, Mahjong, Matching, Mobile",
"thumb": "https://img.gamemonetize.com/q2er0px6o5woykc0abyludnhos5265ig/512x384.jpg",
"width": "600",
"height": "800"
},
{
"id": "31876",
"title": "Connect The Satellite",
"description": "Connect The Satellite is an engaging puzzle game set in the vastness of space. Players must strategically link satellites with astronauts to create a network, ensuring all connections are perfectly aligned. With mesmerizing graphics and increasingly challenging levels, this game promises hours of captivating gameplay. Perfect for puzzle enthusiasts and space explorers alike!",
"instructions": "How to Play Objective Connect all the satellites with the astronauts to complete the network Controls Tap and drag to draw connections between satellites and astronauts Rules All satellites must be connected to at least one astronaut Connections mu",
"url": "https://html5.gamemonetize.com/io92bxgu3w6hyc55ljusb4mnq6hkg67l/",
"category": "Puzzles",
"tags": "1 Player, 2048, 2D, 3D Games, Action, Air, Baby Games, Battlegrounds, Best Games, city, Crazy",
"thumb": "https://img.gamemonetize.com/io92bxgu3w6hyc55ljusb4mnq6hkg67l/512x384.jpg",
"width": "1920",
"height": "1080"
},
{
"id": "31875",
"title": "Summer Connect",
"description": "You can test your pattern detection skills in this relaxed mahjong &amp;amp; connect puzzle game with summer theme. You can eliminate pair of same tiles. The line connecting the two clicked tiles cant have more than 2 corners. Some levels the tiles can auto slide( to left, to right, to up, to bottom). Can you clear the board before time runs out? Enjoying matching summer tiles with 30 puzzle stages in this game.",
"instructions": "Use mouse to play this connect game ",
"url": "https://html5.gamemonetize.com/iz3q3sl8jz3zpmrfo3kvkizfii2kmtdl/",
"category": "Puzzles",
"tags": "HTML5, Mahjong, Mobile, Summer",
"thumb": "https://img.gamemonetize.com/iz3q3sl8jz3zpmrfo3kvkizfii2kmtdl/512x384.jpg",
"width": "1280",
"height": "768"
},
{
"id": "31874",
"title": "Skibronx Runner",
"description": "Welcome to Skibronx Runner! Here you make your way through the streets in this endless runner game while you encounter various challenges. In the level mode its your goal to reach the grocery store without losing. In the endless mode your goal is to reach as far as possible without losing.",
"instructions": "Up Arrow Key jump 2x Up Arrow Key double jump Holding Up Arrow Key after double jump fly Arrow down Sliding E shoot watergun or bumping",
"url": "https://html5.gamemonetize.com/m3jdpqmzjs20ibx1nhos8m182x8yqsj3/",
"category": "Boys",
"tags": "1 Player, 2D, Action, Adventure, amazing, Arcade, Avoid, Best, Boys, Classic, Enemies, Jumping, running",
"thumb": "https://img.gamemonetize.com/m3jdpqmzjs20ibx1nhos8m182x8yqsj3/512x384.jpg",
"width": "1031",
"height": "580"
},
{
"id": "31873",
"title": "Stickman vs Zombies Minecraft",
"description": "Stickman vs Zombies Minecraft is an action-adventure platform game in which you can play as a brave stick ninja. When you play as a stickman hero, eliminate all the craft zombies and collect coins with each eliminated sombie so you can unlock new skins. Move around the map and look for all the zombies before they find you and run to catch you or shoot at your position. Dont leave even one alive, dont stop moving or all the zombie craft will try to catch you.",
"instructions": "Instructions Search and eliminate all the craft zombies in each level to emerge alive and move on to another level WASD to move and jumpSpacebar and Click mouse to attackE ShieldUse the game buttons for touch devices ",
"url": "https://html5.gamemonetize.com/bztju5apx957kapkxnzocq3au3f8kq3y/",
"category": "Fighting",
"tags": "Fighting, kiz10, Minecraft, Zombie",
"thumb": "https://img.gamemonetize.com/bztju5apx957kapkxnzocq3au3f8kq3y/512x384.jpg",
"width": "900",
"height": "600"
},
{
"id": "31872",
"title": "Magic Princess Dress Up",
"description": "Do you want to dress up as a secondary magic princess? Magic Princess makes your dream come true.Its a stylish ultra-casual simulation game with a strong secondary Barbie style for all unique girls. The game has three modes. You can match your own makeup and outfits, and you can PK with other players, scoring high means you have better taste. You may also match outfits according to the theme. It is important to note that if you choose the wrong one, the game will fail.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/ylol4y8fzxx65fgr367fwuk9qbkou058/",
"category": "Hypercasual",
"tags": "Princess, Simulation",
"thumb": "https://img.gamemonetize.com/ylol4y8fzxx65fgr367fwuk9qbkou058/512x384.jpg",
"width": "750",
"height": "1680"
},
{
"id": "31871",
"title": "Baby Taylor Life Diary ",
"description": "Baby Taylor Life Diary is a cleaning and pet care game for girls. Taylors mum is going out and she has given Taylor the task of cleaning her room. You need to help Taylor along with it. There are 4 tasks, which are bathing your pet, sorting out the scattered toys, cleaning the dusty bookshelf, and making a nice-looking harpsichord. During the game, you can not only enjoy the game but also learn how to do housework and take care of your pet. Can you make sure that you do all the tasks before your mum comes home? Join the game now and try it out.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/qbkxehbhjd2ktnkzzigazxdhhg9v3jdx/",
"category": "Hypercasual",
"tags": "Cat, Cleaning",
"thumb": "https://img.gamemonetize.com/qbkxehbhjd2ktnkzzigazxdhhg9v3jdx/512x384.jpg",
"width": "1280",
"height": "720"
},
{
"id": "31870",
"title": "World S Hardest Game Hate Cube",
"description": "Worlds Hardest Game: Hate Cube is a difficult arcade game. It is also a deep challenge to the players skills and psychological endurance. You will face different challenges and feel the tension. Unlock each special level and overcome countless obstacles. Only the true master can stand on the peak of victory! Challenge the limit and surpass yourself! The most difficult game in the world is waiting for you to fight!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/7wiqs25lalcwv91g77f2fasx2bk1od7l/",
"category": "Puzzles",
"tags": "Arcade, Puzzle",
"thumb": "https://img.gamemonetize.com/7wiqs25lalcwv91g77f2fasx2bk1od7l/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31869",
"title": "Little Panda S Chinese Recipes 2",
"description": "Chinese culture has a long history, and its food culture is also worth appreciating. In this game, you will experience making delicious Chinese food such as Yuanxiao, noodles, and candied haws.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/bafq8i2iqi7qjy77jwcjjbi328tjp909/",
"category": "Girls",
"tags": "Cooking, Educational",
"thumb": "https://img.gamemonetize.com/bafq8i2iqi7qjy77jwcjjbi328tjp909/512x384.jpg",
"width": "1280",
"height": "720"
},
{
"id": "31868",
"title": "Games for Pets",
"description": "Welcome to Games for Pets, the ultimate interactive game designed specifically for your beloved cats and dogs! Keep your furry friends entertained and active as they chase and pounce on moving objects on the screen. Features: Engaging Gameplay: Tap the screen to make various objects move around, enticing your pets to pounce and play. Variety of Objects: From bouncing balls to fluttering butterflies, keep your pets intrigued with a range of different objects. Colorful Graphics: Bright and colorful visuals ensure that the game captures your pet&amp;rsquo;s attention. Interactive Sounds: Enjoy playful sounds that accompany each movement, adding an extra",
"instructions": "Mouse Touch Click ",
"url": "https://html5.gamemonetize.com/w33feb2bpt1n55ecbmjv2rddn6cnkc64/",
"category": "Hypercasual",
"tags": "2 Player Games, Adventure, Cat, Family, Hello Kitty, Kids",
"thumb": "https://img.gamemonetize.com/w33feb2bpt1n55ecbmjv2rddn6cnkc64/512x384.jpg",
"width": "350",
"height": "600"
},
{
"id": "31867",
"title": "Colored Rings",
"description": "Play Colored Rings game online and for free. In it we invite you to solve a puzzle that will be related to rings. In front of you on the screen you will see a playing field on which there will be rings of different colors. They will be linked to each other. You will need to inspect everything very carefully. Using the mouse, you can rotate these rings in space. By doing this, in the game Colored Rings you will unhook the rings from each other and receive points for this. As soon as you completely clear the field of rings, you will move on to the next level of the game.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/jcv3w9zw74yyhxbydp1f0bs5rpmjjk1r/",
"category": "Puzzles",
"tags": "1 Player, 2D, Best, Brain, Casual, Fun, Kids, Logic, Skill",
"thumb": "https://img.gamemonetize.com/jcv3w9zw74yyhxbydp1f0bs5rpmjjk1r/512x384.jpg",
"width": "1080",
"height": "1920"
},
{
"id": "31866",
"title": "Black Holes",
"description": "In this fast-paced, action-packed game, you control a stone that is being pulled towards a fast-moving galaxy object in a space setting. The goal of the game is to make the stone collide with the galaxy object as soon as possible. The further you get before colliding, the higher your score. The game gets faster and more challenging as you progress, so youll need to be quick and nimble to keep up. Features: Fast-paced action: The game is fast-paced and challenging, requiring quick reflexes and good hand-eye coordination. Endless replayability: Play again and again!",
"instructions": "Move the wall piece using mouse hand and meet the moving block ",
"url": "https://html5.gamemonetize.com/ynsi4upnufn5d67xf0ttv5nqqx0mkva7/",
"category": "Hypercasual",
"tags": "blocky, Casual, Educational, Science",
"thumb": "https://img.gamemonetize.com/ynsi4upnufn5d67xf0ttv5nqqx0mkva7/512x384.jpg",
"width": "854",
"height": "480"
},
{
"id": "31865",
"title": "Cute Monkey Mart ",
"description": "an exciting mobile game that takes you on a whimsical journey into a world Monkey Mart is an exciting and captivating mobile game that takes you on a whimsical journey into a world where monkeys run their very own supermarket. Prepare to be immersed in a vibrant and bustling environment where these adorable primates cultivate and sell a wide array of items to their fellow animal customers.",
"instructions": "As a player you step into the role of a diligent monkey entrepreneur responsible for managing and expanding Monkey Mart Your primary objective is to help the monkeys grow their business ensuring that the supermarket thrives and becomes the go-to desti",
"url": "https://html5.gamemonetize.com/labp0rn30i2bbbaj0bmd163u9lty6ung/",
"category": "Hypercasual",
"tags": "1 Player, 2D, amazing, Animal, Best Games",
"thumb": "https://img.gamemonetize.com/labp0rn30i2bbbaj0bmd163u9lty6ung/512x384.jpg",
"width": "750",
"height": "1334"
},
{
"id": "31864",
"title": "Truck Heavy Transporter",
"description": "Get ready for the ultimate driving experience with Truck Heavy Transporter! Navigate challenging terrains, master precise handling, and deliver oversized cargo across diverse landscapes. From rugged mountains to bustling cities, your mission is to transport heavy loads safely and efficiently. With realistic physics, dynamic weather, and various trucks to choose from, every journey is an adventure. Prove your driving skills and become the top transporter in this thrilling, immersive game!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/sant2y505yenydyr0jplapai6ug8ju0q/",
"category": "Arcade",
"tags": "Arcade, Driving, Unity3D, WebGL",
"thumb": "https://img.gamemonetize.com/sant2y505yenydyr0jplapai6ug8ju0q/512x384.jpg",
"width": "800",
"height": "600"
},
{
"id": "31863",
"title": "Solitaire Match Puzzle",
"description": "Hot pot, barbecue, custard tarts, pasta whatever you love is here. Solitaire Match Puzzle is a food-themed puzzle game. The game contains food and desserts from all over the world, every time the game starts there will be a lot of food cards, and these cards overlap each other.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/eich7vpcet72i1u1gzsoxs9u88fir3na/",
"category": "Puzzles",
"tags": "Card, Puzzle",
"thumb": "https://img.gamemonetize.com/eich7vpcet72i1u1gzsoxs9u88fir3na/512x384.jpg",
"width": "720",
"height": "1280"
},
{
"id": "31862",
"title": "Girl Bike Fix Washing Salon",
"description": "Girl Bike Fix Washing Salon is a cleaning game. In this game, you can not only clean the bike but also fix it. We provide you with two colors of bikes, purple and pink, which are very suitable for girls. You can choose one you like best to start cleaning and repairing.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/g3nt31ov6meqkq2vikfc4fgzu77zonxt/",
"category": "Hypercasual",
"tags": "Cleaning",
"thumb": "https://img.gamemonetize.com/g3nt31ov6meqkq2vikfc4fgzu77zonxt/512x384.jpg",
"width": "1920",
"height": "1080"
},
{
"id": "31861",
"title": "World War III",
"description": "There are 50 robots in this game and you win by killing the robots in the game, but since there are robots in it, do you know why it is called World War III? The reason it is called World War III is because World War III is planned to be between humans and robots, in fact the background of the game is on Mars, we could have named it Mars War I. How funny would that be. :)",
"instructions": "In the game you try to kill 50 robots using your mouse and keyboard remember this is your mission FOR KEYBOARD Movement W A S D and arrow keys Shoot Left Mouse Button Aim Right Mouse Button Jump Space Key Speed Shift Keys You can also play",
"url": "https://html5.gamemonetize.com/vii6uglju9bj85lyidxtqtu7gm4ok0bq/",
"category": "Adventure",
"tags": "3D, 3D Games, Action, Adventure, destroying, War, weapons",
"thumb": "https://img.gamemonetize.com/vii6uglju9bj85lyidxtqtu7gm4ok0bq/512x384.jpg",
"width": "3840",
"height": "2160"
},
{
"id": "31860",
"title": "Simple Word Search",
"description": "A fun simple crossword puzzle game. Engage in an entertaining and straightforward crossword puzzle game! Challenge your vocabulary skills by discovering hidden words. Can you find them all to win?",
"instructions": "Mouse click or tap to play Click tap the letters to select them in a group Find the matching words in the crossword puzzle as the ones listed at the top to win ",
"url": "https://html5.gamemonetize.com/rz2wh4eyph6olj3yhu8onr9zu9ntkky9/",
"category": "Puzzles",
"tags": "Hypercasual, Puzzle, Word",
"thumb": "https://img.gamemonetize.com/rz2wh4eyph6olj3yhu8onr9zu9ntkky9/512x384.jpg",
"width": "412",
"height": "915"
},
{
"id": "31859",
"title": "The Good Dinosaur Cooking Adventure",
"description": "Embark on The Good Dinosaur Cooking Adventure with Milo and Spike as they create a special corn dish for Papa! Explore levels like finding ingredients, cutting, crafting fire, cooking, and serving in this culinary journey amidst bountiful cornfields.",
"instructions": "Follow Milo and Spikes journey Click to find cut craft cook and serve Impress Papa with your culinary skills ",
"url": "https://html5.gamemonetize.com/kxlczk0sjqx4xk5g68x8tw07xrci2uvl/",
"category": "Girls",
"tags": "Cooking, Dinosaur",
"thumb": "https://img.gamemonetize.com/kxlczk0sjqx4xk5g68x8tw07xrci2uvl/512x384.jpg",
"width": "1920",
"height": "1080"
},
{
"id": "31858",
"title": "QuackTut",
"description": "Hello everyone &amp;lt;3 I am pleased to try my first game. I did my best to make my first game enjoyable for you. I hope you do that. I want you to create a simple video explaining how to achieve this. If you like my game and want to support me, I will be very grateful to you, and I promise that soon, I will make more than one other game and continuously develop this game by trying to create new and exciting ideas. Garden by Sakura Girl | Music promoted by Creative Commons CC BY 3.0",
"instructions": " I made a gift for every player who reached 10 000 points how to play Pharaoh Duck press 3 times on the enemy to defeat it you will get 5 points press on the pharaoh duck to make a point every press 1 point if you cant help out the cute duck and the",
"url": "https://html5.gamemonetize.com/arzvexkivcrxvfik47x1nq3mmhoysqvv/",
"category": "Clicker",
"tags": "1 Player, 2D, Animal, Anime, Cartoon, Cute, Kids, Love, Music",
"thumb": "https://img.gamemonetize.com/arzvexkivcrxvfik47x1nq3mmhoysqvv/512x384.jpg",
"width": "1280",
"height": "720"
},
{
"id": "31857",
"title": "Boxes Chaser",
"description": "Hey help the little color Boxes to escape from the Chaser! Avoid all obstacles and try to resit the more you can! Complete all 20 space Levels and go back to the earth!",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/71gv5nc8syk7ax4b9ubbdk5pvm7nawog/",
"category": "Clicker",
"tags": "Arcade, HTML5, jump, Jumping, mapi games, Mobile, running",
"thumb": "https://img.gamemonetize.com/71gv5nc8syk7ax4b9ubbdk5pvm7nawog/512x384.jpg",
"width": "1024",
"height": "768"
},
{
"id": "31856",
"title": "Frog Jumper",
"description": "Dive into the enchanting world of Frog Jumper, where you guide a lively frog through a series of thrilling jumps and platforms. Test your reflexes and timing as you navigate through challenging obstacles to achieve the highest score. Perfect for players of all ages, Frog Jumper offers endless fun and excitement!",
"instructions": "How to Play Tap the screen to make the frog jump Time your jumps to land on platforms and avoid falling Collect coins and power-ups to boost your score Avoid obstacles and try to jump as far as possible The game ends when the frog falls off the platf",
"url": "https://html5.gamemonetize.com/dv2j3ijd4mbxk1fbkatnp46q725m5l26/",
"category": "Arcade",
"tags": "1 Player, 2048, 2D, Adventure, amazing, Arcade, Baby Games, Brain, Crazy",
"thumb": "https://img.gamemonetize.com/dv2j3ijd4mbxk1fbkatnp46q725m5l26/512x384.jpg",
"width": "1080",
"height": "1920"
},
{
"id": "31855",
"title": "Animal Farm Merge",
"description": "Dive into a Animal farm journey where you can train your skills to merge all the animals and get the big Horse. Can you be the first one to get the giant horse ? Lets find out in . Are you ready to take on the challenge and become the ultimate fruit merging master? Start your Farming adventure in Animal farm merge now!",
"instructions": "Mouse Touch",
"url": "https://html5.gamemonetize.com/k87d287ldcd5en9q2m1m5g4tro4s8jf3/",
"category": "Hypercasual",
"tags": ".io Games, 1 Player, Bubble Shooter, Chicken, Crafting, Defense, Driving, Friv, Summer",
"thumb": "https://img.gamemonetize.com/k87d287ldcd5en9q2m1m5g4tro4s8jf3/512x384.jpg",
"width": "400",
"height": "800"
},
{
"id": "31854",
"title": "Airport Security 3d",
"description": "Airport Security 3D is an airport security check simulation game with 3D cartoon models. Your mission is to arrest criminals with fake IDs and weapons while approving civilians. On the counter, you need to check the passengers name and corresponding ID card. At the security checkpoint, you are required to check their baggage and find the criminals who take weapons. Finally, you can question the criminals.",
"instructions": "Mouse click or tap to play",
"url": "https://html5.gamemonetize.com/vsgpevum1ik6sadjaxiu5wbr07vcks2b/",
"category": "Hypercasual",
"tags": "airplane, Simulation",
"thumb": "https://img.gamemonetize.com/vsgpevum1ik6sadjaxiu5wbr07vcks2b/512x384.jpg",
"width": "720",
"height": "1280"
},
{
"id": "31853",
"title": "Fruit Merge Catalogue",
"description": "Dive into a fruit-matching journey where you can train your skills to merge all the fruits and get the big watermelon . Can you be the first one to get the giant watermelon? Lets find out in . Are you ready to take on the challenge and become the ultimate fruit merging master? Start your fruity adventure in Fruit merge now!",
"instructions": "Drage and drop Using Mouse Touch screen ",
"url": "https://html5.gamemonetize.com/rowsfkels23s8apc3n30bx3yvguo66wd/",
"category": "Puzzles",
"tags": ".io Games, Casual, Hypercasual",
"thumb": "https://img.gamemonetize.com/rowsfkels23s8apc3n30bx3yvguo66wd/512x384.jpg",
"width": "400",
"height": "800"
},
{
"id": "31852",
"title": "TrollHead to Face",
"description": "In this adventure, the troll-faced stick must remain calm and humorous as he needs to survive in this sky parkour challenge. The troll-faced character must be fast and collect all the gold before time runs out. He needs to gather the gold, run, and reach the black portal. Surviving in this perilous world full of parkours is truly difficult. To survive, you must run very quickly. You need to collect the gold safely and pass each parkour without falling down. Navigate through the obstacles on the way and reach the portal.",
"instructions": " You can move by pressing the WASD keys The game features double jumping Reach the portal before time runs out ",
"url": "https://html5.gamemonetize.com/p1tsoue1cg06e4jrmg21yvhrka0kj919/",
"category": "Arcade",
"tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade, Best, Pixel",
"thumb": "https://img.gamemonetize.com/p1tsoue1cg06e4jrmg21yvhrka0kj919/512x384.jpg",
"width": "800",
"height": "600"
}
]
