[
  {
    "id": "31933",
    "title": "Sword Hunter",
    "description": "Sword Hunter plays like a 2D RPG beat-em-up game. Now you have a chance to control a sword girl to eliminate incoming enemies. Your character is here to uphold justice by eliminating enemies.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/1oa8q7ngksa2dfiy7lhfqitbq75i2k1j/",
    "category": "Arcade",
    "tags": "Battle, Fighting",
    "thumb": "https://img.gamemonetize.com/1oa8q7ngksa2dfiy7lhfqitbq75i2k1j/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31932",
    "title": "Build A Rich Queen",
    "description": "Make the most accurate choice and become the most beautiful queen! In Build A Rich Queen, you will bring your credit card. When you encounter a POS machine on the road, you can directly swipe the card to buy clothes and other decorations.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/cfgp0kyeoasxuesdaqln3xd8wc6tt6nb/",
    "category": "Racing",
    "tags": "Arcade, grow",
    "thumb": "https://img.gamemonetize.com/cfgp0kyeoasxuesdaqln3xd8wc6tt6nb/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31931",
    "title": "Plant Girl Defense Zombie",
    "description": "Plant Girl Defense Zombie is a tower-defense shooting strategy game. With 2D cartoon plant girls and zombies, you need to defeat all of the zombies in 24 levels.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/tvmfhxxrzahsek5v97goloybsrswo07s/",
    "category": "Hypercasual",
    "tags": "Defense, Plant, Zombie",
    "thumb": "https://img.gamemonetize.com/tvmfhxxrzahsek5v97goloybsrswo07s/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31930",
    "title": "Boxes Fright Night",
    "description": "Help the adorable color Boxes characters collect all the missing pumpkins in this exciting and festive Halloween Puzzle Adventure Game! Use your understanding of physics to move, jump, and rotate the Boxes, solving intricate puzzles and overcoming obstacles along the way. Each level is designed with clever mechanics that will challenge your problem-solving skills and keep you entertained for hours. The charming graphics and spooky Halloween theme create an immersive experience that players of all ages will love. Get into this puzzle game and enjoy the thrill of guiding the Boxes to gather all the pumpkins!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/j51ssa9e9ztmmsldxuud6gzink8ky0bp/",
    "category": "Puzzles",
    "tags": "Arcade, Family, Halloween, HTML5, jump, Jumping, mapi games, Mobile, Monster, Puzzle",
    "thumb": "https://img.gamemonetize.com/j51ssa9e9ztmmsldxuud6gzink8ky0bp/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31929",
    "title": "Fall Boys 2D Parkour",
    "description": "In this adventure, you must complete the course to survive. Complete the entire course with your friend. The course may be challenging and filled with obstacles. This does not mean you cannot complete the course. As men, carefully navigate through the entire course. Obstacles are present throughout the course. Be cautious and finish the course. Reach the finish line. The royal crown awaits you. The crown at the end of the chapter is waiting for you.",
    "instructions": " You can move by pressing the WASD keys Collect all the gold and reach the royal crown at the end of the level Complete the level safely with your friend ",
    "url": "https://html5.gamemonetize.com/cvzmo5oppnxkmo71caz1uhe6urv5pfo5/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade",
    "thumb": "https://img.gamemonetize.com/cvzmo5oppnxkmo71caz1uhe6urv5pfo5/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31928",
    "title": "Utka Clash",
    "description": "Utka Clash is a first person shooter game which features tournament deathmatch where your mission is to find weapons scattered across the map to shoot the bots in order to score given amount of frags to progress to the next levels.",
    "instructions": "WASD - Move LMB - Shoot RMB - Aim Flashlight Space - Jump R - Reload G - Grenade F - Use C - Crouch ",
    "url": "https://html5.gamemonetize.com/zmxjbnv63ylnzq5qvynsjj9e9h9c5mqr/",
    "category": "Shooting",
    "tags": "3D, 3D Games, Action, First Person Shooter, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/zmxjbnv63ylnzq5qvynsjj9e9h9c5mqr/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "31927",
    "title": "Superman Rush",
    "description": "Your task is to lead the guy to his beloved, turning him into a Superman. There is a platform on which your hero will walk. Ahead of him awaits various obstacles in the form of round stones with spikes, which will take away his strength.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/ryorv53w2s7r977nzwsiunp241q8rru0/",
    "category": "Arcade",
    "tags": "3D, Arcade, Casual, HTML5, running",
    "thumb": "https://img.gamemonetize.com/ryorv53w2s7r977nzwsiunp241q8rru0/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31926",
    "title": "Rabbit Punch Rabbit ",
    "description": "Are you ready to dive into the exciting world of reaction and competition? Then this game is created especially for you! Whether you prefer to battle a car or a friend on the same device, youre guaranteed a dose of adrenaline and fun every time you touch the screen. The hare is our main character. He will appear at the most unexpected moment and only for a moment. Your job is to be quick and hit him before he disappears. After all, the one who manages to hit the hare first will be rewarded with points. In this game, reaction is your main tool, and you must use it to its full potential to win.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/pgdivazlfi4x3u9byflherbvhelzpif8/",
    "category": "Clicker",
    "tags": "1 Player, 2 Player, 2 Player Games, Arcade, Arena",
    "thumb": "https://img.gamemonetize.com/pgdivazlfi4x3u9byflherbvhelzpif8/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31925",
    "title": "Haggo Jaggo Runner ",
    "description": "Haggo Jaggo Runner Exam Objective: The primary goal is to reach the end of the course, marked by a flag, by choosing the correct door at each stage. Setup: Course Layout: The game arena is a large, open field divided into multiple stages, each with a set of two doors. Doors: Each checkpoint features two doors, labeled A and B. Only one of the two doors at each checkpoint will allow players to advance to the next stage. The other door leads to a detour or a minor obstacle that delays the player. Flag: The final destination is marked by a flag, indicating the end of the course.",
    "instructions": "Mouse Touch",
    "url": "https://html5.gamemonetize.com/ocygpjn3a5svys7p3y2b6y5a21d2m8cz/",
    "category": "Adventure",
    "tags": ".io Games, 1 Player, Adventure, amazing, Arena, Bejeweled, huggy",
    "thumb": "https://img.gamemonetize.com/ocygpjn3a5svys7p3y2b6y5a21d2m8cz/512x384.jpg",
    "width": "400",
    "height": "800"
  },
  {
    "id": "31924",
    "title": "I Want Ice Cream",
    "description": "Dive into the frosty fun of I Want Ice Cream ! In this delightful adventure, you take on the role of an adorable penguin living in the heart of Antarctica. Your mission? Navigate the icy landscape, dodge obstacles, and find the hidden ice cream treats. With charming, cartoonish graphics and a catchy soundtrack, this game promises hours of entertainment for players of all ages.",
    "instructions": "Use the arrow keys to move the penguin and get the penguin to the ice cream ",
    "url": "https://html5.gamemonetize.com/sxxkcw5qy2f664bl76bcuj3lgfxj2iel/",
    "category": "Puzzles",
    "tags": "Cartoon, Penguin, Platform",
    "thumb": "https://img.gamemonetize.com/sxxkcw5qy2f664bl76bcuj3lgfxj2iel/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31923",
    "title": "Mustang City Driver 2024",
    "description": "Incredible in scope and depth, Mustang City Driver 2024 offers a wide variety of game modes. The city becomes a neon-lit extravaganza at night, and you may enjoy the breathtaking images of that. Police pursuits are triggered when pedestrians are struck, adding an element of unpredictability. Personalize the look and performance of your vehicle. Your cute puppy is right there with you in the middle of all this mayhem. In order to get affluent, you must accomplish all of the games tasks.",
    "instructions": "How to play Throttle - W Brake - S Steering - A and D left or right Handbrake - Space Mouse to Rotate Camera Boost - F Change Camera - C Slow Motion - Hold G Lights On Off - L",
    "url": "https://html5.gamemonetize.com/q3guizz9xaghxntsfbi7y5vg7cu4za4c/",
    "category": "Racing",
    "tags": "3D Games, Car, Driving, kiz10, running",
    "thumb": "https://img.gamemonetize.com/q3guizz9xaghxntsfbi7y5vg7cu4za4c/512x384.jpg",
    "width": "900",
    "height": "600"
  },
  {
    "id": "31922",
    "title": "Kids Good Habits",
    "description": "Kids Good Habits is a lovely educational game. This game has beautiful graphics and animations, as well as very detailed interactive design. This game is divided into four parts, namely, helping the panda brush its teeth, helping the panda take a bath, feeding the puppy, and judging whether the lamb and giraffes behavior is correct. It helps you form good habits in your daily life by letting you play small games. Have a good time!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/lzxm2ytum4rukt7s2w8betiecwwcqpf2/",
    "category": "Hypercasual",
    "tags": "Educational",
    "thumb": "https://img.gamemonetize.com/lzxm2ytum4rukt7s2w8betiecwwcqpf2/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31921",
    "title": "Hexa Jump ASMR",
    "description": "Hexa Jump ASMR is a classic game. As you drop like a ball across colorful spiral platforms, youll encounter traps and obstacles that will test your skills and strategy. One wrong move and the game is over! Your ball shatters into pieces and you have to start all over again. Whether youre waiting in line or looking for a quick break, this game is sure to wow you and fulfill your need forexcitement. Join us and experience the best arcade game!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/zqcxs1myrlq2m2rc6tz45jbxfdvs9n06/",
    "category": "Arcade",
    "tags": "Ball, Racing",
    "thumb": "https://img.gamemonetize.com/zqcxs1myrlq2m2rc6tz45jbxfdvs9n06/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31920",
    "title": "The Matrix Merge",
    "description": "Step into the dynamic and intriguing world of Matrix Merge, the ultimate puzzle game that challenges your mind with a twist of personality! In this engaging and addictive game, your goal is to merge and match various iconic faces to create mega-characters and achieve high scores. Gameplay Features: Intuitive Controls: Simply swipe to combine faces and create new, larger characters. Easy to learn, but hard to master! Exciting Levels: Explore hundreds of unique levels, each with different challenges and objectives. Can you master them all? Power-Ups and Boosters: Utilize special power-ups like the Personality Blender, Bomb, and Double Points",
    "instructions": "Mouse Touch",
    "url": "https://html5.gamemonetize.com/i99lrifnezfrvjt692cm91mblkkro6na/",
    "category": "Arcade",
    "tags": "1 Player, 2 Player, 2D, Adventure, Arcade, Baby Games, Ballon, Bounce, drifting",
    "thumb": "https://img.gamemonetize.com/i99lrifnezfrvjt692cm91mblkkro6na/512x384.jpg",
    "width": "400",
    "height": "800"
  },
  {
    "id": "31919",
    "title": "Battle Monsters",
    "description": "You have to mutate and turn into a giant monster to defeat your enemies. Turn from a cute little animal into a terrifying beast capable of destroying everything in its path!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/sg33w07lhilmk6tbk6lve03f4c0bsmlk/",
    "category": "Arcade",
    "tags": "Arcade, bottle, Casual, Monster",
    "thumb": "https://img.gamemonetize.com/sg33w07lhilmk6tbk6lve03f4c0bsmlk/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31918",
    "title": "Obby Papa Pizzas Escape",
    "description": "In this adventure, Obby and Bacon are doing everything they can to survive and escape from the pizza place. Help Obby and Bacon escape from the pizza place with your friend. Be careful, as Chef Papa Pizza is very angry and wants to catch you. Watch out for the pizza maker&amp;mdash;if they catch you, you cant escape and youll lose. Be very careful, as there are obstacles everywhere and the pizza maker is very angry. Bacon can defeat the pizza maker with his sword by throwing it at the pizza maker at the right time. Obby and Bacon need to collect all the pizzas and reach the red door to escape from the pizza maker",
    "instructions": " You can move by pressing the WASD keys and Arrow Keys Playable on mobile Mobile controls are available Collect all the pizzas and reach the red door Press the P key to throw the sword ",
    "url": "https://html5.gamemonetize.com/r3f64hwuv06hh5tcp57jxxadyn50x28o/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade, Mobile",
    "thumb": "https://img.gamemonetize.com/r3f64hwuv06hh5tcp57jxxadyn50x28o/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31917",
    "title": "Green Clicker Game",
    "description": "In this game, all you have to do is click on the screen or mouse. You can see your clicks per second and your total clicks. Its a very simple game.",
    "instructions": "All you have to do is click on the screen or mouse ",
    "url": "https://html5.gamemonetize.com/li1n6uejdfkd0gm7s25mptf2la2h4ar0/",
    "category": "Clicker",
    "tags": "1 Player, Click, Clicker",
    "thumb": "https://img.gamemonetize.com/li1n6uejdfkd0gm7s25mptf2la2h4ar0/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "31916",
    "title": "Merge Battle Tactics",
    "description": "Merge Battle Tactics is a thrilling merge battle game where you command an army of unique monsters. Merge identical creatures to unleash their full potential and strategically position them for combat against your foes. Master the art of merging and tactical placement to dominate the battlefield and emerge victorious in every clash!",
    "instructions": "Drag the left mouse button to move and merge the monsters ",
    "url": "https://html5.gamemonetize.com/6dn4lsbooah6s0q0kxn0dq0eo9xt7btq/",
    "category": "Hypercasual",
    "tags": "3D, Action, Animal, Arena, Battle, Casual, Defense, Dinosaur, Dragon, Mobile, Strategy, Wolf",
    "thumb": "https://img.gamemonetize.com/6dn4lsbooah6s0q0kxn0dq0eo9xt7btq/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31915",
    "title": "Nitro Speed Car Racing",
    "description": "Nitro Speed Car Racing is a very unique racing game. You need to focus on the pointer on the dial and stop it at the right moment to get the Nitro that can help you rush to the finish line. This is a test of your quick reaction ability. Of course, you can use the coins you collected in the game to upgrade your engine and nitro. Come to a brain contest, stimulate your dopamine, and challenge your reflex limit!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/timymku4ezc41y9z48kyqpud84l8xcmp/",
    "category": "Racing",
    "tags": "Car, Fighting",
    "thumb": "https://img.gamemonetize.com/timymku4ezc41y9z48kyqpud84l8xcmp/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31914",
    "title": "angry bird vs pig",
    "description": "Descending from the skies, Angry Bird engages in a mortal battle against Heel. This is an exciting adventure in which you have to skillfully knock down buildings so that the bird can fall right on the heel and destroy it with its menacing chase. The game requires high skill and strategic thinking to succeed. The angry bird can use its abilities to destroy various buildings and move to new objects. Each level is a unique puzzle that requires quick solutions and good accuracy.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/prfqweqswkh5tvtsy2s7uhombdapvo6c/",
    "category": "Puzzles",
    "tags": "angrybirds, Arcade",
    "thumb": "https://img.gamemonetize.com/prfqweqswkh5tvtsy2s7uhombdapvo6c/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31913",
    "title": "Airport Master Plane Tycoon",
    "description": "Airport Master - Plane Tycoon is an airport management simulation game. With 3D stickman models, you can control the manager of a larger airport. Each level has a target passenger for you to complete.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/nhpl9vz7xbopqbz155ukc2e9a2xflh3p/",
    "category": "Hypercasual",
    "tags": "airplane, Simulation, Stickman",
    "thumb": "https://img.gamemonetize.com/nhpl9vz7xbopqbz155ukc2e9a2xflh3p/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31912",
    "title": "BFFs Y2K Fashion",
    "description": "Welcome to BFFs Y2K Fashion, the exciting new fashion designer game that lets you explore the trend of the year 2000! With a wide selection of styles from the decade, you can create the perfect look and express your fashion sense. From skater girl skirts to ripped jeans and t-shirts, or even the classic Y2K look with fun-colored low-waisted jeans and crop tops, you can customize your outfit and become an ultimate fashion designer. Play now and let your style shine!",
    "instructions": "Use your mouse to play this game on desktops or tap to play on mobile devices ",
    "url": "https://html5.gamemonetize.com/p2mtojil3f0wqevmy1opkhupjz99wwff/",
    "category": "Girls",
    "tags": "1 Player, Coloring, Design, Dress Up, Fashion",
    "thumb": "https://img.gamemonetize.com/p2mtojil3f0wqevmy1opkhupjz99wwff/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31911",
    "title": "Super War",
    "description": "Build a base to defend against enemies. Create a variety of defensive fortifications and give a decent rebuff to every attack from the enemy.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/d0j2wzu4g7hm0dxxr062bkcw5tmrjenn/",
    "category": "Arcade",
    "tags": "3D, Arcade, Casual, Defense, HTML5, War",
    "thumb": "https://img.gamemonetize.com/d0j2wzu4g7hm0dxxr062bkcw5tmrjenn/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31910",
    "title": "Girl Game Princess Makeup",
    "description": "Girl Game Princess Makeup is an addictive makeup game. In this game, you will choose one of two lovely princesses, then give her a facial spa, manicure, makeup, and stylish clothes. This game not only has beautiful graphics and smooth animations, but also allows you to learn basic skin care knowledge and makeup common sense. Come and have a try if you are interested.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/cd8epkw8ga4zv9lojmv0bttw4sphwzb8/",
    "category": "Hypercasual",
    "tags": "Dress Up, Makeover",
    "thumb": "https://img.gamemonetize.com/cd8epkw8ga4zv9lojmv0bttw4sphwzb8/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31909",
    "title": "Noob Help Sheep",
    "description": "In a game filled with adventures, the noob has to protect the sheep. You must be very careful to protect the sheep. The sheep isnt very smart and cant distinguish friend from foe. As a noob, you must help the sheep. Take your sword and attack all enemies. Kill the enemies to clear the path for the sheep. Help the sheep reach the barn safely. The sheep must reach the barn unharmed. You need to clear the path for the sheep. There should be no enemies or obstacles in its way.",
    "instructions": " Press wasd keys to move Press the SPACE key to attack with the sword Double Jump available Mobile Touch Control Kill all the monsters and safely escort them to the barn ",
    "url": "https://html5.gamemonetize.com/95nc52yk34ik0jk3jyryp33z3gqoptqp/",
    "category": "Arcade",
    "tags": "Adventure, Arcade, mineblock, Minecraft, Pixel",
    "thumb": "https://img.gamemonetize.com/95nc52yk34ik0jk3jyryp33z3gqoptqp/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31908",
    "title": "SnowBall Speed",
    "description": "Welcome to SnowBall Speed Winter Racing 3D Game! Tap or mouse click to start racing with your Snow Ball against other players. Slide left and right to dodge obstacles to reach the finish line before others. Good Luck!",
    "instructions": "Tap or mouse click to play ",
    "url": "https://html5.gamemonetize.com/2s2r5zow54mknn8hnm5chims2cbpaeld/",
    "category": "Racing",
    "tags": "3D, 3D Games, Ball, Race, Racing, Snow, Unity3D",
    "thumb": "https://img.gamemonetize.com/2s2r5zow54mknn8hnm5chims2cbpaeld/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "31907",
    "title": "Help The Bird",
    "description": "Help The Bird is a delightful and engaging game where players assist a little bird in navigating through the sky. Avoid obstacles, collect points, and unlock new levels. With beautiful graphics and intuitive controls, this game is perfect for players of all ages.",
    "instructions": "How to Play Tap the screen to make the bird fly Avoid obstacles and enemies as you navigate through the sky Collect points and power-ups to enhance your score Progress through levels and compete for the highest score on the leaderboards Unlock new ch",
    "url": "https://html5.gamemonetize.com/fayesw6sf0zvgh9lqdqbcja048bzyvtt/",
    "category": "Shooting",
    "tags": "1 Player, 2048, 2D, Adventure, Air, amazing, Android, Baby Games, Best Games, Bird, Brain",
    "thumb": "https://img.gamemonetize.com/fayesw6sf0zvgh9lqdqbcja048bzyvtt/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31906",
    "title": "Boxes Funny",
    "description": "In the magical land of Bunnyville, the boxes dreams of becoming the greatest egg collector. Every year, Bunnyville hosts the Egg-stravaganza, where Boxes jump over elastics to catch magical colored eggs. Boxes must navigate through various challenging paths filled with moving elastics and tricky obstacles. As Boxes collects more eggs, new areas of Bunnyville open up, each with tougher challenges. The ultimate goal is to find the rare Rainbow Egg, hidden in the most difficult part of Bunnyville.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/hbz4nougtuei8y7f4lgcke2r3itnge5t/",
    "category": "Hypercasual",
    "tags": "egg, eggames, eggs, Family, HTML5, jump, Jumping, mapi games, Mobile",
    "thumb": "https://img.gamemonetize.com/hbz4nougtuei8y7f4lgcke2r3itnge5t/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31905",
    "title": "Elemental Gloves Magic Power",
    "description": "Elemental Gloves - Magic Power is a superpower arcade game. Experience the fun of superpowers in magic games? Fascinated by elemental games? In this game, you can use the superpowers in the magic gloves to fight with your enemies. Shooting with flames, attacking with lightning, and attacking with electromagnetic waves, are three ways for you to choose. Dont hesitate to take the opportunity to practice real elemental magic and wipe out the bad guys. Become the greatest elemental master!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/y95ivh95bn3pnk7gaory8rz47ymeo9gp/",
    "category": "Boys",
    "tags": "Magic",
    "thumb": "https://img.gamemonetize.com/y95ivh95bn3pnk7gaory8rz47ymeo9gp/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31904",
    "title": "Street Legends",
    "description": "Race through the bustling city streets as a daring bike rider in Street Legends: Urban Bike Rider! Your goal is to weave through traffic, dodge vehicles, and overcome challenging obstacles to achieve the highest score possible. With fast-paced gameplay and responsive controls, youll need quick reflexes to avoid collisions. Can you master the art of urban biking and become a true street legend?",
    "instructions": "Tap on the right side or press the right arrow key to steer right Tap on the left side or press the left arrow key to steer left ",
    "url": "https://html5.gamemonetize.com/fxrupz621ovggap9mxyixwxsqlu193xv/",
    "category": "Hypercasual",
    "tags": "1 Player, Adventure, amazing, Best, Best Games, Bike, free games for your site, free games for your website, free html5 games for your website, games for your website, html games for your website, html5 games for your site, Hypercasual, Racing",
    "thumb": "https://img.gamemonetize.com/fxrupz621ovggap9mxyixwxsqlu193xv/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31903",
    "title": "Bounce Ball Timer",
    "description": "Bounce Ball Timer is very fun and challenging. In the game, the player collect the three stars and avoid the obstacles to advance to the next level.",
    "instructions": "Touch or keyboard",
    "url": "https://html5.gamemonetize.com/trx1jai8sfawu7z2g245qb0vqiqnktra/",
    "category": "Arcade",
    "tags": ".io, .io Games, 2D",
    "thumb": "https://img.gamemonetize.com/trx1jai8sfawu7z2g245qb0vqiqnktra/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31902",
    "title": "Fashion Battle Dress",
    "description": "Beautiful clothes are not enough to win this battle. Each outfit is suitable only for that section of the track if it matches the color of the outfit.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/sg4ok6641eb2lb0xhm6ckm5ub91t61nl/",
    "category": "Arcade",
    "tags": "3D, Arcade, Casual, Fun, Girl, HTML5",
    "thumb": "https://img.gamemonetize.com/sg4ok6641eb2lb0xhm6ckm5ub91t61nl/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31901",
    "title": "Escape The Wall",
    "description": "Welcome to Escape The Wall, an exhilarating and fast-paced arcade game where you must help your characters swing from one platform to another, avoiding the deadly walls below. With its simple yet challenging mechanics, this game will keep you hooked for hours. Features: Fast-Paced Gameplay: Quick reflexes are essential as you swing from one platform to another. The game speeds up as you progress, adding to the excitement. Simple Controls: Easy-to-learn controls make the game accessible to players of all ages. Just tap to make your characters swing to the next platform.",
    "instructions": "How to Play Tap to Swing Tap the screen to make your characters swing from one platform to the next Timing is crucial to avoid falling Avoid the Walls Ensure your characters do not hit the walls below One wrong move can end the game Score Points T",
    "url": "https://html5.gamemonetize.com/7jjhgr7klqcvfvnm4p47ynfon0l9qzyg/",
    "category": "Puzzles",
    "tags": "1 Player, 2D, Adventure, Air, Animal, Baby Games, Best Games, Bridge, html5 games",
    "thumb": "https://img.gamemonetize.com/7jjhgr7klqcvfvnm4p47ynfon0l9qzyg/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31900",
    "title": "Vampire Girl Dress Up",
    "description": "Vampire Girl Dress Up is a makeover game designed for girls. In this game, you will follow the vampire princess on a transformation journey. The little vampire princess, Lucy, will shoot a magazine cover with her prince.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/bphagokeqt6106ogf04jr97uqrp9t1bm/",
    "category": "Hypercasual",
    "tags": "Dress Up, Makeover",
    "thumb": "https://img.gamemonetize.com/bphagokeqt6106ogf04jr97uqrp9t1bm/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31899",
    "title": "Ocean Memory Challenge",
    "description": "Dive into the depths of fun with Ocean Memory Challenge! This captivating memory game takes you on an underwater journey where you&amp;rsquo;ll test and train your memory skills. Flip over beautifully designed marine-themed cards to find matching pairs of sea creatures, corals, and treasures. Can you remember where all the treasures are hidden? Start your Ocean Memory Challenge today and find out!",
    "instructions": "Tap in the cards to flip them and find out their pairs",
    "url": "https://html5.gamemonetize.com/cniyp0sjzfhu2ugsngkxo39bgdrs5nlo/",
    "category": "Puzzles",
    "tags": "Fish, Memory, Puzzle",
    "thumb": "https://img.gamemonetize.com/cniyp0sjzfhu2ugsngkxo39bgdrs5nlo/512x384.jpg",
    "width": "1280",
    "height": "600"
  },
  {
    "id": "31898",
    "title": "The Crazy Dentist wojak game",
    "description": "Join Dr. Wojak, the friendly and knowledgeable dentist, in an exciting 2D adventure crafted especially for kids! In Dental Adventure with Dr. Wojak, young players will dive into a colorful world where learning about dental hygiene is both fun and engaging. Features: Engaging Gameplay: Assist Dr. Wojak in various mini-games that involve cleaning, brushing, and caring for patients teeth. Educational Content: Discover the importance of brushing, flossing, and regular dental check-ups through interactive lessons. Colorful Graphics: Delight in vibrant and whimsical graphics that make dental care an enjoyable experience. Customizable Characters:",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/y8iedym7u25m04ns5xdabpzxnp1pyr7h/",
    "category": "Cooking",
    "tags": ".io Games, 2 Player Games, Adventure, Arcade, Baby Hazel, Bejeweled, Craft, Hidden",
    "thumb": "https://img.gamemonetize.com/y8iedym7u25m04ns5xdabpzxnp1pyr7h/512x384.jpg",
    "width": "1270",
    "height": "650"
  },
  {
    "id": "31897",
    "title": "Troll Stick Face Escape",
    "description": "The Troll Stick brothers need to collect all the money and become very rich. Help the Troll Stick brothers and make sure they collect all the money. You need to gather all the gold and reach the portal. They must survive in an extreme course full of obstacles and challenges. They need to collect the coins and reach the portal before time runs out. Both Troll Stick brothers need to reach the portal. Ensure they get to the portal safely.",
    "instructions": " Move to WASD Arrow Keys Double Jump available Mobile Touch Control",
    "url": "https://html5.gamemonetize.com/iecnnc16bzgecvs074g1h7jdw3u1vsup/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Best, Mobile, Stickman",
    "thumb": "https://img.gamemonetize.com/iecnnc16bzgecvs074g1h7jdw3u1vsup/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31896",
    "title": "Potrick Garage Storage",
    "description": "Enter the chilling world of Potrick Snaps Meatly Storage, a horror game that plunges you into dark, eerie rooms brimming with jump scares and supernatural surprises. Can you survive the night and unveil the secrets of Potricks house? In this gripping mobile puzzle game, step into the shoes of a mechanic navigating a cluttered garage. Your mission: find hidden machines and unlock them with the correct 4-digit code. Use your wits to solve intricate puzzles, revealing new parts and tools to upgrade your gear, making future tasks easier. Whether you&amp;rsquo;re a seasoned puzzle master or a novice, Meatlys Storage World offers challenges for everyone.",
    "instructions": "F flashlight on and off E to interact with objects and machines W A S D to navigate ",
    "url": "https://html5.gamemonetize.com/9oo46a87nxtr397y5hww6vjaxu2dpqza/",
    "category": "Adventure",
    "tags": "3D, Action, Adventure, Escape, Horror",
    "thumb": "https://img.gamemonetize.com/9oo46a87nxtr397y5hww6vjaxu2dpqza/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31895",
    "title": "Epic Hero Quest: Idle RPG",
    "description": "Conquer enemies, level up heroes, unlock skills in Epic Hero Quest: Idle RPG! - Battle Through Hordes of Enemies - Earn Gold and Level Up - Unlock and Upgrade Skills Are you ready to embark on the ultimate adventure? Join the quest and become the legendary hero you were destined to be in Epic Hero Quest: Idle RPG!",
    "instructions": "mouse",
    "url": "https://html5.gamemonetize.com/w30mtmy14r6rn190pw512ou5o38rc0zv/",
    "category": "Adventure",
    "tags": "1 Player, Clicker, endless, Flight, RPG, Strategy, Superhero",
    "thumb": "https://img.gamemonetize.com/w30mtmy14r6rn190pw512ou5o38rc0zv/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "31894",
    "title": "game coloring kids",
    "description": "a game for children they can paint animals objects have fun painting childrens drawings of balloons tigers whale koala llama and take photos of your drawings",
    "instructions": "mouse keyboard arrows",
    "url": "https://html5.gamemonetize.com/8np27rvc8ebt1l57srrjnwyyoy4cbfoz/",
    "category": "Arcade",
    "tags": "Arcade, Coloring, Fun, Kids",
    "thumb": "https://img.gamemonetize.com/8np27rvc8ebt1l57srrjnwyyoy4cbfoz/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31893",
    "title": "Digit Shooter 1",
    "description": "Digit Shooter! plays like a vertical-version shooting running arcade game. With 3D green numbers, you can launch green numbers to shoot green numbers and numbered walls. You can shoot them and collect them to make your number bigger. Dont waste bullets and time on red walls while avoiding them. When you reach the finish line, try to focus on one line to shoot, then you will collect more rewards",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/9c323gqdrw31aduhihjg59lerxnrmjl6/",
    "category": "Shooting",
    "tags": "Shooting",
    "thumb": "https://img.gamemonetize.com/9c323gqdrw31aduhihjg59lerxnrmjl6/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31892",
    "title": "Kids Home Cleanup",
    "description": "Kids home cleanup is an educational game. In this game, you can experience cleaning the rooms in Hippos house. Not only can you learn basic housework knowledge, but you can also get satisfaction from the clean results. We have also prepared professional tools for you. Have a good time!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/6hnta1kh22srge0ldhxsffmplww5zgxc/",
    "category": "Hypercasual",
    "tags": "Cleaning, Educational",
    "thumb": "https://img.gamemonetize.com/6hnta1kh22srge0ldhxsffmplww5zgxc/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31891",
    "title": "Merge Cooking Game",
    "description": "In this cook and merge simulator game, you will start with simple ingredients and recipes, such as bread, cheese and tomato. Merge them to create new dishes, such as pizza, sandwich and burger. Then merge those dishes to create even more tasty and exotic cuisines, such as sushi, pasta and curry. The more you merge, the more you unlock! With hundreds of different food combinations, ranging from street food staples to high-end delicacies, you can experiment with flavors and create your own unique recipes. As you progress through the game, youll unlock new restaurant themes and exciting challenges.",
    "instructions": "you can merge combine and evolve delicious dishes and ingredients and serve to customers ",
    "url": "https://html5.gamemonetize.com/3i6pble3gza5vq1z1w2bq473qya3m5y6/",
    "category": "Puzzles",
    "tags": "Food, Logic, Management, Restaurant, RPG, Simulation",
    "thumb": "https://img.gamemonetize.com/3i6pble3gza5vq1z1w2bq473qya3m5y6/512x384.jpg",
    "width": "1136",
    "height": "640"
  },
  {
    "id": "31890",
    "title": "Candy World Saga",
    "description": "Explore the candy world with a candy matching challenge. Game story begins with Mark and Julie. Once their grandfather challenged them with a candy puzzle and told them to give many candies after completing the game. So let&amp;rsquo;s help those children to get the candies and match the candy tiles as fast as possible. Make sure to give your move correctly, either game will be over. If you like genres such as tile matching games, puzzle games, quests or just want to have a good time then this game is for you. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests.",
    "instructions": "How to play Android Use On-Screen touch and swipe PC Use Mouse Left Click and swipe ",
    "url": "https://html5.gamemonetize.com/lkjdtk8zhks6irz0k0uzl7faiz1s2pps/",
    "category": "Puzzles",
    "tags": "2D, Casual, Match-3, Matching, Puzzle",
    "thumb": "https://img.gamemonetize.com/lkjdtk8zhks6irz0k0uzl7faiz1s2pps/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31889",
    "title": "Goal Dot 3D",
    "description": "Welcome to Goal Dot 3D Soccer Game! Aim and release to shoot the ball into the grid to fill the hole with 2 or more Green Dots horizontally or vertically. You play against another player and must complete the mission before your opponent to win and unlock the next level. Can you do it?",
    "instructions": "Tap or mouse click to play ",
    "url": "https://html5.gamemonetize.com/ofunjjov725sve0gi4rdvdwfism6a8ul/",
    "category": "Sports",
    "tags": "3D Games, Hypercasual, Soccer, unity games for your website, Unity3D",
    "thumb": "https://img.gamemonetize.com/ofunjjov725sve0gi4rdvdwfism6a8ul/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31888",
    "title": "Ultimate Goal",
    "description": "Ultimate Goal is an exciting and engaging table football game that brings the fun and thrill of foosball right to your fingertips. Navigate your team through various challenging levels, strategize your moves, and score goals to become the ultimate champion. With vibrant graphics, intuitive controls, and endless gameplay possibilities, Ultimate Goal is perfect for players of all ages.",
    "instructions": "Start the Game Tap the play button to begin Control Your Team Use the on-screen controls to move your players up and down Score Goals Strategize your moves to score goals against your opponent Progress Through Levels Complete levels by scoring the ",
    "url": "https://html5.gamemonetize.com/zic3isd7x8bpydstdu7r0m6selizpe45/",
    "category": "Sports",
    "tags": "1 Player, 2 Player, 2 Player Games, 2048, 3D Games, Adult, Android, battleship, Best Games, Classic",
    "thumb": "https://img.gamemonetize.com/zic3isd7x8bpydstdu7r0m6selizpe45/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31887",
    "title": "Noob Race Against Time",
    "description": "In this adventure, you need to collect all the gold and obtain the key to the chest. You must be very careful to survive in this dangerous forest. You need to gather all the gold scattered throughout the forest. Collect all the gold and obtain the golden key. After you get the key, you must reach the chest. Reach the chest and open it. You must hurry to open the chest. The only way to escape the forest is to reach the chest and open it.",
    "instructions": " You can move by pressing the WASD keys Pay attention to obstacles and collect all the gold Collect all the gold and obtain the key ",
    "url": "https://html5.gamemonetize.com/8zsbtqci63mrf8i63sftn04imh6mfimf/",
    "category": "Arcade",
    "tags": "1 Player, Adventure, Arcade, mineblock, Minecraft, Pixel",
    "thumb": "https://img.gamemonetize.com/8zsbtqci63mrf8i63sftn04imh6mfimf/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31886",
    "title": "Geo Drop",
    "description": "Geo Drop is an exciting 2D arcade game where precision and quick reflexes are your keys to victory. Dive into a world of geometric challenges as you strategically launch white balls from the top of the screen to hit and destroy yellow geometric shapes before they reach the top. With a sleek black background and striking red walls, the vibrant colors make every level visually engaging. Master the art of the perfect shot and watch as shapes shatter before you. Can you handle the increasing speed and complexity? Test your skills and aim for the highest score in Geo Drop!",
    "instructions": "Touch and release to launch the balls and break the shapes",
    "url": "https://html5.gamemonetize.com/8pdxfq6k9biqna6pqezv5b64std8b3zo/",
    "category": "Hypercasual",
    "tags": "Arkanoid, Ball, Bounce, Bricks, throwing",
    "thumb": "https://img.gamemonetize.com/8pdxfq6k9biqna6pqezv5b64std8b3zo/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31885",
    "title": "Ragdoll in backrooms",
    "description": "Let your imagination loose with the wide variety of items at your disposal: rangdoll weapons, guns and even bombs! A simple sandbox playground game, where you create your own scenarios.",
    "instructions": "Mouse Touch",
    "url": "https://html5.gamemonetize.com/vr808mp55a4twt00qur63o7acxjggml8/",
    "category": "Hypercasual",
    "tags": "angrybirds, Arcade, atv, Battlegrounds, Casual, huggy, Hypercasual, Sandbox, Spiderman",
    "thumb": "https://img.gamemonetize.com/vr808mp55a4twt00qur63o7acxjggml8/512x384.jpg",
    "width": "600",
    "height": "350"
  },
  {
    "id": "31884",
    "title": "Happy Mushroom",
    "description": "This is a lovely little mushroom elimination game, by clicking to eliminate the connected mushrooms, simple operation, each time the more mushrooms the higher the score, happy mushrooms waiting for you",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/f3n30l5tpch3lmw4xhpyr2moioo2aevv/",
    "category": "Puzzles",
    "tags": "1 Player, Casual",
    "thumb": "https://img.gamemonetize.com/f3n30l5tpch3lmw4xhpyr2moioo2aevv/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31883",
    "title": "Baby Panda Summer Vacation",
    "description": "Baby Panda Summer Vacation is an interesting educational game. Summer is a season that people love and hate. In summer, you can wear thin clothes without worrying about the cold. But the temperature in summer is very high and the sun is particularly glaring.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/rk43nk0upyfu9g0x6tek495bvdv1q797/",
    "category": "Hypercasual",
    "tags": "Educational",
    "thumb": "https://img.gamemonetize.com/rk43nk0upyfu9g0x6tek495bvdv1q797/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31882",
    "title": "Football Penalty",
    "description": "Step into an exhilarating, never-ending penalty challenge! Show your opponents the power of your accurate shots and become a real football hero. Collect points for every target hit, progress through levels, and improve your football skills. Take part in a big tournament and get more rewards.",
    "instructions": "The game features unlimited penalty duels Your goal is to shoot the ball at targets while avoiding obstacles like cones and boxes Be quick and precise to earn more points and win trophies which you can use to unlock new balls Theres also a big penalty",
    "url": "https://html5.gamemonetize.com/ikpi1ghjcghyj8jk95k5wif87fz7hfs2/",
    "category": "Sports",
    "tags": "Ball, Football, Soccer",
    "thumb": "https://img.gamemonetize.com/ikpi1ghjcghyj8jk95k5wif87fz7hfs2/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "31881",
    "title": "Festival Vibes Makeup",
    "description": "Join Ellie in Festival Vibes Makeup, a vibrant game radiating the spirit of the summer festivals. Delight in creating neon, boho-Aztec, and grunge makeup looks as you test your makeup artist skills in this colorful makeup game for girls. Mix, match, and shine with stunning eyeshadows, mascaras, lipsticks, and glitter eyebrows!",
    "instructions": "Use your mouse to play this game ",
    "url": "https://html5.gamemonetize.com/pnudqbp7gclkfw46aodhr1ch875gb66c/",
    "category": "Girls",
    "tags": "1 Player, Fashion, Makeover, Summer",
    "thumb": "https://img.gamemonetize.com/pnudqbp7gclkfw46aodhr1ch875gb66c/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31880",
    "title": "GTA Car Rush",
    "description": "Rev up your engines and dive into the thrilling world of GTA Car Rush, a super fun and free-to-play car chase online game perfect for kids! In this exhilarating adventure, your mission is to collect all the money scattered across each level while dodging obstacles and outrunning pursuers. Each collected coin brings you closer to unlocking new and exciting challenges.",
    "instructions": "WASD or Arrow keys to drive SpaceBar or K to shoot ",
    "url": "https://html5.gamemonetize.com/372nv4l7g2l1vexifnwld5z4rftwcz82/",
    "category": "Shooting",
    "tags": "Arcade, Avoid, Boy, Cars, Collecting, Driving, gta, Hypercasual, Racing, Skill",
    "thumb": "https://img.gamemonetize.com/372nv4l7g2l1vexifnwld5z4rftwcz82/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "31879",
    "title": "Melon Maker",
    "description": "Melon Maker combines classic 2048 gameplay with vibrant fruits and dazzling acrobatics for a flavorful mobile puzzle experience! Last but not least, the adorable capybara will help you drop the fruits!",
    "instructions": "Tap to Drop Just tap the screen to choose where the Capybara will drop the juicy fruit Merge Frenzy Merge two identical fruits to create a new bigger one Combo Craze Chain merges to get blasting points and tropical treats ",
    "url": "https://html5.gamemonetize.com/e7fv1tobkpavr281wt7cf0jgn2qkn96f/",
    "category": "Clicker",
    "tags": "1 Player, 2048, amazing, Best Games, Brain",
    "thumb": "https://img.gamemonetize.com/e7fv1tobkpavr281wt7cf0jgn2qkn96f/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31878",
    "title": "Goal Arena 3D",
    "description": "Welcome to Goal Arena 3D Online Soccer Game! Swipe left and right to control your goalkeeper and prevent the ball from passing through the goalpost. You have 3 chances, so score goals against the 3 other opponents and guard your post very well to win.",
    "instructions": "Tap or mouse click to play ",
    "url": "https://html5.gamemonetize.com/n6rox98hlgh30vr4xqr2tjqkrstmdgrf/",
    "category": "Soccer",
    "tags": "3D, 3D Games, Football, Hypercasual, Soccer, Sport, Sports, Unity3D",
    "thumb": "https://img.gamemonetize.com/n6rox98hlgh30vr4xqr2tjqkrstmdgrf/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "31877",
    "title": "Sigil Seeker",
    "description": "Welcome to Sigil Seeker!\\\\\\\\nEmbark on a quest to collect mystical sigils by tapping tiles on the screen. Add tiles to your row, aiming to gather three identical sigils to collect them. Your goal is to gather all the sigils before time runs out. But beware, if your row overflows or the clock reaches zero, the game is over.\\\\\\\\nAre you ready to become the ultimate Sigil Seeker? Dive in and start your adventure now!",
    "instructions": "Use a mouse or touchpad to play this game ",
    "url": "https://html5.gamemonetize.com/q2er0px6o5woykc0abyludnhos5265ig/",
    "category": "Puzzles",
    "tags": "Clicker, html5 games, Mahjong, Matching, Mobile",
    "thumb": "https://img.gamemonetize.com/q2er0px6o5woykc0abyludnhos5265ig/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "31876",
    "title": "Connect The Satellite",
    "description": "Connect The Satellite is an engaging puzzle game set in the vastness of space. Players must strategically link satellites with astronauts to create a network, ensuring all connections are perfectly aligned. With mesmerizing graphics and increasingly challenging levels, this game promises hours of captivating gameplay. Perfect for puzzle enthusiasts and space explorers alike!",
    "instructions": "How to Play Objective Connect all the satellites with the astronauts to complete the network Controls Tap and drag to draw connections between satellites and astronauts Rules All satellites must be connected to at least one astronaut Connections mu",
    "url": "https://html5.gamemonetize.com/io92bxgu3w6hyc55ljusb4mnq6hkg67l/",
    "category": "Puzzles",
    "tags": "1 Player, 2048, 2D, 3D Games, Action, Air, Baby Games, Battlegrounds, Best Games, city, Crazy",
    "thumb": "https://img.gamemonetize.com/io92bxgu3w6hyc55ljusb4mnq6hkg67l/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31875",
    "title": "Summer Connect",
    "description": "You can test your pattern detection skills in this relaxed mahjong &amp;amp; connect puzzle game with summer theme. You can eliminate pair of same tiles. The line connecting the two clicked tiles cant have more than 2 corners. Some levels the tiles can auto slide( to left, to right, to up, to bottom). Can you clear the board before time runs out? Enjoying matching summer tiles with 30 puzzle stages in this game.",
    "instructions": "Use mouse to play this connect game ",
    "url": "https://html5.gamemonetize.com/iz3q3sl8jz3zpmrfo3kvkizfii2kmtdl/",
    "category": "Puzzles",
    "tags": "HTML5, Mahjong, Mobile, Summer",
    "thumb": "https://img.gamemonetize.com/iz3q3sl8jz3zpmrfo3kvkizfii2kmtdl/512x384.jpg",
    "width": "1280",
    "height": "768"
  },
  {
    "id": "31874",
    "title": "Skibronx Runner",
    "description": "Welcome to Skibronx Runner! Here you make your way through the streets in this endless runner game while you encounter various challenges. In the level mode its your goal to reach the grocery store without losing. In the endless mode your goal is to reach as far as possible without losing.",
    "instructions": "Up Arrow Key jump 2x Up Arrow Key double jump Holding Up Arrow Key after double jump fly Arrow down Sliding E shoot watergun or bumping",
    "url": "https://html5.gamemonetize.com/m3jdpqmzjs20ibx1nhos8m182x8yqsj3/",
    "category": "Boys",
    "tags": "1 Player, 2D, Action, Adventure, amazing, Arcade, Avoid, Best, Boys, Classic, Enemies, Jumping, running",
    "thumb": "https://img.gamemonetize.com/m3jdpqmzjs20ibx1nhos8m182x8yqsj3/512x384.jpg",
    "width": "1031",
    "height": "580"
  },
  {
    "id": "31873",
    "title": "Stickman vs Zombies Minecraft",
    "description": "Stickman vs Zombies Minecraft is an action-adventure platform game in which you can play as a brave stick ninja. When you play as a stickman hero, eliminate all the craft zombies and collect coins with each eliminated sombie so you can unlock new skins. Move around the map and look for all the zombies before they find you and run to catch you or shoot at your position. Dont leave even one alive, dont stop moving or all the zombie craft will try to catch you.",
    "instructions": "Instructions Search and eliminate all the craft zombies in each level to emerge alive and move on to another level WASD to move and jumpSpacebar and Click mouse to attackE ShieldUse the game buttons for touch devices ",
    "url": "https://html5.gamemonetize.com/bztju5apx957kapkxnzocq3au3f8kq3y/",
    "category": "Fighting",
    "tags": "Fighting, kiz10, Minecraft, Zombie",
    "thumb": "https://img.gamemonetize.com/bztju5apx957kapkxnzocq3au3f8kq3y/512x384.jpg",
    "width": "900",
    "height": "600"
  },
  {
    "id": "31872",
    "title": "Magic Princess Dress Up",
    "description": "Do you want to dress up as a secondary magic princess? Magic Princess makes your dream come true.Its a stylish ultra-casual simulation game with a strong secondary Barbie style for all unique girls. The game has three modes. You can match your own makeup and outfits, and you can PK with other players, scoring high means you have better taste. You may also match outfits according to the theme. It is important to note that if you choose the wrong one, the game will fail.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/ylol4y8fzxx65fgr367fwuk9qbkou058/",
    "category": "Hypercasual",
    "tags": "Princess, Simulation",
    "thumb": "https://img.gamemonetize.com/ylol4y8fzxx65fgr367fwuk9qbkou058/512x384.jpg",
    "width": "750",
    "height": "1680"
  },
  {
    "id": "31871",
    "title": "Baby Taylor Life Diary ",
    "description": "Baby Taylor Life Diary is a cleaning and pet care game for girls. Taylors mum is going out and she has given Taylor the task of cleaning her room. You need to help Taylor along with it. There are 4 tasks, which are bathing your pet, sorting out the scattered toys, cleaning the dusty bookshelf, and making a nice-looking harpsichord. During the game, you can not only enjoy the game but also learn how to do housework and take care of your pet. Can you make sure that you do all the tasks before your mum comes home? Join the game now and try it out.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/qbkxehbhjd2ktnkzzigazxdhhg9v3jdx/",
    "category": "Hypercasual",
    "tags": "Cat, Cleaning",
    "thumb": "https://img.gamemonetize.com/qbkxehbhjd2ktnkzzigazxdhhg9v3jdx/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31870",
    "title": "World S Hardest Game Hate Cube",
    "description": "Worlds Hardest Game: Hate Cube is a difficult arcade game. It is also a deep challenge to the players skills and psychological endurance. You will face different challenges and feel the tension. Unlock each special level and overcome countless obstacles. Only the true master can stand on the peak of victory! Challenge the limit and surpass yourself! The most difficult game in the world is waiting for you to fight!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/7wiqs25lalcwv91g77f2fasx2bk1od7l/",
    "category": "Puzzles",
    "tags": "Arcade, Puzzle",
    "thumb": "https://img.gamemonetize.com/7wiqs25lalcwv91g77f2fasx2bk1od7l/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31869",
    "title": "Little Panda S Chinese Recipes 2",
    "description": "Chinese culture has a long history, and its food culture is also worth appreciating. In this game, you will experience making delicious Chinese food such as Yuanxiao, noodles, and candied haws.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/bafq8i2iqi7qjy77jwcjjbi328tjp909/",
    "category": "Girls",
    "tags": "Cooking, Educational",
    "thumb": "https://img.gamemonetize.com/bafq8i2iqi7qjy77jwcjjbi328tjp909/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31868",
    "title": "Games for Pets",
    "description": "Welcome to Games for Pets, the ultimate interactive game designed specifically for your beloved cats and dogs! Keep your furry friends entertained and active as they chase and pounce on moving objects on the screen. Features: Engaging Gameplay: Tap the screen to make various objects move around, enticing your pets to pounce and play. Variety of Objects: From bouncing balls to fluttering butterflies, keep your pets intrigued with a range of different objects. Colorful Graphics: Bright and colorful visuals ensure that the game captures your pet&amp;rsquo;s attention. Interactive Sounds: Enjoy playful sounds that accompany each movement, adding an extra",
    "instructions": "Mouse Touch Click ",
    "url": "https://html5.gamemonetize.com/w33feb2bpt1n55ecbmjv2rddn6cnkc64/",
    "category": "Hypercasual",
    "tags": "2 Player Games, Adventure, Cat, Family, Hello Kitty, Kids",
    "thumb": "https://img.gamemonetize.com/w33feb2bpt1n55ecbmjv2rddn6cnkc64/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "31867",
    "title": "Colored Rings",
    "description": "Play Colored Rings game online and for free. In it we invite you to solve a puzzle that will be related to rings. In front of you on the screen you will see a playing field on which there will be rings of different colors. They will be linked to each other. You will need to inspect everything very carefully. Using the mouse, you can rotate these rings in space. By doing this, in the game Colored Rings you will unhook the rings from each other and receive points for this. As soon as you completely clear the field of rings, you will move on to the next level of the game.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/jcv3w9zw74yyhxbydp1f0bs5rpmjjk1r/",
    "category": "Puzzles",
    "tags": "1 Player, 2D, Best, Brain, Casual, Fun, Kids, Logic, Skill",
    "thumb": "https://img.gamemonetize.com/jcv3w9zw74yyhxbydp1f0bs5rpmjjk1r/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31866",
    "title": "Black Holes",
    "description": "In this fast-paced, action-packed game, you control a stone that is being pulled towards a fast-moving galaxy object in a space setting. The goal of the game is to make the stone collide with the galaxy object as soon as possible. The further you get before colliding, the higher your score. The game gets faster and more challenging as you progress, so youll need to be quick and nimble to keep up. Features: Fast-paced action: The game is fast-paced and challenging, requiring quick reflexes and good hand-eye coordination. Endless replayability: Play again and again!",
    "instructions": "Move the wall piece using mouse hand and meet the moving block ",
    "url": "https://html5.gamemonetize.com/ynsi4upnufn5d67xf0ttv5nqqx0mkva7/",
    "category": "Hypercasual",
    "tags": "blocky, Casual, Educational, Science",
    "thumb": "https://img.gamemonetize.com/ynsi4upnufn5d67xf0ttv5nqqx0mkva7/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "31865",
    "title": "Cute Monkey Mart ",
    "description": "an exciting mobile game that takes you on a whimsical journey into a world Monkey Mart is an exciting and captivating mobile game that takes you on a whimsical journey into a world where monkeys run their very own supermarket. Prepare to be immersed in a vibrant and bustling environment where these adorable primates cultivate and sell a wide array of items to their fellow animal customers.",
    "instructions": "As a player you step into the role of a diligent monkey entrepreneur responsible for managing and expanding Monkey Mart Your primary objective is to help the monkeys grow their business ensuring that the supermarket thrives and becomes the go-to desti",
    "url": "https://html5.gamemonetize.com/labp0rn30i2bbbaj0bmd163u9lty6ung/",
    "category": "Hypercasual",
    "tags": "1 Player, 2D, amazing, Animal, Best Games",
    "thumb": "https://img.gamemonetize.com/labp0rn30i2bbbaj0bmd163u9lty6ung/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31864",
    "title": "Truck Heavy Transporter",
    "description": "Get ready for the ultimate driving experience with Truck Heavy Transporter! Navigate challenging terrains, master precise handling, and deliver oversized cargo across diverse landscapes. From rugged mountains to bustling cities, your mission is to transport heavy loads safely and efficiently. With realistic physics, dynamic weather, and various trucks to choose from, every journey is an adventure. Prove your driving skills and become the top transporter in this thrilling, immersive game!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/sant2y505yenydyr0jplapai6ug8ju0q/",
    "category": "Arcade",
    "tags": "Arcade, Driving, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/sant2y505yenydyr0jplapai6ug8ju0q/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31863",
    "title": "Solitaire Match Puzzle",
    "description": "Hot pot, barbecue, custard tarts, pasta whatever you love is here. Solitaire Match Puzzle is a food-themed puzzle game. The game contains food and desserts from all over the world, every time the game starts there will be a lot of food cards, and these cards overlap each other.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/eich7vpcet72i1u1gzsoxs9u88fir3na/",
    "category": "Puzzles",
    "tags": "Card, Puzzle",
    "thumb": "https://img.gamemonetize.com/eich7vpcet72i1u1gzsoxs9u88fir3na/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31862",
    "title": "Girl Bike Fix Washing Salon",
    "description": "Girl Bike Fix Washing Salon is a cleaning game. In this game, you can not only clean the bike but also fix it. We provide you with two colors of bikes, purple and pink, which are very suitable for girls. You can choose one you like best to start cleaning and repairing.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/g3nt31ov6meqkq2vikfc4fgzu77zonxt/",
    "category": "Hypercasual",
    "tags": "Cleaning",
    "thumb": "https://img.gamemonetize.com/g3nt31ov6meqkq2vikfc4fgzu77zonxt/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31861",
    "title": "World War III",
    "description": "There are 50 robots in this game and you win by killing the robots in the game, but since there are robots in it, do you know why it is called World War III? The reason it is called World War III is because World War III is planned to be between humans and robots, in fact the background of the game is on Mars, we could have named it Mars War I. How funny would that be. :)",
    "instructions": "In the game you try to kill 50 robots using your mouse and keyboard remember this is your mission FOR KEYBOARD Movement W A S D and arrow keys Shoot Left Mouse Button Aim Right Mouse Button Jump Space Key Speed Shift Keys You can also play",
    "url": "https://html5.gamemonetize.com/vii6uglju9bj85lyidxtqtu7gm4ok0bq/",
    "category": "Adventure",
    "tags": "3D, 3D Games, Action, Adventure, destroying, War, weapons",
    "thumb": "https://img.gamemonetize.com/vii6uglju9bj85lyidxtqtu7gm4ok0bq/512x384.jpg",
    "width": "3840",
    "height": "2160"
  },
  {
    "id": "31860",
    "title": "Simple Word Search",
    "description": "A fun simple crossword puzzle game. Engage in an entertaining and straightforward crossword puzzle game! Challenge your vocabulary skills by discovering hidden words. Can you find them all to win?",
    "instructions": "Mouse click or tap to play Click tap the letters to select them in a group Find the matching words in the crossword puzzle as the ones listed at the top to win ",
    "url": "https://html5.gamemonetize.com/rz2wh4eyph6olj3yhu8onr9zu9ntkky9/",
    "category": "Puzzles",
    "tags": "Hypercasual, Puzzle, Word",
    "thumb": "https://img.gamemonetize.com/rz2wh4eyph6olj3yhu8onr9zu9ntkky9/512x384.jpg",
    "width": "412",
    "height": "915"
  },
  {
    "id": "31859",
    "title": "The Good Dinosaur Cooking Adventure",
    "description": "Embark on The Good Dinosaur Cooking Adventure with Milo and Spike as they create a special corn dish for Papa! Explore levels like finding ingredients, cutting, crafting fire, cooking, and serving in this culinary journey amidst bountiful cornfields.",
    "instructions": "Follow Milo and Spikes journey Click to find cut craft cook and serve Impress Papa with your culinary skills ",
    "url": "https://html5.gamemonetize.com/kxlczk0sjqx4xk5g68x8tw07xrci2uvl/",
    "category": "Girls",
    "tags": "Cooking, Dinosaur",
    "thumb": "https://img.gamemonetize.com/kxlczk0sjqx4xk5g68x8tw07xrci2uvl/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31858",
    "title": "QuackTut",
    "description": "Hello everyone &amp;lt;3 I am pleased to try my first game. I did my best to make my first game enjoyable for you. I hope you do that. I want you to create a simple video explaining how to achieve this. If you like my game and want to support me, I will be very grateful to you, and I promise that soon, I will make more than one other game and continuously develop this game by trying to create new and exciting ideas. Garden by Sakura Girl | Music promoted by Creative Commons CC BY 3.0",
    "instructions": " I made a gift for every player who reached 10 000 points how to play Pharaoh Duck press 3 times on the enemy to defeat it you will get 5 points press on the pharaoh duck to make a point every press 1 point if you cant help out the cute duck and the",
    "url": "https://html5.gamemonetize.com/arzvexkivcrxvfik47x1nq3mmhoysqvv/",
    "category": "Clicker",
    "tags": "1 Player, 2D, Animal, Anime, Cartoon, Cute, Kids, Love, Music",
    "thumb": "https://img.gamemonetize.com/arzvexkivcrxvfik47x1nq3mmhoysqvv/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31857",
    "title": "Boxes Chaser",
    "description": "Hey help the little color Boxes to escape from the Chaser! Avoid all obstacles and try to resit the more you can! Complete all 20 space Levels and go back to the earth!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/71gv5nc8syk7ax4b9ubbdk5pvm7nawog/",
    "category": "Clicker",
    "tags": "Arcade, HTML5, jump, Jumping, mapi games, Mobile, running",
    "thumb": "https://img.gamemonetize.com/71gv5nc8syk7ax4b9ubbdk5pvm7nawog/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31856",
    "title": "Frog Jumper",
    "description": "Dive into the enchanting world of Frog Jumper, where you guide a lively frog through a series of thrilling jumps and platforms. Test your reflexes and timing as you navigate through challenging obstacles to achieve the highest score. Perfect for players of all ages, Frog Jumper offers endless fun and excitement!",
    "instructions": "How to Play Tap the screen to make the frog jump Time your jumps to land on platforms and avoid falling Collect coins and power-ups to boost your score Avoid obstacles and try to jump as far as possible The game ends when the frog falls off the platf",
    "url": "https://html5.gamemonetize.com/dv2j3ijd4mbxk1fbkatnp46q725m5l26/",
    "category": "Arcade",
    "tags": "1 Player, 2048, 2D, Adventure, amazing, Arcade, Baby Games, Brain, Crazy",
    "thumb": "https://img.gamemonetize.com/dv2j3ijd4mbxk1fbkatnp46q725m5l26/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31855",
    "title": "Animal Farm Merge",
    "description": "Dive into a Animal farm journey where you can train your skills to merge all the animals and get the big Horse. Can you be the first one to get the giant horse ? Lets find out in . Are you ready to take on the challenge and become the ultimate fruit merging master? Start your Farming adventure in Animal farm merge now!",
    "instructions": "Mouse Touch",
    "url": "https://html5.gamemonetize.com/k87d287ldcd5en9q2m1m5g4tro4s8jf3/",
    "category": "Hypercasual",
    "tags": ".io Games, 1 Player, Bubble Shooter, Chicken, Crafting, Defense, Driving, Friv, Summer",
    "thumb": "https://img.gamemonetize.com/k87d287ldcd5en9q2m1m5g4tro4s8jf3/512x384.jpg",
    "width": "400",
    "height": "800"
  },
  {
    "id": "31854",
    "title": "Airport Security 3d",
    "description": "Airport Security 3D is an airport security check simulation game with 3D cartoon models. Your mission is to arrest criminals with fake IDs and weapons while approving civilians. On the counter, you need to check the passengers name and corresponding ID card. At the security checkpoint, you are required to check their baggage and find the criminals who take weapons. Finally, you can question the criminals.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/vsgpevum1ik6sadjaxiu5wbr07vcks2b/",
    "category": "Hypercasual",
    "tags": "airplane, Simulation",
    "thumb": "https://img.gamemonetize.com/vsgpevum1ik6sadjaxiu5wbr07vcks2b/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31853",
    "title": "Fruit Merge Catalogue",
    "description": "Dive into a fruit-matching journey where you can train your skills to merge all the fruits and get the big watermelon . Can you be the first one to get the giant watermelon? Lets find out in . Are you ready to take on the challenge and become the ultimate fruit merging master? Start your fruity adventure in Fruit merge now!",
    "instructions": "Drage and drop Using Mouse Touch screen ",
    "url": "https://html5.gamemonetize.com/rowsfkels23s8apc3n30bx3yvguo66wd/",
    "category": "Puzzles",
    "tags": ".io Games, Casual, Hypercasual",
    "thumb": "https://img.gamemonetize.com/rowsfkels23s8apc3n30bx3yvguo66wd/512x384.jpg",
    "width": "400",
    "height": "800"
  },
  {
    "id": "31852",
    "title": "TrollHead to Face",
    "description": "In this adventure, the troll-faced stick must remain calm and humorous as he needs to survive in this sky parkour challenge. The troll-faced character must be fast and collect all the gold before time runs out. He needs to gather the gold, run, and reach the black portal. Surviving in this perilous world full of parkours is truly difficult. To survive, you must run very quickly. You need to collect the gold safely and pass each parkour without falling down. Navigate through the obstacles on the way and reach the portal.",
    "instructions": " You can move by pressing the WASD keys The game features double jumping Reach the portal before time runs out ",
    "url": "https://html5.gamemonetize.com/p1tsoue1cg06e4jrmg21yvhrka0kj919/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade, Best, Pixel",
    "thumb": "https://img.gamemonetize.com/p1tsoue1cg06e4jrmg21yvhrka0kj919/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31851",
    "title": "Innocent Hexa Puzzle",
    "description": "Innocent Hexa Puzzle is a captivating jigsaw game where pieces are uniquely shaped as hexagons. Challenge yourself to fit these hexa pieces perfectly and complete the beautiful puzzles.",
    "instructions": "Drag and drop the hexa pieces into place to complete the puzzle Use your mouse or touchpad to move the pieces ",
    "url": "https://html5.gamemonetize.com/3mdvm3rlgsebr9bf9aawdz37kzy9f9vj/",
    "category": "Puzzles",
    "tags": "HTML5, Jigsaw, Kids, Mobile, Puzzle",
    "thumb": "https://img.gamemonetize.com/3mdvm3rlgsebr9bf9aawdz37kzy9f9vj/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31850",
    "title": "Adventure of Lyra",
    "description": "Find butterflies to save Lyra from a bad magician Story begins with a collision with a dragon and Lyra, all the butterflies flew away during this collision. Bad magician prisoned Lyra and gave her a condition to collect those butterflies to free herself. Now the player has to help to collect those butterflies. Guide the way to get the butterflies and free Lyra. Be Careful! There were full of mysterious enemies waiting so don&amp;rsquo;t let fall of Lyra either the game will be over. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests.",
    "instructions": "How to play Android Use On-Screen touch to control PC Use Mouse Left Click to control ",
    "url": "https://html5.gamemonetize.com/zwvor6x7oudqcyqjdcn15safa14qhu5k/",
    "category": "Hypercasual",
    "tags": "2D, Casual",
    "thumb": "https://img.gamemonetize.com/zwvor6x7oudqcyqjdcn15safa14qhu5k/512x384.jpg",
    "width": "1680",
    "height": "800"
  },
  {
    "id": "31849",
    "title": "Money Up",
    "description": "Money Up is like a progressing road where different choices present themselves at every step. Your past choices determine your current situation. Additionally, you can also collect money along the way to increase your wealth. Your goal is to accumulate as much wealth as possible",
    "instructions": "Controls You can play the game just by clicking with your mouse ",
    "url": "https://html5.gamemonetize.com/fa522sgi5k6hffgec7ddqm41r9v7ah2y/",
    "category": "Hypercasual",
    "tags": "Casual, running",
    "thumb": "https://img.gamemonetize.com/fa522sgi5k6hffgec7ddqm41r9v7ah2y/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31848",
    "title": "Crazy Head Runner ",
    "description": "Experience the thrill of evolving as you navigate through dynamic gates! Each gate you pass will boost your strength and transform your head into unique styles. Collect power-ups, avoid obstacles, and reach new levels of power. Dive into this exciting journey and become the ultimate head runner. Simple controls and endless fun await you!",
    "instructions": "Controls You can play the game just by clicking with your mouse ",
    "url": "https://html5.gamemonetize.com/a1v3idx644uwhd60ltk89xga8wytw9vi/",
    "category": "Hypercasual",
    "tags": "Best, run",
    "thumb": "https://img.gamemonetize.com/a1v3idx644uwhd60ltk89xga8wytw9vi/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31847",
    "title": "Frisbee 3D",
    "description": "Welcome to Frisbee 3D Game! Tap or click to launch your frisbee, and swipe left and right to control it in the sky. Guide it through circles and avoid obstacles and trees until you reach the basket to unlock the next level. Each level has increasing difficulties and new obstacles, so be careful. Enjoy playing Frisbee 3D!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/r78r6yr0ahy568u7vm055r8o11ywwzk7/",
    "category": "Sports",
    "tags": "3D, 3D Games, Friv, Hypercasual, Physics, Sport, Sports, Unity3D",
    "thumb": "https://img.gamemonetize.com/r78r6yr0ahy568u7vm055r8o11ywwzk7/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "31846",
    "title": "Yellow Clicker Game",
    "description": "In this game, all you have to do is click on the screen or mouse. You can see your clicks per second and your total clicks. Its a very simple game.",
    "instructions": "All you have to do is click on the screen or mouse ",
    "url": "https://html5.gamemonetize.com/kpqq7felrmixybw97csi63yhcitttf5o/",
    "category": "Clicker",
    "tags": "1 Player, Click, Clicker",
    "thumb": "https://img.gamemonetize.com/kpqq7felrmixybw97csi63yhcitttf5o/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "31845",
    "title": "Zombie Royale Io",
    "description": "Zombie Royale io is a collecting survival arcade IO game. With 3D cartoon survivors, you need to help them rescue more survivors and shoot down as many zombies as you can. As the time goes on, you will meet more and more strong zombies. They will come and chase the last survivors randomly. You can summon more soldiers and bombs in the game. After each round, you can use the gold coins to upgrade your survivors.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/d3zex3l2rordlog1xeiq4id7521xskby/",
    "category": "Fighting",
    "tags": ".io Games, 1 Player, Stickman",
    "thumb": "https://img.gamemonetize.com/d3zex3l2rordlog1xeiq4id7521xskby/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31844",
    "title": "Sky Man",
    "description": "Welcome to Sky Man, a thrilling and addictive platformer game where you control a daring aviator navigating through the skies filled with obstacles and challenges. Embark on an epic adventure across beautifully designed levels, each more challenging than the last. Features: Exciting Levels: Navigate through various levels, each uniquely designed with increasing difficulty and new obstacles to conquer. Smooth Controls: Experience seamless and responsive controls as you guide Sky Man through the treacherous skies.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/yfv6w8zaxtc6uwhno3jcs02u4i3hku81/",
    "category": "Adventure",
    "tags": "1 Player, 2D, Adventure, Air, Classic",
    "thumb": "https://img.gamemonetize.com/yfv6w8zaxtc6uwhno3jcs02u4i3hku81/512x384.jpg",
    "width": "800",
    "height": "1280"
  },
  {
    "id": "31843",
    "title": "Jewel Garden Story",
    "description": "Enter a dazzling realm where sparkling jewels await your matching skills. Challenge yourself to achieve high scores and enjoy the visually stunning jewel combinations. Perfect for puzzle enthusiasts seeking endless entertainment.",
    "instructions": "The game features limitless puzzles Connect three or more jewels of the same type to clear levels Use 6 unique boosters to progress through the game faster Earn rewards through daily logins and Garden Expeditions and aim for top rankings in the competi",
    "url": "https://html5.gamemonetize.com/oezoo219v0bf4t552hfiityulzwls396/",
    "category": "Hypercasual",
    "tags": "Bejeweled, Casual, Jewel, Match 3, Match-3, Match3, Puzzle",
    "thumb": "https://img.gamemonetize.com/oezoo219v0bf4t552hfiityulzwls396/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "31842",
    "title": "The Trendy Mermaid",
    "description": "Embark on an exciting journey of makeup, accessories, and fashion to help Ariel make an unforgettable comeback. With a wide selection of clothes, makeup, and accessories, help Ariel become the trendiest mermaid ever. Enjoy making her look dreamy and fabulous - The Trendy Mermaid is free to play for every girl.",
    "instructions": "Use your mouse to play this game",
    "url": "https://html5.gamemonetize.com/9ckz9yarx2x2l6yfttm2cyo8eyofhnjx/",
    "category": "Girls",
    "tags": "1 Player, Dress Up, Fantasy, Fashion, Makeover, Mermaid",
    "thumb": "https://img.gamemonetize.com/9ckz9yarx2x2l6yfttm2cyo8eyofhnjx/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31841",
    "title": "SuperArcade: Fruits, Spears and Cubes",
    "description": "The game is a compilation of 3 popular arcade games. 1. game in the style of &amp;ldquo;watermelon games&amp;rdquo; where you need to combine fruits to improve them. You can also use different boosters. 2. a game where you have to throw a spear at balls that move in a pattern. The longer you play, the harder it is to hit the balls. 3. a game where you can control a cube to hit randomly generated holes in the wall. Also in the game there is a store with skins, which can be obtained for coins or advertising Play now!",
    "instructions": "Just click on screen ",
    "url": "https://html5.gamemonetize.com/woq23wli1odpxche8eyu0bcp54wj25uc/",
    "category": "Hypercasual",
    "tags": "1 Player, 2D, 3D, Arcade, Ballon, watermelon",
    "thumb": "https://img.gamemonetize.com/woq23wli1odpxche8eyu0bcp54wj25uc/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31840",
    "title": "Wobble Boy Escape",
    "description": "Wobble Boy Escape puts players in a thrilling situation where they must avoid capture by the police. Similar to a robbery scenario, players navigate through rooms, collecting money strategically placed throughout the map. The goal is to escape without getting caught, requiring quick thinking and stealthy maneuvers. Website Developer &lt;a href='https://www.crazygamesx.com/'&gt;https://www.crazygamesx.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/0si8k4jmhxatg84xdmqttt9vbsvdh2is/",
    "category": "Hypercasual",
    "tags": "Action, Escape, Level, Levels, Mentolatux, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/0si8k4jmhxatg84xdmqttt9vbsvdh2is/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31839",
    "title": "City Encounter",
    "description": "Inspector Vijay is taking the challenge of encountering alone with the terrorist coming to the city. Help Inspector Vijay to protect the city from terror. *Upgrade the weapons with the money you get rewarded. *Change the gun by selecting the arrow in the HUD *Buy bombs and use them when required. *You can purchase the bullets when its over. *Better helmets and bulletproof jackets will be available to purchase at higher levels. *Collect the medicine boxes to improve health.",
    "instructions": "Mouse or tap to play",
    "url": "https://html5.gamemonetize.com/bbb0kd8l3uj5h0ig5ymy6rcnni6cz9ad/",
    "category": "Shooting",
    "tags": "Action, Adventure, Army, assasin, Fire, Gun, Police, Shooter, Shooting, Street Fighting, War",
    "thumb": "https://img.gamemonetize.com/bbb0kd8l3uj5h0ig5ymy6rcnni6cz9ad/512x384.jpg",
    "width": "960",
    "height": "540"
  },
  {
    "id": "31838",
    "title": "Set The Box",
    "description": "Welcome to Set The BOX, a fun and addictive physics-based puzzle game where you challenge your stacking skills and precision. The goal is simple: stack the boxes as high as you can without toppling them over. But beware, the higher you stack, the more unstable it gets! Features: Challenging Gameplay: Each level requires careful planning and precise control to stack the boxes perfectly. The gameplay is easy to pick up but hard to master. Intuitive Controls: Simply tap and hold to drop the boxes. The longer you hold, the more accurately you can position the boxes.",
    "instructions": "How to Play Tap and Hold Tap and hold the screen to drop a box The longer you hold the more precise your placement Stack Boxes Carefully stack the boxes on top of each other to build the tallest tower possible Avoid Toppling Be mindful of the bala",
    "url": "https://html5.gamemonetize.com/8n1zlwkuvq0of7thttmjnszx8vwz3kjx/",
    "category": "Puzzles",
    "tags": "1 Player, 2D, Baby Games, Best Games, Block",
    "thumb": "https://img.gamemonetize.com/8n1zlwkuvq0of7thttmjnszx8vwz3kjx/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31837",
    "title": "Pagans Passage",
    "description": "Pagans Passage is an action game where you lead druids to complete 10 rituals to awaken The Old One. Shoot enemies to aid the druids in their goal, collect various artifacts, and try to get on the leaderboard!",
    "instructions": "Use numbers 1 2 and 3 to select the colors green blue and red for both bridges and skulls Hit space to shoot from the skull selected Left click anywhere on the swamp to place a tile bridge of the selected color Right click to remove a tile When ",
    "url": "https://html5.gamemonetize.com/gvo42hg07bi459z2zmeciw5d2khq2wrn/",
    "category": "Shooting",
    "tags": "Arcade, Shooting, Strategy",
    "thumb": "https://img.gamemonetize.com/gvo42hg07bi459z2zmeciw5d2khq2wrn/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31836",
    "title": "Rotating Colored Boxes",
    "description": "In this great addictive funny game the player must tap to flap and help the Boxes make it through the gaps, but you do it while in Orbit! Have Fun with this great Addictive funny App!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/015qr07z61ymgudfqb862s4eie266q67/",
    "category": "Hypercasual",
    "tags": "Arcade, Click, Flight, HTML5, Hypercasual, mapi games",
    "thumb": "https://img.gamemonetize.com/015qr07z61ymgudfqb862s4eie266q67/512x384.jpg",
    "width": "600",
    "height": "1024"
  },
  {
    "id": "31835",
    "title": "Buddy Quest",
    "description": "Explore the fun and use your brain to find the buddy A physics based brain game, you have to destroy those blocks then help the player to get nearest to the buddy. Be Careful! Think twice before destroying any blocks as falling to ground means the game will be over. If you like genres such as brain games, puzzle games or just want to have a good time then this game is for you. Features of this game: High Quality graphics Game size is minimal (but not compromised the graphics) Super simple controls make it easy to start playing Interesting levels will not let you get bored.",
    "instructions": "How to play Android Use On-Screen touch and tap to destroy the blocks PC Use Mouse Left Click to destroy the blocks ",
    "url": "https://html5.gamemonetize.com/utifzzxofepiap3r2krojlyim62y9o36/",
    "category": "Puzzles",
    "tags": "2D, Casual, Puzzle",
    "thumb": "https://img.gamemonetize.com/utifzzxofepiap3r2krojlyim62y9o36/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31834",
    "title": "Stickman Hunter",
    "description": "Embark on a thrilling journey in Stickman Hunter, where your mission is to protect your tribe from hidden enemies. Strategically use your ammunition to eliminate foes and rise as the tribes chieftain. With each of the 10 challenging levels, master the art of precision and cunning to uncover and defeat concealed threats. Do you have what it takes to lead your tribe to victory? How to Play: 1- Aim and shoot your weapon to hit hidden enemies. 2- Conserve ammunition and plan your shots carefully. 3- Progress through 10 increasingly difficult levels.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/vjjxb3kbxqfrdgom6d8sf2qbliboogai/",
    "category": "Shooting",
    "tags": "hunter, Shoot, Shooter, Shooting, Stickman",
    "thumb": "https://img.gamemonetize.com/vjjxb3kbxqfrdgom6d8sf2qbliboogai/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31833",
    "title": "Tank Stars Battle Arena",
    "description": "Tank Stars - Battle Arena is a tank design strategy game with 2D models. In 14 levels, we need you to build tanks to defeat all enemy tanks. As long as you defeat the enemy pilot, you can win the battle. When you earn enough diamonds, you can open the chests for tank parts in the Shop. You can save at most 3 projects of the tank design. Dont forget to change the positions of different parts, they have different functions.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/tylbyzddbkl0t4ljzbdmi0vhe0pm39er/",
    "category": "Arcade",
    "tags": "Battle, Puzzle",
    "thumb": "https://img.gamemonetize.com/tylbyzddbkl0t4ljzbdmi0vhe0pm39er/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "31832",
    "title": "Tetra Challenge",
    "description": "Are you looking for a new and exciting Tetris puzzle game?Then you are at the right place. Welcome to &amp;lsquo;Tetra Challenge&amp;rsquo;.It is the most advanced and engaging tetris reverse puzzle game.It will test your gaming skill to complete the level. The main object of this game is to place the block in the right position,if the match goes right,you will be rewarded.If you fail to do so,the automatic moving block will fill the game area and the game will be over. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests",
    "instructions": "How to play Android Touch and place the blocks to the right position to match correctly PC Use Mouse and place the blocks to the right position to match correctly ",
    "url": "https://html5.gamemonetize.com/pczxlmoh3e4hvnqw11nchk1wk20p8g0l/",
    "category": "Puzzles",
    "tags": "2D, Casual, Puzzle",
    "thumb": "https://img.gamemonetize.com/pczxlmoh3e4hvnqw11nchk1wk20p8g0l/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31831",
    "title": "Boxes Drop",
    "description": "Play at Boxes Drop and have fun with this entertaining puzzle game! The goal of the game is to get the coin into the basket without letting it touch the ground! Try to complete all different 24 levels! How to do this? Simply: destroy the wood boxes and, using the principles of physics to roll the boxes inside the basket! Boxes Drop is simple and fun puzzle game for everyone!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/7ybgschycf679rhbnsg0vqyz491c7s9e/",
    "category": "Puzzles",
    "tags": "Block, HTML5, html5 games, mapi games, Mobile, Physics, Puzzle",
    "thumb": "https://img.gamemonetize.com/7ybgschycf679rhbnsg0vqyz491c7s9e/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31830",
    "title": "Car Rush Super",
    "description": "Welcome to Car Rush Super Racing Game! Select your car and start the Race against others. Tap and hold to avoid crushing other vehicles, and keep dodging till you reach the final line. Enjoy!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/sh9bb4odd3mlle7vjddve23jgdsx00ff/",
    "category": "Racing",
    "tags": "Car, car tuning, Cars, drift, drifting, Driving, Race, Racing, Taxi, tractor",
    "thumb": "https://img.gamemonetize.com/sh9bb4odd3mlle7vjddve23jgdsx00ff/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "31829",
    "title": "Red and Blue Stick Huggy",
    "description": "In this adventurous game, the stick huggies, the huggy brothers, need to reach the finish line. The red and blue huggies must run very fast to reach the finish line. You should collect the red and blue hands along the way. Collect all the hands on the road and reach the black portal at the finish line. You must reach the portal safely before time runs out. Both friends need to reach the finish line.",
    "instructions": " Move to WASD Arrow Keys Double Jump available Mobile Touch Control",
    "url": "https://html5.gamemonetize.com/dwdig81cmf18m9d9uhzdfaqdg35pciph/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade, Battle, Friv, Platform, survival",
    "thumb": "https://img.gamemonetize.com/dwdig81cmf18m9d9uhzdfaqdg35pciph/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31828",
    "title": "City Run.io",
    "description": "In this fast-paced game, youll find yourself hurtling through bustling cities, dodging pedestrians and obstacles as you go. Your goal is to collect grey pedestrians and merge them into a single, giant entity, allowing you to take on other opponents and compete for dominance. As you progress, youll need to navigate increasingly crowded streets and challenging terrain to emerge victorious. Can you outrun and outmaneuver your opponents to be crowned the ultimate winner?",
    "instructions": "Slide your finger to play or mouse click ",
    "url": "https://html5.gamemonetize.com/yffqin0i6g8wp9s0d2ceppd0nafsp15m/",
    "category": "Fighting",
    "tags": ".io, .io Games, 2 Player, 2 Player Games, 3D, 3D Games, Multiplayer, Stickman, Unity3D",
    "thumb": "https://img.gamemonetize.com/yffqin0i6g8wp9s0d2ceppd0nafsp15m/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "31827",
    "title": "Planet Pair",
    "description": "Planet Pair is a memory game with pairs of planets. Each round has 3 phases of increasing difficulty: 3 pairs in the first, 6 pairs in the second, and 9 pairs in the final phase. The pairs and their positions are randomized in each phase, ensuring unique gameplay and high replay value. A timer challenges you to complete each round faster.",
    "instructions": "Controls Mouse Point Left click Select",
    "url": "https://html5.gamemonetize.com/a2mj7ls3yiirg4c30vvpgso5aohaym8n/",
    "category": "Puzzles",
    "tags": "Card, HTML, HTML5, Memory, Planet, Puzzle",
    "thumb": "https://img.gamemonetize.com/a2mj7ls3yiirg4c30vvpgso5aohaym8n/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31826",
    "title": "Guard The Baby 1",
    "description": "Game instructions: - Click on the enemy to defeat it when it attacks. - Press the left or right button or the A and D keys to control the character to move and collect fruits. Guard The Baby is an online game that both fun and tests the players agility and logical reasoning. In the game, you take on the role of a hungry boy who is trying to eat all the fruits falling from above. In addition, players must also eliminate all the animals attacking the boy. Players will have to multitask: eating as many fruits as possible while fending off the attacking creatures. This game not only provides entertainment but also helps to improve reflexes an",
    "instructions": "Game instructions - Click on the enemy to defeat it when it attacks - Press the left or right button or the A and D keys to control the character to move and collect fruits ",
    "url": "https://html5.gamemonetize.com/q15f4tdzhm077b8igtdr7qli7y5ktaqm/",
    "category": "Boys",
    "tags": ".io Games, 1 Player, 2D, Baby, Baby Games, Kid, Kids",
    "thumb": "https://img.gamemonetize.com/q15f4tdzhm077b8igtdr7qli7y5ktaqm/512x384.jpg",
    "width": "400",
    "height": "800"
  },
  {
    "id": "31825",
    "title": "Bitcoin Mining Simulator X",
    "description": "Bitcoin mining simulator game. Build up your bitcoin balance and get rich. Buy different pcs to keeps getting richer and build up your bitcoin empire. [This game does not give bitcoin]",
    "instructions": "Click bitcoin to earn ",
    "url": "https://html5.gamemonetize.com/glarfn6gagok3igj8v2mqz5h9isrm7v3/",
    "category": "2 Player",
    "tags": "1 Player",
    "thumb": "https://img.gamemonetize.com/glarfn6gagok3igj8v2mqz5h9isrm7v3/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31824",
    "title": "Stickman The Flash",
    "description": "Stickman The Flash is a fighting RPG arcade game with 2D stickman warriors. In the Survival Mode, you need to survive as long as you can by dodging red areas and killing incoming enemies. You can collect different weapons when you kill the corresponding enemies. When you earn enough gems, you can unlock and equip them in the Equipment Store, and they will increase your full abilities. Keep calm and slaughter them all!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/qfh8jceadtfl6m0ilctnpy6elqpdp04p/",
    "category": "Fighting",
    "tags": "1 Player, Action, Stickman",
    "thumb": "https://img.gamemonetize.com/qfh8jceadtfl6m0ilctnpy6elqpdp04p/512x384.jpg",
    "width": "1440",
    "height": "640"
  },
  {
    "id": "31823",
    "title": "Help Me Tricky Story",
    "description": "Help Me: Tricky Story is a fun-filled brain test game. This fun game is the best combination of brain puzzles with 17 levels, complete the appropriate actions according to the prompts, pulling teeth, eating fries, eating cheese, etc., featuring scenarios that happen in everyday life.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/ty61leabh5k1erxj05pisjemmkcc6gsv/",
    "category": "Puzzles",
    "tags": "Boys, Brain",
    "thumb": "https://img.gamemonetize.com/ty61leabh5k1erxj05pisjemmkcc6gsv/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31822",
    "title": "Brick Game Classic",
    "description": "Brick Game Classic is a classic Tetris online game. If you are a fan of classic games, then this game that has been popular for many years is just right for you. When any row or column is filled, it is eliminated. You can change the shape of the cubes before they fall to eliminate them quickly. You can also make them fall faster if you are satisfied with their shape. Now join the world of fun games.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/5w9koxawud7zr4gokc9juotpchqez273/",
    "category": "Puzzles",
    "tags": "Tetris",
    "thumb": "https://img.gamemonetize.com/5w9koxawud7zr4gokc9juotpchqez273/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31821",
    "title": "Knife WAR.IO",
    "description": "Enter Knife WAR.IO, where you face off against hordes of opponents in a fierce battle for dominance! Defeat rivals, gather orbs to level up and earn points. As you progress, grow in size and unlock different skins, evolving into a formidable giant in the arena. Strategize your attacks, dodge enemy knives, and rise to the top of this thrilling multiplayer experience! Website Developer &lt;a href='https://www.bestcrazygames.com'&gt;https://www.bestcrazygames.com&lt;/a&gt;",
    "instructions": "Use joystick to move player and A S D F for attacking other players ",
    "url": "https://html5.gamemonetize.com/xvcym1vb1aesda2konvlw79625pnkr6k/",
    "category": "Action",
    "tags": ".io, .io Games, Knight, Mentolatux, Sword, Unity3D, War, WebGL",
    "thumb": "https://img.gamemonetize.com/xvcym1vb1aesda2konvlw79625pnkr6k/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31820",
    "title": "Baby Taylor House Cleanup",
    "description": "This is a cleaning online game for girls. If you like cleaning games, then this is the perfect game for you. Tylers family has decided to do some housework this weekend. Mum and dad want to teach Tyler how to clean his room. They plan to clean the room, the toilet, the kitchen, and the pet house. Can you help them? You need to start by helping Taylor clean her room and organize her randomly placed items. After the cleaning is done, you need to continue to help her clean the kitchen and the toilet. Finally, the home of Taylors pet dog is also dirty, so youd better clean it up with her. Join the fun game world now.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/rljlw246wp3bgs44400oi8cxqucvg6w9/",
    "category": "Hypercasual",
    "tags": "Cleaning",
    "thumb": "https://img.gamemonetize.com/rljlw246wp3bgs44400oi8cxqucvg6w9/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31819",
    "title": "Noob vs Pro Snowman",
    "description": "In this epic adventure in the land of snow, you must not fall to your death on the icy ground. Both noob and pro need to survive. Snowmen are trying to knock you down by throwing snowballs at you, so be careful, the ground is very slippery. You need to survive on the slippery surface. The one who falls down the most loses. Do your best not to fall. Beware of the snowballs and whatever you do, dont fall down. Survive with your friend in this fun adventure.",
    "instructions": " Press the S key or the Down Arrow key to push or hit The player with the most points in 120 seconds wins Use the WASD keys or the Arrow keys to move ",
    "url": "https://html5.gamemonetize.com/89cf3zogeg47tr5ihwvtgrdq2f5f217t/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade, Minecraft, Pixel",
    "thumb": "https://img.gamemonetize.com/89cf3zogeg47tr5ihwvtgrdq2f5f217t/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31818",
    "title": "Merge Card 2048",
    "description": "Challenge your logical thinking ability with the 2048 card merge game. Can you pass our challenge of merging to the number 128 million?",
    "instructions": "Mouse drag card or Mobile touch drag card",
    "url": "https://html5.gamemonetize.com/z3toi22308992ndrx7huta2xpfzr3a6j/",
    "category": "Puzzles",
    "tags": "1 Player, 2D, Action, amazing, Card",
    "thumb": "https://img.gamemonetize.com/z3toi22308992ndrx7huta2xpfzr3a6j/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31817",
    "title": "Turbo Car Track",
    "description": "In Turbo Car Track your driving skills will be pushed to the limit! Collect gold coins to unlock powerful new vehicles and boost your progress. With each level, the intensity rises &amp;ndash; can you master the winding paths and become the ultimate champion? Dive into this thrilling high-speed adventure and find out! The race is on &amp;ndash; are you ready to conquer the track?",
    "instructions": "Movement ARROW KEYS to Drive",
    "url": "https://html5.gamemonetize.com/32dortup9kyyrhcu2tei4beskb9y62jf/",
    "category": "Sports",
    "tags": "Car, Cars, drift, Driving, Fun, HTML5, Racing, Stunts, Supercars",
    "thumb": "https://img.gamemonetize.com/32dortup9kyyrhcu2tei4beskb9y62jf/512x384.jpg",
    "width": "934",
    "height": "1040"
  },
  {
    "id": "31816",
    "title": "Free Fly",
    "description": "Welcome to Free Fly, an engaging and delightful arcade game where you help a cute bee navigate through various obstacles to reach new heights. Tap to fly, dodge clouds, and collect honeycombs to score points. The more you collect, the higher your score! Features: Simple Controls: Tap to make the bee fly higher. Its easy to learn but challenging to master. Cute Graphics: Enjoy vibrant and charming graphics that create a joyful and immersive experience. Endless Gameplay: The game continues as long as you can keep the bee flying and avoiding obstacles. How high can you go?",
    "instructions": "How to Play Tap to Fly Tap the screen to make the bee fly higher Avoid Obstacles Navigate the bee to avoid clouds and other obstacles Collect Honeycombs Gather honeycombs to increase your score Score High The longer you fly and the more honeycombs",
    "url": "https://html5.gamemonetize.com/7mbccuyyoofint1q8s9hmj7kn8be96j4/",
    "category": "Arcade",
    "tags": "1 Player, 2D, Adventure, Air, Aircraft, Android, Animal, Ball, Best Games",
    "thumb": "https://img.gamemonetize.com/7mbccuyyoofint1q8s9hmj7kn8be96j4/512x384.jpg",
    "width": "480",
    "height": "854"
  },
  {
    "id": "31815",
    "title": "Ellie And Ben Insta Fashion",
    "description": "Welcome to Ellie And Ben Insta Fashion. Help Ellie and her boyfriend Ben to choose an outstanding outfit to show their fashion skill on Instagram. Browse their wardrobe and pick costumes based on their moods. You can make their looks better with the help of other accessories. Join and play with your favorite couples. Have fun!",
    "instructions": "Left Mouse Button Click or Tap to Play",
    "url": "https://html5.gamemonetize.com/y53pkgkul2bvodw22pdauo5lh4sprnv1/",
    "category": "Girls",
    "tags": "Barbie, Dress Up, Fashion, Girls",
    "thumb": "https://img.gamemonetize.com/y53pkgkul2bvodw22pdauo5lh4sprnv1/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31814",
    "title": "Alex Adventure of Word",
    "description": "Solve the word puzzle to improve your word stock Place the desired word from the given hint of alphabets. Use your brain to place the correct alphabet. If you like genres such as word-puzzle games, puzzle games or just want to have a good time then this game is for you. Features of this game: High Quality graphics will leave only positive feedback Game size is minimal (but not compromised the graphics) and it is good for your device health Super simple controls make it easy to start playing Interesting levels will not let you get bored while playing the game.",
    "instructions": "How to play Android Use On-Screen touch and Drag PC Use Mouse Left Click and Drag ",
    "url": "https://html5.gamemonetize.com/ddmv1wvgdfu14mb9d6fr7zu4bxndv08p/",
    "category": "Puzzles",
    "tags": "2D, Casual, Puzzle, Word",
    "thumb": "https://img.gamemonetize.com/ddmv1wvgdfu14mb9d6fr7zu4bxndv08p/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31813",
    "title": "Bubbles Pop Challenge",
    "description": "Pop, pop, pop! Welcome to Bubbles Pop! Throw your bubbles and challenge yourself to achieve the highest score possible in this satisfying and relaxing game. Collect coins to buy new weapons from the shop. Eaxh weapon has its own unique ability. Drag and release according to the direction you want to throw your weapons, watch out for the energy bar; if it depletes, its game over.",
    "instructions": "Mouse or touch controls to drag and release your weapons ",
    "url": "https://html5.gamemonetize.com/xzhclpx8ma2qh2vvafdqkg6bx8w9kp1b/",
    "category": "Adventure",
    "tags": "Adventure, Dragon, RPG",
    "thumb": "https://img.gamemonetize.com/xzhclpx8ma2qh2vvafdqkg6bx8w9kp1b/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31812",
    "title": "Block Mania",
    "description": "Block Mania is an addictive block puzzle game combines block building, puzzle solving and enjoyable gameplay. This great block puzzle game offers an exciting and entertaining experience for players of all ages.",
    "instructions": "How to Play - Drag blocks onto the board to place them in the grid - Fill a line to clear blocks from the board - Clear multiple row or column to earn Combo points - Blast the colorful blocks and beat your best score - Have a nice puzzles with colorf",
    "url": "https://html5.gamemonetize.com/l0ffyelw7fn53oxwjf27zftkr5mr3a87/",
    "category": "Puzzles",
    "tags": "Block, Collection, Puzzle, puzzleblock",
    "thumb": "https://img.gamemonetize.com/l0ffyelw7fn53oxwjf27zftkr5mr3a87/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31811",
    "title": "Pelucaneitor",
    "description": "Use the power of the chainsaw to stop corruption",
    "instructions": "Screen virtual joystick or keyboard",
    "url": "https://html5.gamemonetize.com/ztnbkie4rttxvbrtfi3e24wvcps2fcue/",
    "category": "Arcade",
    "tags": "Action",
    "thumb": "https://img.gamemonetize.com/ztnbkie4rttxvbrtfi3e24wvcps2fcue/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "31810",
    "title": "Boom Stick Bazooka 2 Puzzles",
    "description": "Welcome to the explosive world of Boom Stick Bazooka 2, a free online game to destroy platforms and enemy stickmen with your customizable bazooka. Aim and shoot to eliminate the towers where the black stickmen are, some of which if you delay will shoot you trying to eliminate your 3 lives. You will have 3 opportunities to aim and shoot in each level, you can repeat at any time or buy more ammunition. To eliminate enemies faster, try to destroy the barrels so that they explode nearby and destroy the towers. With each level you pass, you will get coins which, when collected, you can buy new skins and new weapons which will have better charact",
    "instructions": "The objective of the game is to eliminate all enemies with 3 ammo from your bazooka You can destroy the towers and hit the stickmen with the heavy objects or by exploding the barrels nearby Controls Use the mouse to aim and shoot Tap on the screen and ",
    "url": "https://html5.gamemonetize.com/nr4piqtonxo1bfiolcy70aeo7itsxdr3/",
    "category": "Shooting",
    "tags": "Bomb, Shooting, Stickman",
    "thumb": "https://img.gamemonetize.com/nr4piqtonxo1bfiolcy70aeo7itsxdr3/512x384.jpg",
    "width": "900",
    "height": "600"
  },
  {
    "id": "31809",
    "title": "Clue Hunter",
    "description": "Clue Hunter is an interesting crime-solving puzzle game. If you also like detective games, and logic to solve puzzles, you absolutely can not miss it! There are five levels in this game, Help Mom, Save the Girl, Laundry Master, Loss Escape, and Strange Neighbors. As simple as it may seem, passing the levels is difficult! Dig deep into the details and use your analytical skills to find hidden objects and clues. One after another difficult cases are waiting for you to solve! Wish you success!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/0dwmk0t11ih0am1319jh76rdalq7zky0/",
    "category": "Puzzles",
    "tags": "1 Player, Puzzle",
    "thumb": "https://img.gamemonetize.com/0dwmk0t11ih0am1319jh76rdalq7zky0/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31808",
    "title": "Zoo Animal Hotel",
    "description": "In this cleaning game, you will experience an unrivaled cleaning experience and try to make this animal hotel a great impression on your future customers. You may start with the tiger dress-up or in any order you like but know that no matter which one you start with, you should complete all the tasks. Create an original look for our tiger cubs and dont be afraid to use crazy accessories such as colorful hats and big sunglasses. During both stages, you will clean the room and reception. Try to provide quality service and complete chores with your dog and rabbit. Wipe off the dust, clean the floors, and deal with other messy areas.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/y7lx691n2pg10fsjsy3959jx2wmh6tfr/",
    "category": "Hypercasual",
    "tags": "Cleaning",
    "thumb": "https://img.gamemonetize.com/y7lx691n2pg10fsjsy3959jx2wmh6tfr/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31807",
    "title": "Colorful Cubes",
    "description": "This is a game where the player uses colorful cubes to paint the required number of small white platforms. During the game, the player must avoid spikes, deceptive platforms, and platforms that delay the player.",
    "instructions": "Use arrow keys or touch on the screen ",
    "url": "https://html5.gamemonetize.com/vjaeux26xsh0vstrfe5i0sb6v4yxp6oc/",
    "category": "Puzzles",
    "tags": "1 Player, Best, Color, Fun, HTML5, Mobile, Skill",
    "thumb": "https://img.gamemonetize.com/vjaeux26xsh0vstrfe5i0sb6v4yxp6oc/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31806",
    "title": "Craft Theft War",
    "description": "Immerse yourself in the best open-world action-adventure sandbox game, Craft Theft War, inspired by pixel voxel cube craft style online shooting games. Enjoy a vast selection of action-packed games, cool games, and relaxing games, all within a sprawling sandbox environment. This game offers an unparalleled online gaming experience, combining the best elements of open-world adventure, sandbox gameplay, and multiplayer action. Join the fun today and discover why its one of the best online games!",
    "instructions": "Move WASD Aim Mouse Shoot Left Click Jump Space Sprint Shift Reload R ",
    "url": "https://html5.gamemonetize.com/2w7rnj6q5cnt9jt81l0m7s27uqqyqq0f/",
    "category": "Action",
    "tags": "Action, Battle, Bubble Shooter, Multiplayer, Shooting, War",
    "thumb": "https://img.gamemonetize.com/2w7rnj6q5cnt9jt81l0m7s27uqqyqq0f/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31805",
    "title": "Chick Chase",
    "description": "Welcome to Chick Chase, a delightful and addictive platformer game where you control a brave chicken on a quest to collect eggs scattered across various challenging levels. Embark on an egg-citing journey filled with fun obstacles and beautifully designed environments. Features: Challenging Levels: Explore numerous levels, each uniquely designed with increasing difficulty and new obstacles to overcome. Each level presents a fresh challenge that keeps the gameplay engaging. Collectible Eggs: Gather eggs scattered throughout the levels to increase your score and unlock new achievements. Challenge yourself to collect them all!",
    "instructions": "How to Play Move and Jump Use on-screen controls to move your chicken left or right and jump across platforms Collect Eggs Gather all the eggs in each level to increase your score ",
    "url": "https://html5.gamemonetize.com/zq13aivhiwn15quh294bxxlvrat8faou/",
    "category": "Adventure",
    "tags": "1 Player, 2D, Adventure, Cartoon, free games for your site",
    "thumb": "https://img.gamemonetize.com/zq13aivhiwn15quh294bxxlvrat8faou/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31804",
    "title": "Underground Prison Escape",
    "description": "Underground Prison Escape offers an exciting escape experience with a hyper casual game full of action and strategy. Play a character trapped between the cold walls of the prison, under the watchful eye of guards, and in corridors full of traps. Your goal is to escape from this challenging prison by overcoming all obstacles. The game is filled with a series of puzzles and obstacles that will limit your intelligence and speed. Collect clues inside the prison, maintain your stealth and wait for the right moment. Every move is critical to your freedom. Move through the prison world while evading the guards and apply your strategy to break free",
    "instructions": "Controls You can play the game just by clicking with your mouse ",
    "url": "https://html5.gamemonetize.com/x35n0vq02wdzz6j9ks0xx05knzl3sewr/",
    "category": "Hypercasual",
    "tags": "Best, Casual",
    "thumb": "https://img.gamemonetize.com/x35n0vq02wdzz6j9ks0xx05knzl3sewr/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31803",
    "title": "Horror Hospital",
    "description": "Step into the terrifying world of Horror Hospital, an FPS survival game that will test your nerves and skills. Set in a sinister hospital overrun by creepy clowns, your mission is to survive wave after wave of relentless enemies. Armed with an array of purchasable weapons, you must use your wits and firepower to fend off the clowns and stay alive. Aim for the highest score and dominate the leaderboards in this intense, heart-pounding experience. Can you survive the horror and emerge as the ultimate champion of Horror Hospital?",
    "instructions": "WASD Move Mouse Aim Shoot L-Shift Sprint R Reload Weapon T Inspect Weapon",
    "url": "https://html5.gamemonetize.com/8mo1t9s8ipnqkl00bhkusf7put6rozwl/",
    "category": "Shooting",
    "tags": "1 Player, 3D, 3D Games, Action, fps, Horror, Shooter, Shooting, survival, unity, Unity3D",
    "thumb": "https://img.gamemonetize.com/8mo1t9s8ipnqkl00bhkusf7put6rozwl/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31802",
    "title": "Chibi Doll Art Magic",
    "description": "Unleash your creativity and dive into the enchanting world of Chibi Doll Art Magic! This captivating game invites you to explore your artistic talents by designing and customizing adorable chibi dolls. With endless possibilities and a magical touch, you can bring your unique visions to life. Design, customize, and create stunning chibi dolls that reflect your unique artistic vision. The magic is in your hands!",
    "instructions": "Mouse to play ",
    "url": "https://html5.gamemonetize.com/yy71luo3x0t6933v8m9kno6qqh7wienx/",
    "category": "Hypercasual",
    "tags": "Baby, Boy, Cartoon, Coloring, Fun, Girl, Hypercasual, Kids, School",
    "thumb": "https://img.gamemonetize.com/yy71luo3x0t6933v8m9kno6qqh7wienx/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "31801",
    "title": "Rotating Boxes",
    "description": "ChatGPT Rotating Boxes is a funny game where you must control a big rolling Box wheel through 30 levels. With its original and colorful graphics, Rotating Boxes will be a pleasant time-killer, simple but addicting. You will need to jump, accelerate, brake, and have perfect control of your stone to complete all levels!",
    "instructions": "Touch the screen to play ",
    "url": "https://html5.gamemonetize.com/7pp1olk7tl7y2gqdakdw1sfyicyvxp66/",
    "category": "Puzzles",
    "tags": "Casual, Family, HTML5, jump, Jumping, mapi games, Puzzle, Racing",
    "thumb": "https://img.gamemonetize.com/7pp1olk7tl7y2gqdakdw1sfyicyvxp66/512x384.jpg",
    "width": "1024",
    "height": "600"
  },
  {
    "id": "31800",
    "title": "BFF Summer Shine Look",
    "description": "Welcome to BFF Summer Shine Look. Bffs are planning for the weekend summer party at the resort. They are bored of trying old fashion summer costumes. Browse their wardrobe for a new collection of outfits and pick a suitable one for each one. Choose matching accessories and unique hairstyles for them. Help them and make this summer party a more memorable one.",
    "instructions": "Left Mouse Button Click",
    "url": "https://html5.gamemonetize.com/rdxaoe3rdbmy0iwwmpfd8vbf16bcui7s/",
    "category": "Girls",
    "tags": "Dress Up, Fashion, Summer",
    "thumb": "https://img.gamemonetize.com/rdxaoe3rdbmy0iwwmpfd8vbf16bcui7s/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31799",
    "title": "Gem Run Gem Stack",
    "description": "Gem Run: Gem Stack is recommended as a vertical-version running arcade game. With 3D gems and tools, you need to collect enough mines, process and mold the mines and put the diamonds on the rings. The more gem rings you make, the more money you can win. When you have enough money, you can unlock rings, colors, and hands in the shop.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/rh35siqw054qoulv1pw5ukux63j98z3i/",
    "category": "Racing",
    "tags": "1 Player, running",
    "thumb": "https://img.gamemonetize.com/rh35siqw054qoulv1pw5ukux63j98z3i/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31798",
    "title": "Mini Games Casual Collection",
    "description": "Mini Games: Casual Collection is an online game. The gameplay is simple, fun, and addictive, so you wont be able to stop playing. There is no stamina display. You can play anytime anywhere. You can use hints to help you pass when you are stuck on a level. If you have any problems playing this game or have any suggestions for this game, please leave us a message. If you like our games, please share them with your friends to double the fun!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/86btouipzdg9rkybx68598nbzu8t166u/",
    "category": "Puzzles",
    "tags": "1 Player, Casual",
    "thumb": "https://img.gamemonetize.com/86btouipzdg9rkybx68598nbzu8t166u/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31797",
    "title": "Unicorn Cake Maker",
    "description": "This is a dessert-making game for girls. If you like unicorns and baking simultaneously, this game is just for you. You can make cakes, ice creams, and pizzas, and decorate baked desserts with desserts and donuts. From making, and baking to decorating, you can experience it all by yourself. Our game will briefly describe the girls favorite food recipes to give you a real cake game feel. The food tools used in cooking will be controlled smoothly and realistically so that you can experience a novel gaming experience. Here you can become a food unicorn chef and decorate it as you wish. Now come and join the fun game.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/512tn6387uo1t64u9bmqnir5ppwn7bmp/",
    "category": "Girls",
    "tags": "Dress Up",
    "thumb": "https://img.gamemonetize.com/512tn6387uo1t64u9bmqnir5ppwn7bmp/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31796",
    "title": "World of Alice   Dino Colors",
    "description": "World of Alice - Dino Colors is an educational game developed for children with the aim of combining colors and improving logical reasoning in a fun way using a tablet, cell phone or computer. Excellent educational resource. In Alices World, learning is fun.",
    "instructions": "Match the egg with the corresponding dinosaur color ",
    "url": "https://html5.gamemonetize.com/i8iy4t4rx2k2815m8oq2yi4jtm3i4rts/",
    "category": "Puzzles",
    "tags": "Best Games, Card, Color, dino, Dinosaur, Educational, free games for your site, free html5 games for your website, HTML5, html5 games for your site, Kids, Logic, School, World of Alice",
    "thumb": "https://img.gamemonetize.com/i8iy4t4rx2k2815m8oq2yi4jtm3i4rts/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "31795",
    "title": "Tiles Puzzle Fun",
    "description": "Let&amp;rsquo;s deep dive into the world of Tiles Puzzle Fun, new challenges are waiting for you Match the puzzle blocks by simply tapping. Use your brain and solve the tile block. This game has 50 levels and each level gives you a new challenge. If you like genres such as puzzle games, tile matching games or just want to have a good time then this game is for you. Features of this game: High Quality graphics will leave only positive feedback Game size is minimal (but not compromised the graphics) and it is good for your device health Super simple controls make it easy to start playing Interesting levels will not let you get bored.",
    "instructions": "How to play Android Use On-Screen touch and tap PC Use Mouse Left Click to tap ",
    "url": "https://html5.gamemonetize.com/y4g8do606bzs8g3jx5p5nxzurc3nbec5/",
    "category": "Puzzles",
    "tags": "2D, Matching, Puzzle",
    "thumb": "https://img.gamemonetize.com/y4g8do606bzs8g3jx5p5nxzurc3nbec5/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31794",
    "title": "Prison Escapes",
    "description": "Prison Escape is a fun online escape game with different levels! You have to help the desperate escape attempt of a wrongly accused prisoner who is determined to escape from a high-security prison and embark on an exciting journey. You have to navigate through complex puzzles and evade the vigilant guards. Will you beat the system and secure his freedom, or leave him to the perils of prison? Make sure you are going in the right direction of the prison escape game and try your best to avoid the range of security guards.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/ah4xrvjv2t6brdepii7kfc6ke5l8lmas/",
    "category": "Arcade",
    "tags": "Arcade, Avoid, Brain, Casual, Escape, Fun, HTML5, html5 games, Logic, Logical, Police, Prison, Strategy",
    "thumb": "https://img.gamemonetize.com/ah4xrvjv2t6brdepii7kfc6ke5l8lmas/512x384.jpg",
    "width": "960",
    "height": "540"
  },
  {
    "id": "31793",
    "title": "Avoid The Spikes",
    "description": "Avoid The Spikes! is a fun adventure game thats exciting to play. Here is our little colour box hero, who has been stuck in the middle of a whole lot of traps. Help him dodge them and navigate through the challenging environment. There are really fast-paced obstacles passing by&amp;mdash;keep away from them and survive as long as you can. This game will boost your reflexes as you deal with the hardest objects moving towards him. The dynamic and engaging gameplay ensures an adrenaline-pumping experience that will keep you on the edge of your seat. Join the adventure and see how long you can last!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/dziityv2q3azh8tq2dl3ndxcrxjdmo9o/",
    "category": "Hypercasual",
    "tags": "Family, free html5 games for your website, Hypercasual, mapi games, run, Superhero",
    "thumb": "https://img.gamemonetize.com/dziityv2q3azh8tq2dl3ndxcrxjdmo9o/512x384.jpg",
    "width": "600",
    "height": "1024"
  },
  {
    "id": "31792",
    "title": "Burguer Farm version 1.0",
    "description": "In Burger Farm, your goal is to collect as many burgers falling from the sky as possible while avoiding ads that get in your way. Aim for the highest score and test your reflexes in this fun and addictive game. Can you become the ultimate burger collector?",
    "instructions": "control your character by tapping the right and left sides of the screen or by clicking the right and left sides of the screen Use these controls to navigate and collect burgers while avoiding obstacles ",
    "url": "https://html5.gamemonetize.com/8t765lnynz3f63shdq0zrp36vgkwme90/",
    "category": "Hypercasual",
    "tags": "1 Player, Adventure, Android, Casual, Cooking",
    "thumb": "https://img.gamemonetize.com/8t765lnynz3f63shdq0zrp36vgkwme90/512x384.jpg",
    "width": "960",
    "height": "1708"
  },
  {
    "id": "31791",
    "title": "Mega Prize Scratch",
    "description": "Embark on a fun journey and try your luck with scratch cards. The appearance and value of houses, cars, or animals are in your hands. Win big with the scratchers, complete all the missions, and ensure every story has a happy ending.",
    "instructions": "This casual game consists of earning coins from scratchers and upgrading bad-looking objects such as houses or cars in each world you visit Your mission ends when the items are fully upgraded Then you will travel to another world where another mission",
    "url": "https://html5.gamemonetize.com/x7tsai3gxai0ws4v3ioyqe9ko666p7br/",
    "category": "Hypercasual",
    "tags": "Casino",
    "thumb": "https://img.gamemonetize.com/x7tsai3gxai0ws4v3ioyqe9ko666p7br/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "31790",
    "title": "Block Rush",
    "description": "Welcome to Block Rush, a vibrant and addictive match-three puzzle game that will keep you entertained for hours. Match and blast your way through a variety of levels filled with colorful animal-themed blocks. With each match, you score points and clear the board, but be quick and strategic to reach the highest scores! Features: Engaging Levels: Enjoy numerous levels, each uniquely designed to challenge your matching and strategic skills. As you progress, the levels become more complex and exciting. Colorful Graphics: Immerse yourself in the vibrant and playful graphics that bring the animal-themed blocks to life.",
    "instructions": "How to Play Match Blocks Tap on groups of three or more adjacent blocks of the same color to match and blast them Score Points Each match scores points and clears the blocks from the board The larger the group of blocks the higher the score Strateg",
    "url": "https://html5.gamemonetize.com/frya9suggnkd2lz9ointa8skqah5nd8k/",
    "category": "Puzzles",
    "tags": "1 Player, 2D, Adventure, amazing, Animal, Baby Games, Ball, Bricks",
    "thumb": "https://img.gamemonetize.com/frya9suggnkd2lz9ointa8skqah5nd8k/512x384.jpg",
    "width": "480",
    "height": "854"
  },
  {
    "id": "31789",
    "title": "Merge 2048 Cake",
    "description": "A unique number puzzle. It has a completely new and unusual merge mechanic &amp;ndash; just try it and you will definitely love it &amp;hellip; match games addiction guaranteed! Just look at how smoothly and beautifully those number blocks combine with each other. Hypnotizing, isn&amp;rsquo;t it? You will also appreciate the modern gameplay, simple and straightforward match game rules. Relax after a hard day and have some soft pleasure &amp;ndash; no similar 2048 game experience required! . A new generation of merge games is already here! ;) Number puzzle: relax and win Soft shapes, bright colors, smooth animation has everything for a pleasant 1024 game! Great music will also help",
    "instructions": "Touch Mobile Mouse PC ",
    "url": "https://html5.gamemonetize.com/mawi3nh6ebh72xnqh0tyoprnbsi3wcj9/",
    "category": "Puzzles",
    "tags": "1 Player, 2048, 2D, Android, Board",
    "thumb": "https://img.gamemonetize.com/mawi3nh6ebh72xnqh0tyoprnbsi3wcj9/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31788",
    "title": "Big Eye FNF",
    "description": "Get ready to groove and battle your way to victory in Big Eye FNF, the super fun and free-to-play Friday Night Funkin game that will keep you tapping to the beat! In this exciting rhythm-based game, you play as the boyfriend, who must face off in epic musical battles to win back his beloved girlfriend. Ready to prove your rhythm skills and win back your love? Dive into Big Eye FNF, tap your way to the end, and enjoy the musical adventure that awaits. Let the rhythm battle begin!",
    "instructions": "Arrow keys to play ",
    "url": "https://html5.gamemonetize.com/bnfro8nvxgxlhdlzwqg269dxfo18ha1h/",
    "category": "Puzzles",
    "tags": "Arcade, Hypercasual",
    "thumb": "https://img.gamemonetize.com/bnfro8nvxgxlhdlzwqg269dxfo18ha1h/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31787",
    "title": "Mad Truck",
    "description": "Are you good at challenging the balanced platforms and ramps? Mad Truck provides you with a driving simulation game. In the Level mode, you need to keep the car stable at the side. In the challenge Level mode, you can drive the car to overpass different obstacles at the normal view. All levels require players to reach the finish line as soon as possible. If you can complete the level at the marked time, you can win all 3 yellow stars.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/vqes6aosswf1kmk08n0d90yb9o85jffc/",
    "category": "Racing",
    "tags": "Cars, monstertruck",
    "thumb": "https://img.gamemonetize.com/vqes6aosswf1kmk08n0d90yb9o85jffc/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "31786",
    "title": "Zombie Raft",
    "description": "Zombie Raft is a survival game. The zombie apocalypse is coming and its time for a raft survival game! Protect yourself and other survivors from the looming zombie tsunami, and push them all back, its your responsibility to survive on the raft! Squeeze the vehicles forward and push them if necessary! Keep going, escape the zombie tsunami, and conquer the barren land! If stranded survivors are found, you need to rescue them! Join us and experience the best zombie game!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/wxch3vvnkopik8hc2prvw0kcg9xs7cqh/",
    "category": "Racing",
    "tags": "survival, Zombie",
    "thumb": "https://img.gamemonetize.com/wxch3vvnkopik8hc2prvw0kcg9xs7cqh/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31785",
    "title": "Bounce Dunk Frvr",
    "description": "Do you like to play basketball and experience the feeling of dunking? This is a bouncing dunk game. The game has a real physics engine,&amp;nbsp; you will experience the real feeling of basketball bouncing. The game will also have Multiple people dribbling, with obstacles in the middle. Dont be blocked! , the obstacles will not bring you a higher score, break them, just for the fun of dunking! Besides dunking, what else can basketball give you when you are a basketball player?",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/6u6wvhyvbgusqnzxuk8aw911ar2vx73d/",
    "category": "Sports",
    "tags": "Basketball",
    "thumb": "https://img.gamemonetize.com/6u6wvhyvbgusqnzxuk8aw911ar2vx73d/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31784",
    "title": "Speedy Race Math",
    "description": "Speedy Math Race is a skill game for desktop and mobile. Choose addition, subtraction, multiplication or division. Tap the right number to answer math questions correctly. Play fast to get higher scores.",
    "instructions": "Click or tap numbers Play in landscape mode for better experience ",
    "url": "https://html5.gamemonetize.com/in52dgjmoqmmjtfr42zhg5co5aehgw6t/",
    "category": "Racing",
    "tags": "2D, Cars, Click, Educational, HTML, Math, Mobile, Number, Race, School, Side Scrolling, Skill",
    "thumb": "https://img.gamemonetize.com/in52dgjmoqmmjtfr42zhg5co5aehgw6t/512x384.jpg",
    "width": "960",
    "height": "640"
  },
  {
    "id": "31783",
    "title": "Sweet Baby Taylor Summer Travel",
    "description": "This is a summer simulation game. Everyone loves to enjoy the summer holidays. Spend your summer at the beach with Taylor and her friends at the beach. You need to help Taylor to clean and fix her messy house. Clean the rooms, iron clothes, change clothes, and take a bath. You need to help her repair her car. Check for leaky tires, fill up the water tank, clean the stains, and get the truck ready to drive. You can also make your delicious juices. Make mouth-watering juices and smoothies throughout the summer to keep you refreshed and feeling happy.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/m7322bvz6b7b5ddly880ka7kd6vc0asy/",
    "category": "Hypercasual",
    "tags": "Holiday, Simulation, Summer",
    "thumb": "https://img.gamemonetize.com/m7322bvz6b7b5ddly880ka7kd6vc0asy/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31782",
    "title": "Skyblock Parkour Easy Obby",
    "description": "In this adventure, Obby and his girlfriend need to complete a skyblock obstacle course that seems easy but is actually quite challenging. They must be careful and never, ever separate from each other. If they do, they could die. Both of them need to reach the finish line safely. They must be very cautious as there are obstacles everywhere. The course features spiked traps on the ground and moving obstacles that go up and down. Help Obby and his girlfriend reach the finish line.",
    "instructions": " Use the Arrow Keys to move the Obby Use the WASD to move the Girl Friend both mobile and desktop playability ",
    "url": "https://html5.gamemonetize.com/hdoly8bhxjovlea78vo07du3vovrnz49/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, mineblock, Pixel, Platform",
    "thumb": "https://img.gamemonetize.com/hdoly8bhxjovlea78vo07du3vovrnz49/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31781",
    "title": "Hungry Beast",
    "description": "Explore the forest to collect fruits to feed cute demon. Game story begins with a big demon&amp;rsquo;s hungry issue, and he is very angry as no fruits are left in the forest. So small demons take the responsibility to collect fruits. Player has to help the fruits by swiping them to the desired food. You can take many demon characters by using coins. Be Careful! Control the swiping time either demon will collide with spikes and the game will be over. If you like genres such as adventure, rpg, platform, quests or just want to have a good time then this game is for you. Features of this game: High Quality graphics Game size is minimal Super simple.",
    "instructions": "How to play Android Use On-Screen touch to swipe PC Use Mouse Left Click to swipe ",
    "url": "https://html5.gamemonetize.com/c7nf6ekmxsp9hud9sh450h9k0y9d90a4/",
    "category": "Hypercasual",
    "tags": "2D, Casual, Fun",
    "thumb": "https://img.gamemonetize.com/c7nf6ekmxsp9hud9sh450h9k0y9d90a4/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31780",
    "title": "Remove The Puzzle",
    "description": "The Remove Puzzle is an engaging and challenging game that tests your problem-solving skills. With its unique gameplay mechanics and variety of levels, it offers hours of entertainment. Whether youre a casual gamer looking for a fun way to pass the time or a puzzle enthusiast seeking a new challenge, the Remove Puzzle is sure to keep you hooked. Each level presents a different set of obstacles and requires you to think outside the box to find the solution. With its intuitive controls and visually appealing design, this game is perfect for both beginners and experienced players alike.",
    "instructions": "Tap on the puzzle pieces to play the game ",
    "url": "https://html5.gamemonetize.com/i86tbhy37he49aiwhd3ln97dt8kt0hhc/",
    "category": "Puzzles",
    "tags": "Arcade, Kids, Puzzle",
    "thumb": "https://img.gamemonetize.com/i86tbhy37he49aiwhd3ln97dt8kt0hhc/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31779",
    "title": "Wood Man Cutter",
    "description": "Welcome to Wood Man Cutter 3D Game! Tap and hold to start walking, rotating with an elastic rope. Begin cutting wood from trees, but be careful to avoid metal objects and rocks. Can you pass the level 3? Enjoy this game on gamemonetize.com",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/9dn6qz1nr6ldwr082r4t7o55aeyo3owt/",
    "category": "Fighting",
    "tags": "3D, 3D Games, Adventure, cut, Forest, Hypercasual, Relaxation, Unity3D",
    "thumb": "https://img.gamemonetize.com/9dn6qz1nr6ldwr082r4t7o55aeyo3owt/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "31778",
    "title": "Monsterr Match",
    "description": "Collect the maximum score by exploding the tiles.",
    "instructions": "You can explode the tiles by Mouse click or Tap on it only if there are three or more similar adjacent tiles Find the maximum score before the tile touches the top ",
    "url": "https://html5.gamemonetize.com/m9bozq3pg2vywfq8mlgupk8sf9ceosl7/",
    "category": "Puzzles",
    "tags": "Block, Brain, Casual, Clicker, Color, Kids, Logic, Match 3, Match3, Matching, Monster, Puzzle, puzzleblock",
    "thumb": "https://img.gamemonetize.com/m9bozq3pg2vywfq8mlgupk8sf9ceosl7/512x384.jpg",
    "width": "540",
    "height": "960"
  },
  {
    "id": "31777",
    "title": "Stack Ball Legends",
    "description": "Stack Ball 3D is a casual arcade game where players control a ball that bounces on a series of circular platforms stacked on top of each other. The objective is to break through the colorful platforms by hitting them with the ball while avoiding the black platforms, which cause the ball to shatter and end the game. The game features simple controls: players tap and hold to make the ball smash through the platforms and release to stop. Each level presents dynamic platform arrangements with increasing difficulty, ensuring a fresh challenge every time. Stack Ball 3D offers a fun, fast-paced gaming experience perfect for quick sessions and casual",
    "instructions": "Here are the instructions to play Stack Ball 3D Start the Game Open the Stack Ball 3D app on your device Understand the Objective The goal is to break through the colorful platforms by hitting them with your ball while avoiding the black platforms ",
    "url": "https://html5.gamemonetize.com/6e37n8x8xlihofrgp3qwbtwxgxps1bw6/",
    "category": "Hypercasual",
    "tags": "1 Player, 3D Games, amazing, Best Games, free games for your site, free games for your website, free html5 games for your website, HTML, html games for your website, HTML5, html5 games, html5 games for your site",
    "thumb": "https://img.gamemonetize.com/6e37n8x8xlihofrgp3qwbtwxgxps1bw6/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31776",
    "title": "2 Player Mini Challenge",
    "description": "2 Player Mini Challenge is an online casual game. If you want to play with your friends on the same device, or if you want to play alone against the AI, this is the game for you! This 2-player game collection features beautifully minimalist graphics that allow you to focus on going head-to-head with your opponent. The more participants you have, the more fun youll have as you practice skills, react quickly, and interact with friends, relatives, and coworkers in a whole new way.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/l9goa6cv46243ks7rjgh8syeue8xg9xs/",
    "category": "Hypercasual",
    "tags": "2 Player Games, html5 games",
    "thumb": "https://img.gamemonetize.com/l9goa6cv46243ks7rjgh8syeue8xg9xs/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31775",
    "title": "Baby Doll Factory",
    "description": "Baby Doll Factory is another collecting-running arcade game. With 3D cute dolls, you can make baby dolls on the conveyor in this factory. About the whole production process, you can collect more basic dolls,shape them, choose their haircuts, decorate them with clothes, and put them into the boxes. The more dolls you make, the more money you will claim. I hope you can unlock your favorite skins.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/aw82s9ryjoi3zkr1b7herw4qpzpal2y7/",
    "category": "Racing",
    "tags": "running",
    "thumb": "https://img.gamemonetize.com/aw82s9ryjoi3zkr1b7herw4qpzpal2y7/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31774",
    "title": "Punball Puzzle",
    "description": "Its time for the sleeping mages to awaken! The magic continent is at stake, so as a member of the Mages Guild, you have the important task of resisting evil and saving the Mages continent. Here, you are going to fight against the evil army to the end, resisting their wave after wave of invasion. You need to attack the enemies, but it is important to note that you should upgrade your power. A little inattention and you could be all but wiped out and have to start all over again!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/6qasr4o29gxcmgnsy7y7m59uq16c1vc3/",
    "category": "Puzzles",
    "tags": "Magic",
    "thumb": "https://img.gamemonetize.com/6qasr4o29gxcmgnsy7y7m59uq16c1vc3/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31773",
    "title": "Puppy Friends Pet Dog Salon",
    "description": "Puppy Friends - Pet Dog Salon is a virtual pet game. Can you adopt this cute puppy? Do you like cute pet puppies? If yes, then this cute puppy is waiting for your care. You can take care of it by participating in its daily activities. You need to clean its dirty body and give it a bubble bath. Remove ticks and germs from your puppys body and keep your puppy safe. Brush the nails, cut, and polish the coat of your adorable puppy.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/qmwbx3bmszdab9wiuppg29nx6jofguoq/",
    "category": "Girls",
    "tags": "Cat, Cute",
    "thumb": "https://img.gamemonetize.com/qmwbx3bmszdab9wiuppg29nx6jofguoq/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31772",
    "title": "Asoka Makeup Indian Bride",
    "description": "Immerse yourself in the colorful world of the Indian wedding tradition with Princesses Jacqueline and Eliza! Help them create the perfect wedding look with the help of various cosmetics and accessories. Choose a wedding outfit; decorate your hair with traditional accessories and create a festive makeup for the bride. Use bright shadows, radiant blush and long-lasting lipstick to make the princesses look dazzling. Do not forget about the traditional jewelry: nath, earrings and necklace. Complete the image of an Indian bride and help the princesses become the most beautiful on the holiday!",
    "instructions": "Help two girlfriends create unusual version of the traditional Indian brides outfit The resulting images can be saved as a PNG image Depending on the gaming device a computer mouse click or a simple touch on touch screens is used to control it ",
    "url": "https://html5.gamemonetize.com/esoc5himb9hln9px80rb97y3x1x9mulu/",
    "category": "Girls",
    "tags": "Celebrity, Dress Up, Fashion, Hair, Makeover",
    "thumb": "https://img.gamemonetize.com/esoc5himb9hln9px80rb97y3x1x9mulu/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31771",
    "title": "Mermaidcore Makeup",
    "description": "In Mermaidcore Makeup, you ladies can step into the shoes of a talented makeup artist and work your magic on three stunning ladies. Journey into the realm of fantasy as you help these beauties achieve their perfect, enchanting looks. Prepare for a sensational trip filled with endless options as you explore an extensive selection of hairstyles, eyeshadows, mascara, lipsticks, face patterns, and intricate shoulder and neck patterns that perfectly match each girls unique style and personality.",
    "instructions": "Use your mouse to play this game on desktops or tap to play on mobile devices ",
    "url": "https://html5.gamemonetize.com/9jbvu7cag4juxvjsl3rbbktzv4zzv1h6/",
    "category": "Girls",
    "tags": "1 Player, Dress Up, Fashion, Makeover",
    "thumb": "https://img.gamemonetize.com/9jbvu7cag4juxvjsl3rbbktzv4zzv1h6/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31770",
    "title": "Gummy Letter Pop",
    "description": "Welcome to Gummy Letter Pop Game! Teddy Gummy Bears are falling from the sky and each on of them is holding a letter in its hands. Tap on the keyboard or mouse click on the letters in the bears hands before they reach the ground to collect more points. Can you get the highest score?",
    "instructions": "Phone or Tablet Tap or letters i keyboard Computer Use pc keyboard or mouse click",
    "url": "https://html5.gamemonetize.com/zfoiqfngu27bg3ncgewn753awga6cvsr/",
    "category": "Puzzles",
    "tags": "Baby, Baby Games, Clicker, Letters",
    "thumb": "https://img.gamemonetize.com/zfoiqfngu27bg3ncgewn753awga6cvsr/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31769",
    "title": "Boxes",
    "description": "Get into the whimsical world of Boxes! Guide a charming little green box through 20 captivating levels in this physics-based puzzle adventure. Your mission: find all the missing pearls scattered throughout each level. With intuitive controls and a delightful art style, Boxes challenges your problem-solving skills and reflexes. Navigate intricate mazes, overcome dynamic obstacles, and unlock secrets in a quest that&amp;rsquo;s perfect for players of all ages. Can you help the little green box restore the pearl treasure? Play now and find out!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/cou0r9bop7uaq69zjnscfjco8z8f30p6/",
    "category": "Hypercasual",
    "tags": "Arcade, Casual, HTML, jump, Jumping, mapi games",
    "thumb": "https://img.gamemonetize.com/cou0r9bop7uaq69zjnscfjco8z8f30p6/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31768",
    "title": " Puzzle World",
    "description": "Explore the world of puzzles with Image Puzzles of birds, animals, fruits, ice cream etc. If you are a puzzle lover, and love to find images download this game and start your journey towards a great puzzle world. There are many types of images like animals, fruits, cars, foods etc. present in this game and you have to drag and drop the correct image to solve the puzzle. If you like genres such as puzzle games, image puzzle games or just want to have a good time then this game is for you. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests",
    "instructions": "How to play Android Use On-Screen touch and drag PC Use Mouse Left Click to drag ",
    "url": "https://html5.gamemonetize.com/ybkmueg5b6f7v6vidmg19ymbsoqkxni5/",
    "category": "Puzzles",
    "tags": "2D, Casual, Matching, Puzzle",
    "thumb": "https://img.gamemonetize.com/ybkmueg5b6f7v6vidmg19ymbsoqkxni5/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31767",
    "title": "Jungle Jigsaw Fun",
    "description": "Enjoy the lush greenery and vibrant wildlife of the jungle with our jigsaw puzzle game. Piece together scenes featuring very cute animals and experience the charm and beauty of the wild from the comfort of your home!",
    "instructions": "Drag and drop the pieces to complete the puzzle Use the mouse or touchpad to move the pieces ",
    "url": "https://html5.gamemonetize.com/q96xxarfmmd3lk0u8wasvzf3gm25bv5s/",
    "category": "Puzzles",
    "tags": "Animal, HTML5, Jigsaw, jungle, Mobile, Puzzle",
    "thumb": "https://img.gamemonetize.com/q96xxarfmmd3lk0u8wasvzf3gm25bv5s/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "31766",
    "title": "Zombie Herobrine Escape",
    "description": "In our adventure, we need to escape in the best way possible to survive. Zombie Herobrine is chasing us, and we really need to get away from him. You must escape from that terrifying monster. Run from the zombie with your friend. The zombie is chasing you very quickly. Never look back and dont stop running. Be very careful on this obstacle course road. Watch out for the monsters, be careful. The monsters are advancing in a frightening manner everywhere. The monsters are chasing us; escape with your friend without dying and dont look back.",
    "instructions": " Move to WASD Arrow Keys Double Jump available Mobile Touch Control",
    "url": "https://html5.gamemonetize.com/u36310kvnlviswkawyb1wtcom7e6t1n7/",
    "category": "Arcade",
    "tags": "1 Player, 2 Player, 2 Player Games, 2D, Adventure, mineblock, Minecraft",
    "thumb": "https://img.gamemonetize.com/u36310kvnlviswkawyb1wtcom7e6t1n7/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31765",
    "title": "Reef Connect Challenge",
    "description": "Embark on an underwater adventure with Reef Connect Challenge! In this engaging puzzle game, youll dive into the vibrant world of coral reefs, drawing lines to connect two or more matching blocks. Each connection clears the blocks, making way for new ones to rise up from the ocean floor. With beautifully designed marine graphics and increasingly challenging levels, Reef Connect Challenge offers hours of addictive gameplay. Perfect for players of all ages, this game tests your planning, and creativity. Can you conquer the reef and become the ultimate Connect Master? Dive in and start your challenge today!",
    "instructions": "Draw lines to match 3 or more tiles",
    "url": "https://html5.gamemonetize.com/hpvcws2j0mjvlz8jiqebad7jk3qnlnv8/",
    "category": "Puzzles",
    "tags": "Draw, Logic, Match 3, Number, Puzzle",
    "thumb": "https://img.gamemonetize.com/hpvcws2j0mjvlz8jiqebad7jk3qnlnv8/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31764",
    "title": "World of Alice   Memory Game ",
    "description": "World of Alice - Memory Game is an enchanting educational game designed for children to boost their memory and logical thinking. Explore the whimsical world of Alice, filled with delightful challenges and colorful cards that will captivate young minds. Perfect for kids eager to have fun while developing essential cognitive skills. Excellent educational resource. Uncover the magic, match the cards, and watch your memory grow stronger with every play! In Alices World, learning is fun.",
    "instructions": "Click on the card corresponding to the image requested by Alice ",
    "url": "https://html5.gamemonetize.com/yxz5xdgg3mgo53m4lkoigavmbxnznf3a/",
    "category": "Puzzles",
    "tags": "Best Games, Cartoon, Cute, Educational, free games for your site, HTML5, Kids, Logic, Memory, Mobile, School, touchscreen, World of Alice",
    "thumb": "https://img.gamemonetize.com/yxz5xdgg3mgo53m4lkoigavmbxnznf3a/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "31763",
    "title": "Walkers Attack",
    "description": "Walkers Attack is an action-adventure game. The end of the world is coming, make your way through a world full of danger and survive! Experience non-stop action with auto-fire and strategic movement. Gather resources, defeat hordes of zombies, and complete missions to unlock new themed levels ranging from sci-fi to medieval and urban. As the levels increase, so does the challenge. Are you ready to embark on a survival adventure? Can you be humanitys last hope? Good luck!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/dh44famn4u2o274rck303nkfmyyx3i1k/",
    "category": "Shooting",
    "tags": "Shoot 'Em Up",
    "thumb": "https://img.gamemonetize.com/dh44famn4u2o274rck303nkfmyyx3i1k/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31762",
    "title": "3D FPS Target Shooting",
    "description": "3D FPS Target Shooting is an addictive 3D FPS game. The logic of the game is very simple, use your weapon to aim and shoot various targets to get higher scores. Simple and unique gun control experience, aiming and shooting at the targets can be done easily with one hand.Kar98k, M24, and AWM are amazing weapons you can unlock them using the coins you get from passing the levels. The game is completely free and you can play it online on any device!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/s7isvw59vx79rpt2zm4cuhinpq9gg60w/",
    "category": "Shooting",
    "tags": "Simulation",
    "thumb": "https://img.gamemonetize.com/s7isvw59vx79rpt2zm4cuhinpq9gg60w/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31761",
    "title": "Banana Farm",
    "description": "Embark on Banana Farm, an engaging business casual game catering to cat enthusiasts. As a diligent feline entrepreneur, oversee market operations and recruit adorable cat workers to enhance efficiency. Cultivate bananas and various products while serving charming cat customers eagerly queuing up. Ready to launch your supermarket?",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/lqd67h6ng8p38r7eo0i7ej5bnj3v7hhn/",
    "category": "Hypercasual",
    "tags": "Cat, Simulation",
    "thumb": "https://img.gamemonetize.com/lqd67h6ng8p38r7eo0i7ej5bnj3v7hhn/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31760",
    "title": "horror run",
    "description": "You have to escape from a terrifying abandoned psychiatric hospital full of monsters and traps. Can you make it out of this place?",
    "instructions": "Swipe up and down to move and jump or use the arrow keys and spacebar to avoid falling into the clutches of the monster ",
    "url": "https://html5.gamemonetize.com/aon38qogj8ua1bjjsl0ahnbfakf9uezs/",
    "category": "Arcade",
    "tags": "1 Player, 3D, 3D Games, Action, Adventure, Horror, running",
    "thumb": "https://img.gamemonetize.com/aon38qogj8ua1bjjsl0ahnbfakf9uezs/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31759",
    "title": "Garden Defense Zombie Siege",
    "description": "Garden Defense - Zombie Siege is a limited-shooting defense game with 2D cartoon animations. You can control a cannon to protect the garden from zombies at each level. You only need to control the crosshair with one button. All of the zombies will appear from 2 sides of the gate. I strongly suggest you shoot down the closest targets first than others. Although you have 3 hearts to start, you can only admit 2 hits from zombies.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/h2s2cf1xo2ka7eu035vpvftwxu2rfnax/",
    "category": "Hypercasual",
    "tags": "Plant, Tower Defense",
    "thumb": "https://img.gamemonetize.com/h2s2cf1xo2ka7eu035vpvftwxu2rfnax/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31758",
    "title": "Sonic Run for Lamborghini",
    "description": "Are you ready to join the excitement in Sonic Run for Lamborghini, an amazing and free-to-play online game designed for kids? In this thrilling adventure, youll guide the iconic Sonic as he races to the other side, collecting dazzling diamonds and aiming to buy a brand-new Lamborghini! Collect diamonds and work towards that ultimate Lamborghini prize. Avoid obstacles and have a blast in this high-octane adventure!",
    "instructions": "WAD and mouse to draw the line ",
    "url": "https://html5.gamemonetize.com/xv3cs723x7cvy4ldwcutugpr8gxdfwdr/",
    "category": "Hypercasual",
    "tags": "Arcade, Boys, Brain, Drawing, HTML5, Hypercasual, Kids, Logic, Physics, Puzzle",
    "thumb": "https://img.gamemonetize.com/xv3cs723x7cvy4ldwcutugpr8gxdfwdr/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31757",
    "title": "The Earth Evolution",
    "description": "The Earth: Evolution is a relaxing placement game. What does your fantasy planet look like? You can use beautiful objects to decorate and build your unique planet in different areas of the universe. Collect sunlight by placing buildings and when you have enough sunlight, you get more resources needed to build your planet. Escape from the stressful daily life for a few minutes or even longer!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/qlb5aqscbwnumk9h4o5fw3riwqx0xgrz/",
    "category": "Hypercasual",
    "tags": "Casual",
    "thumb": "https://img.gamemonetize.com/qlb5aqscbwnumk9h4o5fw3riwqx0xgrz/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "31756",
    "title": "Chibi Beauty Salon Dress Up And Spa",
    "description": "Do you want to be a real fashionista? If you do, this game will fulfill all your fashion dreams. The fun and charming game offers a wide variety of doll looks for all girls who love dress-up games. You can mix and match various outfits, hairstyles, magic wings, and accessories to create a unique look for your cute doll and enjoy hours of entertainment. With this anime dress-up maker, you can create your cute dolls and win beauty contests! What are you waiting for? Immerse yourself in this fashion dress-up makeover game for girls and become the most popular princess doll stylist.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/ptg684cswsszwquxarlomp6xmphh0pzr/",
    "category": "Hypercasual",
    "tags": "Dress Up",
    "thumb": "https://img.gamemonetize.com/ptg684cswsszwquxarlomp6xmphh0pzr/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31755",
    "title": "Fall Boys Ulimate Tournament 2024",
    "description": "Welcome to the Fall Boys Ultimate Tournament 2024! Step into a vibrant world filled with exhilarating challenges and fierce competition. Test your skills in a variety of whimsical mini-games that will push your agility and strategy to the limit. Whether youre dodging obstacles, racing against the clock, or working with teammates, aim to outlast and outperform your opponents. Website Developer &lt;a href='https://www.game-plays.com/'&gt;https://www.game-plays.com/&lt;/a&gt;",
    "instructions": "WASD to walk SPACE to jump ",
    "url": "https://html5.gamemonetize.com/nxl2ybhls0ev61j3bf9zzfmlwnjzwe58/",
    "category": "Action",
    "tags": "Best Games, Fall Boys, Fall Guys, Mentolatux, Multiplayer, run, running, unity games, WebGL",
    "thumb": "https://img.gamemonetize.com/nxl2ybhls0ev61j3bf9zzfmlwnjzwe58/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31754",
    "title": "Escape Wednesday",
    "description": "Break through the monsters to get out of the maze! Many labyrinths will not let you get bored. Show your abilities and you will be the winner. In Wednesday Escape, youll navigate through intricate mazes filled with challenging monsters. Each level presents unique obstacles that test your skills and strategy. Can you outsmart the creatures and find the exit?",
    "instructions": "Move mouse change direction",
    "url": "https://html5.gamemonetize.com/5fw8d2716dxf4t9semyy8pkkfmzpz0jh/",
    "category": "Action",
    "tags": "3D, Escape, Monster, Skill",
    "thumb": "https://img.gamemonetize.com/5fw8d2716dxf4t9semyy8pkkfmzpz0jh/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31753",
    "title": "Forest Tiles",
    "description": "There are several coins on the 9 by 9 playing field. It is necessary to place the blocks on the playing field in such a way as to completely assemble a vertical or horizontal line. Gold coins can be used to reset unnecessary blocks and continue the game if you lose.",
    "instructions": "Three blocks appear on the left of the playing field which must be placed on the playing field in order to assemble a horizontal or rotating line ",
    "url": "https://html5.gamemonetize.com/0kkzoff1kef939jnpk4gkg01dsj33fr8/",
    "category": "Puzzles",
    "tags": "Animal, Forest, Match 3, Puzzle, Tetris",
    "thumb": "https://img.gamemonetize.com/0kkzoff1kef939jnpk4gkg01dsj33fr8/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31752",
    "title": "Summer Spotlight Differences",
    "description": "Dive into Summer Spotlight Differences! Find all 5 differences in each level to advance, sharpen your observational skills, and enjoy endless spot-the-difference fun.",
    "instructions": "Mouse to play ",
    "url": "https://html5.gamemonetize.com/yfq2tnvnx4qn1juty1txz23wwt1fv8w6/",
    "category": "Puzzles",
    "tags": "Arcade, Boys, Brain, Difference, Girl, HTML5, Hypercasual, Kids, Skills",
    "thumb": "https://img.gamemonetize.com/yfq2tnvnx4qn1juty1txz23wwt1fv8w6/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31751",
    "title": "Adventure of Darius",
    "description": "Rescue Darius from the bad monster world Game story begins with the Darius and Witch collision, then the witch drags and throws him into a monster world. Player has to rescue and help to defend the monster world. Use your shooting skills and kill each monster to reach the next level. Be Careful! The monsters throw deadly spells, you have to avoid them. If you like genres such as adventure, action, rpg, platform, quests or just want to have a good time then this game is for you. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests",
    "instructions": "How to play Android Use On-Screen touch buttons to control the player PC Use Mouse Left Click to control the player ",
    "url": "https://html5.gamemonetize.com/vfwf3y19m8ul8naj4wbov2kloh425r3x/",
    "category": "Hypercasual",
    "tags": "2D, Adventure, Casual",
    "thumb": "https://img.gamemonetize.com/vfwf3y19m8ul8naj4wbov2kloh425r3x/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31750",
    "title": "Extreme Huggy",
    "description": "Huggy needs to survive. Help Huggy and ensure he reaches the finish line. Do everything you can to get him into the black portal at the finish line. The area is full of obstacles: spinning gears descending from above and traps on the ground. Reach the portal safely without dying. Remember, the time is slowly running out, so you must hurry and reach the portal without hitting any obstacles before the time runs out.",
    "instructions": " You can move by pressing the WASD keys The game features double jumping Reach the portal before time runs out ",
    "url": "https://html5.gamemonetize.com/gijrsk71539wdzkuln0a6fjzrv06vcr6/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade, Arena, Battle, Platform",
    "thumb": "https://img.gamemonetize.com/gijrsk71539wdzkuln0a6fjzrv06vcr6/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31749",
    "title": "Stick Bros Leave Prison",
    "description": "Stick Bros Leave prison is the latest installment in the stickman jail series, where you get to control not one but two individuals. Finding the proper colored keys to open the door is your objective as you lead them to the levels end. Staying one step ahead of the guards is the goal. Unlock better skins by collecting money scattered across the level. Leap and dodge obstacles to make it to your destination safely as you navigate the game.",
    "instructions": "INSTRUCTIONS Find the key to change characters so you can move and get to the exits on time the goal is to get all the stick figures to the door Every single stickman jail game is available right now on Kiz10 for free online play To move and leap use",
    "url": "https://html5.gamemonetize.com/tydglseu5zkccaej7e99is984cam6y3a/",
    "category": "Adventure",
    "tags": "Escape, kiz10, Prison, Stickman",
    "thumb": "https://img.gamemonetize.com/tydglseu5zkccaej7e99is984cam6y3a/512x384.jpg",
    "width": "900",
    "height": "550"
  },
  {
    "id": "31748",
    "title": "Mask Evolution 3d",
    "description": "Mask Evolution 3D is a parkour game. Move the masks through digital gates to boost the value of your mask. You can also collect decorations and attendants to make your mask even more artistic. Finally, auction your masks to sell them for a high price and earn more money. Please note,be careful of obstacles such as spikes on the road, they will devalue your mask and you will fail when your mask value is 0. Get ready for an exciting journey to make your very own mask!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/mezo4j4irn5cf2sn6bgog9aydcv8oola/",
    "category": "Racing",
    "tags": "Racing, running",
    "thumb": "https://img.gamemonetize.com/mezo4j4irn5cf2sn6bgog9aydcv8oola/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31747",
    "title": "Thats Not My Neighbor 2",
    "description": "Thats Not My Neighbor is a detective puzzle game. You are going to be the new janitor in this building when you are watching the tutorial video. Your job is to determine if the person who wants to enter the building is a monster. The monsters can transform into anyone and imitate them. Some monsters are not good at imitation and may develop flaws. You have no choice but to pay attention to the image of your neighbors. At the same time, remember to fill out checklists for each neighbor.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/1a9za56ujfca9ykgy3i7j2jvzizwog2w/",
    "category": "Puzzles",
    "tags": "1 Player, Horror, Puzzle",
    "thumb": "https://img.gamemonetize.com/1a9za56ujfca9ykgy3i7j2jvzizwog2w/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31746",
    "title": "Dressup Yoga Girl Makeover",
    "description": "This is a fascinating dress-up online game. All the girls envy your healthy and attractive body.Everyone is fascinated by your smooth lines and perfect muscles. It is yoga and exquisite skincare which makes you so outstanding. However, just doing yoga is not enough. Skincare products, make-up, and gorgeous outfits add to your beauty. We have prepared everything for you. In our game, you may experience the make-up process before yoga, carefully choose your clothes, and be a professional yoga girl. At the end, you may take photos to commemorate your beautiful dress up. Come and join us and become a yoga beauty.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/drtzz4dx76rppyapefmgmcvdpo6ziwo5/",
    "category": "Hypercasual",
    "tags": "Dress Up",
    "thumb": "https://img.gamemonetize.com/drtzz4dx76rppyapefmgmcvdpo6ziwo5/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31745",
    "title": "MCCraft   2 Player",
    "description": "In this adventure, the boy in the blue shirt and the girl in the green shirt need to find the chests. They must find the chests and reach the portal. Our adventure is very dangerous and challenging, with monsters everywhere. The monsters are very powerful, but you can defeat them. To defeat them, you need to jump on them and crush them. Dont forget to collect all the coins. Collect all the coins, find the chests, and reach the portal. Both players must reach the portal. Reach the portal to move to the next level.",
    "instructions": " Played with WASD Arrow Keys Mobile touch control is available Find the chests and collect all the coins",
    "url": "https://html5.gamemonetize.com/cryy20n9i7kgkftfcttlvl731wf1lgah/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade, mineblock, Minecraft, Pixel",
    "thumb": "https://img.gamemonetize.com/cryy20n9i7kgkftfcttlvl731wf1lgah/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31744",
    "title": "Board Kings Board Dice",
    "description": "Board Kings: Board Dice is a classic multiplayer strategy board game. Do you like to play Monopoly,Board Kings: Board Dice is similar to Monopoly. Become the real Board King by building and upgrading your empire with dice points, building and upgrading your board, or infiltrating other players boards and attacking their buildings. This is a game where luck and strength go hand in hand to win,how is your luck today? Join us for more surprises waiting to be unlocked!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/qylq7h9zvv6fm2qrr9e8yprpc0opdhjd/",
    "category": "Multiplayer",
    "tags": "Simulation",
    "thumb": "https://img.gamemonetize.com/qylq7h9zvv6fm2qrr9e8yprpc0opdhjd/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31743",
    "title": "Timeless Trimble",
    "description": "Explore the world of action with a smooth simulation and gameplay of &amp;lsquo;Timeless Trimble&amp;rsquo;.Be aware of the obstacles.In the gameplay you have to deal with different enemies in each level .You can attack and destroy the enemies with your Arrow.Watchout for the fireball which is falling down from the above .If the fireballs touches you You will lead to death.If your body touches the enemy you will die. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests",
    "instructions": "How to play Android Press LEFT RIGHT arrow key to move Left Right Press the UP arrow key to JUMP Press Arrow Signed key just above the UP arrow key to Attack PC Use LEFT arrow key to move LEFT Use RIGHT arrow key to move RIGHT Use UP arrow key to ",
    "url": "https://html5.gamemonetize.com/4l69w5f6do7700kjnbxijczsdih9ontn/",
    "category": "Hypercasual",
    "tags": "2D, Adventure, Casual, Platform",
    "thumb": "https://img.gamemonetize.com/4l69w5f6do7700kjnbxijczsdih9ontn/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31742",
    "title": "Jungle Fight",
    "description": "In Jungle Fight players control an army of animals to overpower the opposing players forces. The goal is to deplete the opponents health by strategically using the unique abilities of various animals in combat. Players must navigate the jungle environment, making tactical decisions to ensure their army dominates the battlefield and emerges victorious.",
    "instructions": "Start the Game Open the game link and load the game Select a Skill Choose the skill you want to deploy and Tap on lane to deploy Deploy Animals Select and tap on a lane to release the chosen animal skill onto the board ",
    "url": "https://html5.gamemonetize.com/xhx7z1mr85op97320i18awkx4837z316/",
    "category": "Multiplayer",
    "tags": "1 Player, Adventure, amazing, Best Games, Fighting, free games for your site, free games for your website, free html5 games for your website, Game, Games, html games for your website, HTML5, html5 games, Strategy",
    "thumb": "https://img.gamemonetize.com/xhx7z1mr85op97320i18awkx4837z316/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31741",
    "title": "Too Fit Too Fat",
    "description": "Welcome to Too Fit Too Fat hypercasual game! Tap or mouse click to start walking and choose the right door to make the princess no too fit not too fat so she can jump over the barriers. Enjoy this game on Gamemonetize.com",
    "instructions": "Tap or mouse click to play ",
    "url": "https://html5.gamemonetize.com/vj5lzi5p9m8wn5k6fud7ntwygaj4hdnr/",
    "category": "Hypercasual",
    "tags": "Dress Up, Girl, Girls, Hypercasual, run, running",
    "thumb": "https://img.gamemonetize.com/vj5lzi5p9m8wn5k6fud7ntwygaj4hdnr/512x384.jpg",
    "width": "350",
    "height": "600"
  },
  {
    "id": "31740",
    "title": "Ricochet Shield",
    "description": "Ricochet Shield challenges players to deflect projectiles using a high-tech shield, strategically bouncing shots to defeat enemies and navigate treacherous mazes. With each level increasing in complexity, players must master angles and timing to survive. Upgradeable shields and diverse environments keep the action intense, offering both single-player challenges and multiplayer showdowns. Prepare for a thrilling blend of strategy and reflexes as you embark on this futuristic adventure where precision and quick thinking are your greatest assets. Website Developer &lt;a href='https://www.coolcrazygames.com/'&gt;https://www.coolcrazygames.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/dczltolczueado06v3d2js9pgdaxkgk1/",
    "category": "Arcade",
    "tags": "Action, Android, Arcade, Battle, HTML5, iPad, iPhone, Mobile, Shooting, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/dczltolczueado06v3d2js9pgdaxkgk1/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31739",
    "title": "Counter Craft: Battle Royale",
    "description": "Counter Craft: Battle Royale is a first person shooter game which features blocky zombie shooting and gun searching across vast map. Your mission is to survive and shoot 100 zombies in order to win.",
    "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump F - Use C - Crouch ",
    "url": "https://html5.gamemonetize.com/py4pbr4l63jb6l3dtxcjyuhi1uqtxrep/",
    "category": "Shooting",
    "tags": "3D, 3D Games, Battlegrounds, First Person Shooter, Gun, Minecraft, Shoot, Shoot 'Em Up, Shooter, Shooting, Unity3D, Zombie",
    "thumb": "https://img.gamemonetize.com/py4pbr4l63jb6l3dtxcjyuhi1uqtxrep/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "31738",
    "title": "Hill Climb Truck Transform Adventure",
    "description": "Hill Climb: Truck Transform Adventure is actually a 2D balance stunt adventure game. You have 3 kinds of vehicles to transform and overpass different terrains. While keeping the vehicle balanced, you can climb different ramps and terrains. If you crash obstacles or terrains, you can collect repair plates to recover. If you want to overpass the next harder levels, you can upgrade your vehicles with 4 acceleration abilities. &lt;a href='https://www.cargames.com/'&gt;https://www.cargames.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/w3o8dtti3pzcht3v88dme2xcswu8qci4/",
    "category": "Arcade",
    "tags": "Racing, Truck",
    "thumb": "https://img.gamemonetize.com/w3o8dtti3pzcht3v88dme2xcswu8qci4/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31737",
    "title": "Crazy Mafia Drift Car",
    "description": "Customise your mafia car to perfection and conquer the streets with style. Explore a vast cityscape where every corner holds the promise of heart-pounding drifts. Put your skills to the ultimate test in the Drift Trial, where youll have to master the art and racking up points with each smoky, screeching turn. With a pulsating soundtrack and mafia vibe, this game invites you to become a legend in the city drift scene.",
    "instructions": "Movement W A S D or ARROW KEYS Handbrake SPACEBAR Repair Car R Change Camera C Pause Menu ESCAPE Toggle Music M ",
    "url": "https://html5.gamemonetize.com/cbltsck8dzy2mk733mdot1mlsa6hevju/",
    "category": "Racing",
    "tags": "1 Player, 3D, Action, Boys, Cars, city, Crazy, drift, Driving, Race, Racing",
    "thumb": "https://img.gamemonetize.com/cbltsck8dzy2mk733mdot1mlsa6hevju/512x384.jpg",
    "width": "900",
    "height": "600"
  },
  {
    "id": "31736",
    "title": "Crazy golf III",
    "description": "Crazy Golf III is like a real golf played on the hills. The game consists of 23 levels that at first sight seem very easy. All levels are different and if you need help, click the settings button from the left upper.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/4it2xf7jelch1pscwiuvd359l3x2rabk/",
    "category": "Sports",
    "tags": "1 Player, Action, Golf",
    "thumb": "https://img.gamemonetize.com/4it2xf7jelch1pscwiuvd359l3x2rabk/512x384.jpg",
    "width": "640",
    "height": "360"
  },
  {
    "id": "31735",
    "title": "Grimage Wall Breaker",
    "description": "Take on the challenge in Grimace Wall Destroyer! Control your grimace character and focus on destroying walls by clicking to speed up. Navigate through levels, smashing walls strategically to reach your destination. With each level posing new obstacles and puzzles, showcase your skills and determination to conquer all challenges. Can you demolish every wall and emerge victorious? Website Developer &lt;a href='https://www.game-plays.com/'&gt;https://www.game-plays.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/wbebjp7c8sfc5qyi4zf74j8ozskpvv0z/",
    "category": "Action",
    "tags": "Action, Click, destroying, Grimace, Grimace Shake, run, running, unity games, WebGL",
    "thumb": "https://img.gamemonetize.com/wbebjp7c8sfc5qyi4zf74j8ozskpvv0z/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31734",
    "title": "Long Hair Princess Salon",
    "description": "This is a princess make-up game designed for girls. The princess is getting married, lets make up for her. Choose a beautiful dress for her and do a spa for her. You can wash her hair and do a facial spa for the princess. The game has a lot of make-up tools, you can freely choose different tools to make up. You will be dazzled by many fashionable outfits such as dresses, earrings, and high heels. You can also choose your favorite hairstyle and color. The most important thing is that you can take photos after dressing up. &lt;a href='https://www.babygames.com/'&gt;https://www.babygames.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/nr2nulg0r37m91mfsd7oudwrxafoih4v/",
    "category": "Girls",
    "tags": "Makeover",
    "thumb": "https://img.gamemonetize.com/nr2nulg0r37m91mfsd7oudwrxafoih4v/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31733",
    "title": "Animal Saver",
    "description": "Animal Saver is a fun bubble shooter game suitable for all ages. It offers endless entertainment and relaxation with smooth gameplay and challenging puzzles. Pop colourful animal bubbles in a vibrant world. Its easy to learn and family-friendly, providing both relaxation and excitement. Just aim, match, and pop the balls for a simple and intuitive gaming experience perfect for families! Features of this game: High Quality graphics will leave only positive feedback Game size is minimal (but not compromised the graphics) and it is good for your device health Super simple controls make it easy to start playing",
    "instructions": "How to play Android Touch to Aim and release to smash PC Hold Mouse Click to Aim and release to smash ",
    "url": "https://html5.gamemonetize.com/zesc9vypdtqy5vjqmehnkkm7urf4pmpv/",
    "category": "Shooting",
    "tags": "2D, Bubble Shooter, Casual, Matching, Shooting",
    "thumb": "https://img.gamemonetize.com/zesc9vypdtqy5vjqmehnkkm7urf4pmpv/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31732",
    "title": "Mini Games Relax Collection",
    "description": "Mini Games: Relax Collection is a stress-relieving game. The game contains five mini-games: Clean Makeup, Fix Teeth, Shave, Left/Right 1 and 2. The game requires no skill and is easy to play for all ages! Free your brain from the stress and anxiety of tedious work and let you experience endless peace and happiness, sweeping away all your worries! Whats the hesitation? &lt;a href='https://www.puzzlegame.com/'&gt;https://www.puzzlegame.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/3e08ao2jl2vyvlsvfi86yibatr79f3uk/",
    "category": "Puzzles",
    "tags": "Cleaning",
    "thumb": "https://img.gamemonetize.com/3e08ao2jl2vyvlsvfi86yibatr79f3uk/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31731",
    "title": "Bubble Blitz Galaxy",
    "description": "Welcome to Bubble Blitz Galaxy! Aim and shoot bubbles towards similar ones to collect them while ensuring they stay away from the borderline. Experience two exciting modes: In Arcade Mode, strive to survive as long as possible and score as much as you can. In Challenge Mode, survive and achieve target scores, facing new challenges one after another. Get ready for an exhilarating bubble-blasting adventure!",
    "instructions": "Use a mouse or touchpad to aim and shoot bubbles towards similiar ones to collect them while ensuring they stay away from the borderline ",
    "url": "https://html5.gamemonetize.com/6t5rjvvmwkso20sq7hpbvyfoxvxwrlfp/",
    "category": "Puzzles",
    "tags": "Bubble, Bubble Shooter, HTML5, Mobile, Point And Click, Shooter",
    "thumb": "https://img.gamemonetize.com/6t5rjvvmwkso20sq7hpbvyfoxvxwrlfp/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "31730",
    "title": "Kitty Maze",
    "description": "Kitty Maze is filled with Fun and enjoyment. &amp;lsquo;Kitty Maze&amp;rsquo; is an engaging and interesting game full of fun.It will test your gaming skill to overcome the hurdle and complete the level. Main object of this game is to pass the cat from one point to another.During crossover the path is blocked by wood log.The player has to shift the wood log and make the way to pass the cat.If you not able to shift the wood log ,you will not be able to complete the level. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests.",
    "instructions": "How to play Android Touch on the object to move PC Use Mouse on the object to move ",
    "url": "https://html5.gamemonetize.com/ukem7nnalwoix13pe80j52yu9gk3en7c/",
    "category": "Puzzles",
    "tags": "2D, Casual, Puzzle",
    "thumb": "https://img.gamemonetize.com/ukem7nnalwoix13pe80j52yu9gk3en7c/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31729",
    "title": "Jumping Boxes",
    "description": "Help the colored Jumping Boxes navigate through the hurdles they encounter in this dismal, gray, and shadowy world... The gameplay is incredibly straightforward &amp;ndash; just tap or touch the screen to leap and evade a multitude of obstacles such as blades, spikes, and creatures of the night! Strive to collect as many items as you can and set your personal best record! Its a game thats both simple and challenging, guaranteed to keep you hooked! The dark ambiance will captivate you, and youll find yourself enamored with this petite yet remarkable masterpiece!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/qmej8ak3nulzzpncas0bhpye3jie5kz5/",
    "category": "Hypercasual",
    "tags": "Clicker, HTML5, Hypercasual, jump, Jumping, mapi games, Mobile",
    "thumb": "https://img.gamemonetize.com/qmej8ak3nulzzpncas0bhpye3jie5kz5/512x384.jpg",
    "width": "600",
    "height": "1024"
  },
  {
    "id": "31728",
    "title": "Idle Bank",
    "description": "Idle Bank is not merely a management game but also a simulation game. With 3D stickman characters in a bank, you can control the manager to develop a bank. First, you can use the starting money to unlock a basic Reception to absorb customers. When people come into the bank and save their money here, you can take away them to unlock new facilities and hire assistants. Dont forget to upgrade your character for better capacity ability and higher speed. &lt;a href='https://www.bestgames.com/'&gt;https://www.bestgames.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/l0e77g0z0zeo9ivsk2dacqzeppruin2n/",
    "category": "Clicker",
    "tags": "Simulation",
    "thumb": "https://img.gamemonetize.com/l0e77g0z0zeo9ivsk2dacqzeppruin2n/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31727",
    "title": "Zombie World Rogue",
    "description": "In a survival game, players need to protect the rear core, unlock super futuristic weapons, and have supernatural abilities to resist zombie attacks.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/mriu6lvde034jbz0tv93aoazr9dg97rv/",
    "category": "Adventure",
    "tags": "1 Player, 3D, 3D Games, Adventure, Alien, amazing, Gun, Monster, Shooter, Zombie",
    "thumb": "https://img.gamemonetize.com/mriu6lvde034jbz0tv93aoazr9dg97rv/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31726",
    "title": "Block Craft 3d 2",
    "description": "Block Craft 3D is a first-person RPG game with 3D pixel Minecraft models. Starting from a block base, you can attack the monsters outside to claim diamonds with weapons. I strongly suggest you build bombs to destroy terrains or build blocks to make yourself safe. When you earn enough diamonds, you can unlock and use 4 Melee weapons, 11 guns, and 8 bombs in the store. Glad you will have a good time in this block world.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/b12tpl9hyn1zh9yuj8vyyjj3b0z74rrj/",
    "category": "Shooting",
    "tags": "Minecraft, Shooting",
    "thumb": "https://img.gamemonetize.com/b12tpl9hyn1zh9yuj8vyyjj3b0z74rrj/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31725",
    "title": "HOLDEM CARD GAME",
    "description": "** HOLDEM CARD GAME is A FREE-TO-PLAY ONLINE H5 GAME. * HOLDEM CARD GAME is the online Texas Holdem game that allows you to play poker games with millions of real players, on the most fun and exciting play money poker game out there. * Texas Hold&amp;rsquo;em poker is one of the most popular poker variants in the world. Despite its relative simplicity, Texas Hold&amp;rsquo;em has the potential to be played with a seemingly infinite variety of strategies and tactics. ** HOLDEM CARD GAME lets you: * PLAY CARD GAME ONLINE WITH MILLIONS OF REAL PLAYERS ~ Play online poker games with the world&amp;rsquo;s largest community of real poker players.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/sue3asusesjn6i2ty9ljk20yfqmbrs8k/",
    "category": "Multiplayer",
    "tags": "Board, Card, gambling, Multiplayer, Online, Poker",
    "thumb": "https://img.gamemonetize.com/sue3asusesjn6i2ty9ljk20yfqmbrs8k/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31724",
    "title": "Archery legends",
    "description": "Welcome to Archery Shooter Range, the ultimate web game for archery enthusiasts. Experience two thrilling modes: Classic Mode, set in an archery range stadium with challenging obstacles, and Adventure Mode, where youll test your skills against dynamic animal targets in a jungle setting. Enjoy realistic physics, stunning graphics, and competitive leaderboards. Whether youre practicing or competing, Archery Shooter Range offers endless fun and challenge. Join now and become a master archer!",
    "instructions": "Aim Tap and hold to aim at your target Adjust your aim to ensure accuracy Shoot Release to shoot your arrow Control Keep the direction of the wind in mind to control the direction of your arrow Adjust your aim accordingly to compensate for any wind",
    "url": "https://html5.gamemonetize.com/i5874tp87atboegughahctutv036l0a5/",
    "category": "Shooting",
    "tags": "1 Player, Adventure, arrows, Casual, Puzzle, Shooting, Strategy",
    "thumb": "https://img.gamemonetize.com/i5874tp87atboegughahctutv036l0a5/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31723",
    "title": "Crazy Room 3D",
    "description": "Create your puzzle logic room with Crazy Room. Enjoy a new style of play with great puzzle logic. Puzzle your next room.Combine objects to discover new and fascinating items.",
    "instructions": "Mouse click or tap to play HOLD AND DRAG AND DROP",
    "url": "https://html5.gamemonetize.com/2kc0vc8stti2z50wdz0gqup8g3p886o3/",
    "category": "Puzzles",
    "tags": "Action, Casual, House",
    "thumb": "https://img.gamemonetize.com/2kc0vc8stti2z50wdz0gqup8g3p886o3/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31722",
    "title": "Pinball Legends",
    "description": "Dive into a summer adventure with our beach-themed pinball game! The vibrant board features an ocean backdrop, golden sands and glistening turquoise waves. Bumpers shaped like beach balls, and Fishes in sea enhance the fun. Enjoy a lively tropical soundtrack. This game combines classic pinball thrills with the relaxing feel of a day at the beach for endless fun year-round. Key features of games are Oceanic Theme Based elements, Engaging sound track and Gameplay that always wants you to play again.",
    "instructions": "Tap Mouse click on Left side of the screen to move left paddles Tap Mouse click on on Right side of the screen to move right paddle Hold near ball spawn point to Launch and start the game ",
    "url": "https://html5.gamemonetize.com/8j6wxtrmfcpdjz300i57ycguoa7bxr39/",
    "category": "Hypercasual",
    "tags": "1 Player, 2D, amazing, Best Games, Game, Games, html5 games for your site, Pinball",
    "thumb": "https://img.gamemonetize.com/8j6wxtrmfcpdjz300i57ycguoa7bxr39/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31721",
    "title": "Javelin Battle",
    "description": "Javelin Battle is a spear-throwing physics puzzle game with 2D stickman models. We need you to eliminate all incoming enemies at each level in the Normal Mode. When you destroy enemy infantrys shields, they will run to you quickly. I strongly suggest you destroy the enemy spearmen on the platforms first. Dont forget to choose skills to increase your abilities and power. Keep calm and aim carefully.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/a006nqrea1p11ps579qsfeljddvark7m/",
    "category": "Fighting",
    "tags": "1 Player, Battle",
    "thumb": "https://img.gamemonetize.com/a006nqrea1p11ps579qsfeljddvark7m/512x384.jpg",
    "width": "1136",
    "height": "640"
  },
  {
    "id": "31720",
    "title": "Ludo King Dice Club",
    "description": "You want relax in your spare time? Lets have a relaxing game of Ludo King Dice Club, which is a classic board game. You&amp;nbsp; roll the dice to move the pieces on the board. When all the pieces reach the corresponding color of the centerboard, therefore you could win. The game supports multiplayer mode. You can invite your families or friends to play together or make new friends.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/1oblt7mlkg4gjwls77sg5mahwy5bugb5/",
    "category": "Puzzles",
    "tags": ".io Games, airplane",
    "thumb": "https://img.gamemonetize.com/1oblt7mlkg4gjwls77sg5mahwy5bugb5/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31719",
    "title": "Magic Highschool Love Story",
    "description": "Hailey is the daughter of the Wicked Witch. Shes a cool, bad girl just like her mum. She will attend the prestigious Heirloom High School to study magic this year. The Snow Queen founded this high school to provide the best education for all talented kids. Today is Haileys first day of school and you have to help her make up, dress up, and fix the wings on her hands. The game has super cool dark make-up, use your imagination to decorate her eyes and mouth. Fashionable evil-style outfits will make you the coolest queen in the school. Come and join the mesmerizing world of the game.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/u4vxghiq11ty1v3c4isytogciqy6ln9b/",
    "category": "Hypercasual",
    "tags": "Educational, School",
    "thumb": "https://img.gamemonetize.com/u4vxghiq11ty1v3c4isytogciqy6ln9b/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31718",
    "title": "My Twin Dolphin Baby Care",
    "description": "My Twin Dolphin Baby Care is a caring game. In this game, you will be a keeper in the oceanarium to care for two cute little dolphins. As a keeper, you not only have to play with the little dolphins, but you also have to feed them, help them bathe, and treat their illnesses. Not only can you take care of the little dolphins emotions, but you can also heal your own heart through this heartwarming game. This game also has smooth animations and bright colors, which are very suitable for little girls to play. Come and try it!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/9zj44lx2v793ye7hpnrvawwuxu1s9amc/",
    "category": "Hypercasual",
    "tags": "Car, Educational",
    "thumb": "https://img.gamemonetize.com/9zj44lx2v793ye7hpnrvawwuxu1s9amc/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31717",
    "title": "Wars Ships.io",
    "description": "Set sail in Wars Ships.io, where players navigate the seas, engage in thrilling ship-to-ship combat, and strive to conquer the waters. Maneuver your vessel strategically, aim cannons accurately, and outmaneuver opponents to secure victory in each round. With each battle presenting new challenges and opportunities for tactical mastery, can you dominate the high seas and become the ultimate naval commander? Website Developer &lt;a href='https://www.kizi10.org/'&gt;https://www.kizi10.org/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/usz9gt1ag3jrfo42phs37ld1mgbzr0ax/",
    "category": "Action",
    "tags": ".io, .io Games, battleship, Mentolatux, ship, ships, Unity3D, War, WebGL",
    "thumb": "https://img.gamemonetize.com/usz9gt1ag3jrfo42phs37ld1mgbzr0ax/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31716",
    "title": "Wood Bolts Nuts Screw Pin Puzzle",
    "description": "Pin master: Screw puzzle quest &amp;amp; brain games challenges your problem-solving skills in a captivating pin puzzle adventure. Strategically tap to unlock screw holes on products, guiding metal plates to fall in the correct sequence. Navigate through intricate mazes of nuts, bolts, and plates. With each level presenting new challenges, immerse yourself in over 100 brain-teasing stages. Need a hint? No problem! Utilize the hint feature or remove random screws to progress. Download now for free and embark on a journey of clever solutions and endless fun!",
    "instructions": "Tap to unlock the screw holes on the product to make the metal plate fall Think carefully before making a decision Keep on thinking and trying until you hit on the solution Click button whenever you need hints or remove random screws",
    "url": "https://html5.gamemonetize.com/npqfco1jskcfh867v9tg8o63udlepk9j/",
    "category": "Puzzles",
    "tags": "Arcade, Brain, Cartoon, Casual, Educational, Hypercasual, Logic, Logical, Physics, Puzzle",
    "thumb": "https://img.gamemonetize.com/npqfco1jskcfh867v9tg8o63udlepk9j/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31715",
    "title": "zoo Animal Transport Game",
    "description": "Play and enjoy the animals transport games creature wild animal truck games and became wild creature transporter driver. Zoo animal transporter truck games &amp;lsquo;traffic rules and drive carefully on public streets so as not to disturb the flow of traffic. Here in jungle games and animal truck driving games, you are up as a freight transporter on a major load transport truck in animal transport truck game. The gaming mode off-road animal transport offers you farm animal cargo truck which possesses all your desired features make your stay in hungry farm animal cargo transport truck zoo animal dinosaur truck transports in current wild animal games.",
    "instructions": "use keyboard arrows and space button to control the animals and vehicles",
    "url": "https://html5.gamemonetize.com/qiggc81ft15jdw2bckyjvl1g9wev00zm/",
    "category": "Adventure",
    "tags": "Action, Adventure, Animal, BMX, buggy, Classic, Dinosaur",
    "thumb": "https://img.gamemonetize.com/qiggc81ft15jdw2bckyjvl1g9wev00zm/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31714",
    "title": "colorcandy sort puzzle",
    "description": "Welcome to our addictive and fun ball sort color puzzle game! If youre looking for a game that challenges your brain and keeps you entertained for hours, youve come to the right place. Youll never get bored. Our game is perfect for those who enjoy brain teasers, puzzles, and games that challenge their cognitive skills. Our game is a breeze. Simply drag and drop the same color balls to their corresponding bottle and witness the colorful balls Collection successful, creating a visually satisfying experience with every completed level.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/t87l93g5lxqtmshh6bm16nt03c1ooxxf/",
    "category": "Puzzles",
    "tags": "1 Player, Candy, Cartoon, Color, Online, sort",
    "thumb": "https://img.gamemonetize.com/t87l93g5lxqtmshh6bm16nt03c1ooxxf/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31713",
    "title": "Roller 1",
    "description": "Roller 1 is a simple ball plat-former with a lot of levels! roll your way through all the levels! stay tuned for daily updates as more levels are released each day!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/d2963kkt5ne5c439a89rhrdf8w6l175u/",
    "category": "Puzzles",
    "tags": "3D, Arcade, Hypercasual",
    "thumb": "https://img.gamemonetize.com/d2963kkt5ne5c439a89rhrdf8w6l175u/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31712",
    "title": "Traffic Speed Racing",
    "description": "In the game Traffic Speed Racing, we together with a young guy will take part in races with obstacles. These can be mines, pits and other hazards. You sat behind the wheel of the car will have to fly on the highway at the maximum possible speed and meet in a strictly allotted time. All obstacles you will have to pass by at speed. Also on the road can be bonus items.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/6k1vsgz4c5smpeo6ibnhha3o4wexkyrf/",
    "category": "Racing",
    "tags": "Avoid, Cars, Driving, Mobile, Obstacle, Race, Rocket, Skill",
    "thumb": "https://img.gamemonetize.com/6k1vsgz4c5smpeo6ibnhha3o4wexkyrf/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31711",
    "title": "Buddy Rescue",
    "description": "Main object of this game is Rescuing Bruno.Hence Jackson went for the rescue.During crossover the player has face many obstacles such as spikes,hanging round weapon ,rotating blade and others anonymous objects.If the player collide mistakenly with those object the player will die and the level will over.Apart from The player has to face Unexpected Enemies and creatures . You can go to the next level only by overcoming all the hurdles.If a player falls down from the platform, the game will be over. So be wise and control your player as required. Features of this game: High Quality graphics Game size is minimal Super simple controls",
    "instructions": "How to play Android Press the DOWN arrow key on the Left side of the screen to SLIDE Press the UP arrow key on the Right side of the screen to JUMP PC Use the DOWN arrow key on the Left side of the screen to SLIDE Use the UP ar",
    "url": "https://html5.gamemonetize.com/4hwmedfl55qf0d6j8u1kxnwzl5pemyve/",
    "category": "Hypercasual",
    "tags": "2D, Adventure, Casual, Platform, survival",
    "thumb": "https://img.gamemonetize.com/4hwmedfl55qf0d6j8u1kxnwzl5pemyve/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31710",
    "title": "Noob vs Hacker Gold Apple",
    "description": "In this adventure, we must eat the golden apple. By eating the golden apple, we will gain more strength. Be careful, if youre not cautious, you might eat a poisoned golden apple and shrink in size. Catch the golden apples and aim to have the highest score before time runs out. Compete with your friend and win this game. Catch and eat the most golden apples in this fun race. May your height grow the most, and may you win the game.",
    "instructions": " Press the S key or the Down Arrow key to push or hit The player with the most points in 120 seconds wins Use the WASD keys or the Arrow keys to move ",
    "url": "https://html5.gamemonetize.com/v1gnx9ksj59xuahx4e9kt94qbu5224jw/",
    "category": "Arcade",
    "tags": "1 Player, 2 Player, 2 Player Games, 2D, Arcade, Battle, mineblock, Minecraft",
    "thumb": "https://img.gamemonetize.com/v1gnx9ksj59xuahx4e9kt94qbu5224jw/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31709",
    "title": "Reef Color Challenge",
    "description": "Dive into the vibrant underwater world of Reef Color Challenge! In this fast-paced logic game, you control a single block, navigating it horizontally above a stack of colorful blocks. Each turn, your block can changes, and your goal is to match it with a block of the same color below. When you align them, the row disappears, and the blocks below rise up, presenting a new challenge. Test your reflexes and strategy as you race against the clock to clear as many rows as possible. Can you conquer the depths and become the ultimate Reef Color Champion? Dive in and find out!",
    "instructions": "Touch in the columns to move the tile and match them ",
    "url": "https://html5.gamemonetize.com/ah9d6mf6bakfpyic6psh7p4wbgqz65pk/",
    "category": "Puzzles",
    "tags": "Adventure, Casual, Puzzle",
    "thumb": "https://img.gamemonetize.com/ah9d6mf6bakfpyic6psh7p4wbgqz65pk/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31708",
    "title": "Merge TikTok Gravity Knife",
    "description": "This is an addictive elimination merge puzzle game. If you like synthetic elimination games, then this game is for you. They can remove a portion of the weapons that didnt merge, but theres only one free shot. Be careful, you have to score as many points as possible within the time limit, otherwise, you will have to start another game. Now join the challenging world of the game. &lt;a href='https://www.puzzlegame.com/'&gt;https://www.puzzlegame.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/yhul7nu531162htf58s70mx2lpcz7ho8/",
    "category": "Puzzles",
    "tags": "Puzzle",
    "thumb": "https://img.gamemonetize.com/yhul7nu531162htf58s70mx2lpcz7ho8/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31707",
    "title": "Find Your Gender",
    "description": "Find Your Gender is a fun parkour game. If you were given a chance to be reborn, would you want to be a boy, a girl, or a genderless person? I believe everyone will have a different answer. In this game, you can make choices and collect items according to your preference to become a boy, girl, or genderless, and the result may surprise you. Simple and intuitive operation for all ages. Are you ready to start this marvelous journey? Website Developer &lt;a href='https://www.bestgames.com/'&gt;https://www.bestgames.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/yrzt3xrgvykzniz9tz1uph0wj3zo3pws/",
    "category": "Racing",
    "tags": "running",
    "thumb": "https://img.gamemonetize.com/yrzt3xrgvykzniz9tz1uph0wj3zo3pws/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31706",
    "title": "Princess Games Makeup Salon",
    "description": "This is a casual beauty and make-up game. If you like make-up and dress-up games, then this game is just for you. We have face care, hair care, body, and back cleaning, and hand and foot cleaning. In face care, you can remove pimple marks, pluck unwanted eyebrows, and care for your skin. For hair care, you can choose from a variety of different hairstyles and hair colors in addition to washing your hair. In hand and foot cleaning you can choose your favourite accessories. &lt;a href='https://www.babygames.com/'&gt;https://www.babygames.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/9wdi0awm2bc0dz9392mq1pdn94pkivdy/",
    "category": "Hypercasual",
    "tags": "Dress Up",
    "thumb": "https://img.gamemonetize.com/9wdi0awm2bc0dz9392mq1pdn94pkivdy/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31705",
    "title": "Piano Hexa Fall",
    "description": "Piano Hexa Fall challenges players to strategically drop hexagonal blocks onto a spinning cylinder to form complete rows and clear them. Inspired by classic block puzzle mechanics, this game adds a musical twist as each successful drop produces harmonic tones, syncing with background music. Navigate increasing speeds and difficulties to achieve high scores and unlock new melodies. With its blend of rhythmic gameplay and spatial reasoning, Piano Hexa Fall offers a refreshing take on both puzzle-solving and musical immersion.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/kheaf510tmbnp14v4slkkrl63otbniv4/",
    "category": "Puzzles",
    "tags": "Android, Arcade, HTML5, iPad, iPhone, Mobile, Puzzle, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/kheaf510tmbnp14v4slkkrl63otbniv4/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31704",
    "title": "Block Jewel 2024",
    "description": "The game features stunning graphics and sound effects that will make you feel like you are playing with real jewels. You can also enjoy the relaxing and soothing music that accompanies the game. The game has different modes and levels to suit your preferences and skills. You can choose from easy, medium, hard, and expert modes, and play hundreds of levels with increasing difficulty and variety. You can also challenge yourself with the daily puzzle, where you have to clear a specific pattern of blocks. Block puzzle jewel is a game that will appeal to all ages and interests. Whether you are looking for a casual game to pass the time, or a stim",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/iru2w6olx1xubivscv7xkvu0ctwibq9u/",
    "category": "Action",
    "tags": "Action",
    "thumb": "https://img.gamemonetize.com/iru2w6olx1xubivscv7xkvu0ctwibq9u/512x384.jpg",
    "width": "768",
    "height": "1024"
  },
  {
    "id": "31703",
    "title": "Chibi Doll Hidden Stars",
    "description": "Step into the enchanting world of Chibi Doll Hidden Stars, a delightful online game designed for both girls and boys. Immerse yourself in this super fun adventure where your keen eye for detail will guide you through charming levels filled with adorable chibi dolls.",
    "instructions": "Mouse to play ",
    "url": "https://html5.gamemonetize.com/ffv0lqmjpatjihzbvjyovpt8kuxlv64s/",
    "category": "Puzzles",
    "tags": "Arcade, Baby Games, Boys, Casual, Girls, Hidden, HTML5, Hypercasual, Puzzle",
    "thumb": "https://img.gamemonetize.com/ffv0lqmjpatjihzbvjyovpt8kuxlv64s/512x384.jpg",
    "width": "960",
    "height": "540"
  },
  {
    "id": "31702",
    "title": "Sea Match",
    "description": "See Match is a challenging match-3 puzzle game. Connect 3 or more of the same fishes horizontally or diagonally. The more fishes you match, the higher your score! Keep an eye on the time. You will fail to pass the level if you do not gather sufficient grids in time. The faster you complete the task, the more stars you earn! If you find yourself stuck, you can always use the special bonuses to help you.",
    "instructions": "Click to swap tiles and match three in a row ",
    "url": "https://html5.gamemonetize.com/7icvt2xcgygntw1uqygfqlckez8sw4xl/",
    "category": "Puzzles",
    "tags": "Animal, Fish, Fishing, Match3, Matching, Puzzle, water",
    "thumb": "https://img.gamemonetize.com/7icvt2xcgygntw1uqygfqlckez8sw4xl/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31701",
    "title": "Journey Of Carter",
    "description": "Explore the adventure and fun game Journey Of Carter Game story begins with two friends conversation. Carters friend suggests visiting a wonder of adventure. He tried many times before but failed, also his belief in Carter that he can do this. In this adventure many mysterious traps and dangers were waiting for the carter. Player has to play the role of Carter and finish each level and collect gold coins. If you like genres such as adventure, action, rpg, platform, quests or just want to have a good time then this game is for you. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quest",
    "instructions": "How to play Android Use On-Screen touch buttons to control the player PC Move Left - Press ldquo Left Arrow rdquo Move Right - Press ldquo Right Arrow rdquo Jump - Press ldquo Up Arrow rdquo ",
    "url": "https://html5.gamemonetize.com/cr7w2eucvhp2qune45gil2lcawre1gog/",
    "category": "Hypercasual",
    "tags": "2D, Adventure, Casual, survival",
    "thumb": "https://img.gamemonetize.com/cr7w2eucvhp2qune45gil2lcawre1gog/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "31700",
    "title": "Wars Island Management",
    "description": "Enter the realm of Wars Island Management, where players must forge their own army from scratch. Strategically build and train troops, fortify defenses, and manage resources wisely to strengthen your military might. Utilize funds to expand your forces, develop new technologies, and ultimately launch calculated attacks against rival armies. Website Developer &lt;a href='https://www.crazygamesonline.comgame?'&gt;https://www.crazygamesonline.comgame?&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/nw2j1urwbjt67lz5j6jigeg3m5e2050n/",
    "category": "Action",
    "tags": "Army, Management, Mentolatux, unity games, War, WebGL",
    "thumb": "https://img.gamemonetize.com/nw2j1urwbjt67lz5j6jigeg3m5e2050n/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31699",
    "title": "Brothers are making a cake",
    "description": "Are you ready to start a cake-making race with your friend in this adventure? The one who makes the cake the fastest wins. Collect the flying cake ingredients with your friend. There are cake ingredients in the balloons; gather them to make your cake. The player who makes the cake the quickest wins the game. Come on, compete in this fun rivalry with your friend and win. Be the best cake master!",
    "instructions": " Press the S key or the Down Arrow key to push or hit The player with the most points in 120 seconds wins Use the WASD keys or the Arrow keys to move ",
    "url": "https://html5.gamemonetize.com/oglqfu1hgpzhlef06nkzll0djjj5p5c5/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Arcade, Cook, Cooking, mineblock, Minecraft, Pixel",
    "thumb": "https://img.gamemonetize.com/oglqfu1hgpzhlef06nkzll0djjj5p5c5/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31698",
    "title": "Bridge Fun Race",
    "description": "Bridge Fun Race is an IO battle arcade game like Mr Bean series. With 3D cute roles, you can join different knockout battles with several AI opponents. Only the first 3 places players can win and join into the next battle. In Racing levels, you need to collect items and push the obstacles to the finish line. In Survival levels, you need to roll and launch snowballs to hit the other players onto the platform in a limited time.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/d55mz3ys0ne1682kzxj5v9maq8grsuy9/",
    "category": "Action",
    "tags": ".io Games, Battle",
    "thumb": "https://img.gamemonetize.com/d55mz3ys0ne1682kzxj5v9maq8grsuy9/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "31697",
    "title": "Blockapolypse Zombie Shooter",
    "description": "Blockapolypse: Zombie Shooter is a defense shooting simulation game with 3D pixel undead creatures. To defend this position, you need to use weapons to defend incoming zombies from 3 directions. After you kill all zombies, you still need to defeat a giant undead creature. As long as you lose all of your HP, you will lose the game. When you earn enough gold coins, you can buy better weapons in the gun shop. Good luck and survive!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/1j0t5mfnpgw2ggvltucvoe5l1g0ny5ze/",
    "category": "Arcade",
    "tags": "Girl, Shooting, Zombie",
    "thumb": "https://img.gamemonetize.com/1j0t5mfnpgw2ggvltucvoe5l1g0ny5ze/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31696",
    "title": "Command Strike FPS Offline",
    "description": "Embark on a perilous journey in Command Strike FPS Offline, a brand new 3D shooter where you must fight for your life by eliminating every person you come across. You will get closer to finishing the map with every person you remove. Kill foes from every angle in battle royale games as a stealthy assassin with the most captivating sniper experience.",
    "instructions": "Instructions You must join the various game maps and finish each level while staying on the move and shooting all enemies before they kill you Controls Left click to shoot Right click to aim WASD to move Ctrl to Run Spacebar to Jump R Recharge",
    "url": "https://html5.gamemonetize.com/t7x6opco5bllwyx9zxsg4v0gtjylrauw/",
    "category": "Action",
    "tags": "Gun, kiz10, Shooter, War",
    "thumb": "https://img.gamemonetize.com/t7x6opco5bllwyx9zxsg4v0gtjylrauw/512x384.jpg",
    "width": "900",
    "height": "550"
  },
  {
    "id": "31695",
    "title": "Prison Break: Architect Tycoon",
    "description": "At the beginning of the game you will be given an empty prison, which is not able to hold even ordinary prisoners, and there are also Bosses! They are especially dangerous! But it is in your power to make your prison better! - Build new cameras - Strengthen the doors - Add surveillance cameras - Hire security guards! - Dont forget about improvements! You can also upgrade your chief overseer - Make it faster - Improve his weapons - Carry more prisoners at the same time Once you have brought order to one prison, try doing the same in others! The game will be interesting for players of all ages. Everyone will find something interesting for",
    "instructions": "Control - For PC Character control - WASD arrows or hold the left mouse button and drag the mouse in the desired direction Shooting - the hero shoots automatically - For Mobile devices Character control - press your finger on the screen and drag you",
    "url": "https://html5.gamemonetize.com/j84v1yxsdbglqubrddit96h0ticcbxes/",
    "category": "Hypercasual",
    "tags": "3D, 3D Games, Action, Android, Arcade, building, Cartoon, Casual, Hypercasual, Simulation, Simulator",
    "thumb": "https://img.gamemonetize.com/j84v1yxsdbglqubrddit96h0ticcbxes/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31694",
    "title": "Fall Boys And Girls 2024",
    "description": "Fall Boys and Girls 2024 brings a thrilling twist to competitive gaming! Join colorful characters in a series of gravity-defying challenges, where agility and strategy are key. Compete against friends or AI in various mini-games, from obstacle courses to team challenges. With whimsical graphics and unpredictable gameplay, can you outwit, outlast, and outplay your way to victory in this dynamic multiplayer extravaganza? Website Developer &lt;a href='https://www.bestcrazygames.com'&gt;https://www.bestcrazygames.com&lt;/a&gt;",
    "instructions": "wasd - walk button SPACE to jump",
    "url": "https://html5.gamemonetize.com/ob8217a4c96k6thxcf7shl0rx5f0f8ay/",
    "category": "Action",
    "tags": "Fall Boys, Fall Guys, Jumping, Mentolatux, Multiplayer, run, running, unity games, WebGL",
    "thumb": "https://img.gamemonetize.com/ob8217a4c96k6thxcf7shl0rx5f0f8ay/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31693",
    "title": "Magic Princess Good Vs Bad",
    "description": "This is a fantasy magic high school-themed makeover game. To stand out from the crowd, you have to create your unique style. You have plenty of fashion combinations to choose from in two different styles, dark and light. Sweet girl or cool girl? Its up to you! You will use the best tools to show off your beauty talent. As a student at a magic school, having a magic wand is important here. Use your magic wand and show off your power.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/aeizww9rjtnrj7bfj06jk5uvhrjes60v/",
    "category": "Hypercasual",
    "tags": "Makeover",
    "thumb": "https://img.gamemonetize.com/aeizww9rjtnrj7bfj06jk5uvhrjes60v/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31692",
    "title": "Insta Trends Galaxy Fashion",
    "description": "Embark on a fashionable trip to the center of the Universe with your favorite princesses while playing the Insta Trends: Galaxy Fashion dress-up game for girls. Elsa, Anna, Moana, Ariel, and Rapunzel recently found Planet Her, and they are super excited to share their new home with you. Fashion on this amazing planet is galaxy colored and centered around fashionable suits and out-of-this-world accessories. Discover them all while helping the girls choose their outfits for the day! Have fun!",
    "instructions": "Use your mouse to play on a desktop and tap to play on mobile devices ",
    "url": "https://html5.gamemonetize.com/jb3nzwipx1d5zvu4vquiqquai8hx4a58/",
    "category": "Girls",
    "tags": "1 Player, Dress Up, Fashion, Girls, Princess",
    "thumb": "https://img.gamemonetize.com/jb3nzwipx1d5zvu4vquiqquai8hx4a58/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31691",
    "title": "Kids Camping 2",
    "description": "Kids camping is an educational game. In this game, you will help the little bear family to complete the camping successfully. The little bear family is going to go out for a spring outing. Before the spring outing, they need to prepare some necessities. Help them prepare these items at home. On the way to the spring outing, they will encounter various dangerous obstacles. Slide the screen to help them avoid obstacles. After arriving at the campsite, you can help the little bears set up tents, make barbecues, feed them desserts, and help them make kites.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/16yljgjhz298uq8it9qpyfsi1tz0udpq/",
    "category": "Hypercasual",
    "tags": "Baby Games, Educational",
    "thumb": "https://img.gamemonetize.com/16yljgjhz298uq8it9qpyfsi1tz0udpq/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31690",
    "title": "Summer Mazes",
    "description": "Summer Mazes is a delightful game where you solve sunny puzzles to escape the maze. Easy controls via touch, mouse, or keyboard make it perfect for all. Enjoy the essence of summer in every challenge.",
    "instructions": "Navigate the sun-ball using the keyboards arrow keys or effortlessly guide it to exit with a mouse or touchpad ",
    "url": "https://html5.gamemonetize.com/ej1oeyiqw1q2i9eangio5oqanyo3ywh1/",
    "category": "Puzzles",
    "tags": "Board, html5 games, Maze, Mobile, Puzzle, Summer",
    "thumb": "https://img.gamemonetize.com/ej1oeyiqw1q2i9eangio5oqanyo3ywh1/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "31689",
    "title": "Fruit Club",
    "description": "Explore fun by placing the fruit tiles in the correct place. Fruit Club is a fun and puzzle tiles matching game. Player has to place the fruit tiles in the correct place. Use your brain to solve the tiles position and win the game. Be Careful! Wrong placement of tiles leading to over the game. If you like genres such as tiles matching games, puzzle games or just want to have a good time then this game is for you. Features of this game: High Quality graphics will leave only positive feedback Game size is minimal (but not compromised the graphics) and it is good for your device health Super simple controls make it easy to play.",
    "instructions": "How to play Android Use On-Screen touch PC Use Mouse Left Click ",
    "url": "https://html5.gamemonetize.com/wm92c07s7eg4jmroyl3bq03d238ni3n5/",
    "category": "Puzzles",
    "tags": "2D, Casual, Match 3, Matching, Puzzle",
    "thumb": "https://img.gamemonetize.com/wm92c07s7eg4jmroyl3bq03d238ni3n5/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31688",
    "title": "Pacman Rush",
    "description": "Pac Rush is an exciting and fast-paced game that will keep players on the edge of their seats. With its vibrant graphics and catchy soundtrack, it offers a visually stunning and immersive gaming experience. Players can navigate through challenging mazes, collect power-ups, and outsmart their opponents to become the ultimate Pac-Rush champion. So, get ready to embark on an adrenaline-fueled adventure and test your skills in this addictive game.",
    "instructions": "Tap on the screen or use the left and right arrow keys to play this game ",
    "url": "https://html5.gamemonetize.com/11lo2edzgr0nf5220dqcetn8c0bjbvvz/",
    "category": "Puzzles",
    "tags": "Arcade, Kids, PacMan",
    "thumb": "https://img.gamemonetize.com/11lo2edzgr0nf5220dqcetn8c0bjbvvz/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31687",
    "title": "Guess the Movies!",
    "description": "Welcome to the Guess the Movie game! Play against other opponents and choose the correct answer. If you choose the wrong answer, youll fall into sea water full of sharks, so be careful. Can you guess the movie from the two pictures?",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/9flfolnkj5pzztatdlwpx0vp2g089m67/",
    "category": "Puzzles",
    "tags": "Puzzle, run, running",
    "thumb": "https://img.gamemonetize.com/9flfolnkj5pzztatdlwpx0vp2g089m67/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31686",
    "title": "Grandfather Road Chase: Realistic Shooter",
    "description": "Your goal is to break away from the chase. But bad luck, you have a rather weak car. No problem! But you have plenty of weapons =)! Use a huge arsenal of weapons to stop the chase. AK47, Minigun, Crossbow, Stationary gun, Machine gun, Flamethrower... Shoot car parts, wheels, body parts. Hand out headshots, do combos! Shoot weapons, machine guns, stationary guns. Do everything to stop the chase. The game has a huge selection of weapons, and there will be even more! Do not rush to relax, the enemy is not asleep. And their attacking arsenal is varied. Motorcycles, ATVs, racing cars, drones, jeeps, helicopters... But you can handle it",
    "instructions": "The task of each level is to break away from the pursuit or rather to destroy all the pursuers Control Shoot left mouse button Aim control by moving the mouse Switch weapons 1 2 3 4 Reload - R Push the screen to shoot and fire on mobile devices ",
    "url": "https://html5.gamemonetize.com/09v05p7k4n8t2dlxcmke1qe42rayser4/",
    "category": "Shooting",
    "tags": "1 Player, 3D, Action, Arcade, Car, crash, Defense, First Person Shooter, gta, Helicopter, Hypercasual, Kill, Shooter, Shooting",
    "thumb": "https://img.gamemonetize.com/09v05p7k4n8t2dlxcmke1qe42rayser4/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31685",
    "title": "Space Survivor",
    "description": "Jump right into the action, fighting dangerous aliens and executing amazing maneuvers! Sharpen your weapons and skills, you will need them to last as long as possible.",
    "instructions": "Move your character around on the screen to attack and defeat enemies Make sure not to get hit when you pick up the gems dropped Upgrade your weapons and abilities Use the power-ups if youre in a tough spot ",
    "url": "https://html5.gamemonetize.com/cvf6jzm7qpn2z2jt5yoct9ejttirza12/",
    "category": "Arcade",
    "tags": "Action, Space, survival, War, weapons",
    "thumb": "https://img.gamemonetize.com/cvf6jzm7qpn2z2jt5yoct9ejttirza12/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "31684",
    "title": "Gross Out Run",
    "description": "Gross Out Run is a parkour game. Compete against two other AI runners and the first player to reach the finish line wins! Be careful, you have to avoid the sledgehammers on the road, which will block your progress and stain your clothes simultaneously. Its time to make a change! Can you get to the finish line first and keep yourself tidy?",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/5jo49g9hltbsbs2kqbqyfupn0p7y5ku1/",
    "category": "Racing",
    "tags": "running",
    "thumb": "https://img.gamemonetize.com/5jo49g9hltbsbs2kqbqyfupn0p7y5ku1/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31683",
    "title": "Doors Awakening",
    "description": "This is a challenging puzzle-solving online game. This game has wonderful 3D graphics enabling you to explore the handcrafted levels. The fascinating visual effects, realistic atmosphere, and natural camera controls will keep you returning for more. If youd prefer puzzle games, dont miss this wonderful challenge.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/ipz6ccrjfdl2s6owom2dysl1kuhumvb2/",
    "category": "Puzzles",
    "tags": "Puzzle",
    "thumb": "https://img.gamemonetize.com/ipz6ccrjfdl2s6owom2dysl1kuhumvb2/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31682",
    "title": "Fruit Cutter Fun",
    "description": "Show your fruit cutting skill by cutting the fruits as much as you can. Fruit Cutter Fun is a fruit cutting game. You have to tap and cut the fruit, but avoid tapping on bombs either game will be over. Focus and tap only fruits, there are two modes available in this game. So why are you waiting ? Just download the game and explore fruit cutting. If you like genres such as fruit cutting, fruit slicing or just want to have a good time then this game is for you. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests.",
    "instructions": "How to play Android Use On-Screen touch and tap PC Use Mouse Left Click ",
    "url": "https://html5.gamemonetize.com/sw6gr6e5drzeym1lyikkqqgvy3n09zov/",
    "category": "Hypercasual",
    "tags": "2D, Casual, Fruits",
    "thumb": "https://img.gamemonetize.com/sw6gr6e5drzeym1lyikkqqgvy3n09zov/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31681",
    "title": "Pixel Battle Upward",
    "description": "In this adventure, we must avoid the lava and push our enemy into it. Are you ready for a fun game of avoiding the lava with your friend? Whoever falls into the lava loses. To avoid falling into the lava, you must evade your friend. Run away from your friend or push them into the lava. Watch out for rockets falling from the sky. These rockets can kill you. The player who falls into the lava or dies the most loses the game. Play with your friend and try to beat them.",
    "instructions": " Press the S key or the Down Arrow key to push or hit The player with the most points in 120 seconds wins Use the WASD keys or the Arrow keys to move ",
    "url": "https://html5.gamemonetize.com/s4cw0jv77r2zsls099sg1y5ht0p1zlyl/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade",
    "thumb": "https://img.gamemonetize.com/s4cw0jv77r2zsls099sg1y5ht0p1zlyl/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31680",
    "title": "Prehistoric Jumper",
    "description": "Prehistoric Jumper is a thrilling arcade game where players control a daring cave person leaping across treacherous landscapes filled with dinosaurs and primitive obstacles. Master the art of timing and precision as you jump from platform to platform, avoiding hazards and collecting ancient artifacts. Unlock new characters with unique abilities and discover hidden secrets scattered throughout the prehistoric world. With vibrant pixel art and addictive gameplay, Prehistoric Jumper offers a nostalgic journey back in time. Website Developer &lt;a href='https://www.coolcrazygames.com/'&gt;https://www.coolcrazygames.com/&lt;/a&gt;",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/k09lrw59wdi6slpznaybm1iw78kchxfq/",
    "category": "Arcade",
    "tags": "Android, Arcade, HTML5, iPad, iPhone, Mobile, Retro, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/k09lrw59wdi6slpznaybm1iw78kchxfq/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31679",
    "title": "space shooter VS aliens and asterods",
    "description": "Play with your friends in VS and explore star systems and destroy asteroids and aliens to evolve your ship to improve your missiles and speed face waves of aliens and asteroids shoot to survive",
    "instructions": "gamepad W a s d arrows VS mode P1 w a s d P2 arrows",
    "url": "https://html5.gamemonetize.com/mmqja7cgx7qxrqz0f2e9t481p0yprjii/",
    "category": "Shooting",
    "tags": "2 Player, Arcade, HTML5, Shooting",
    "thumb": "https://img.gamemonetize.com/mmqja7cgx7qxrqz0f2e9t481p0yprjii/512x384.jpg",
    "width": "2580",
    "height": "1500"
  },
  {
    "id": "31678",
    "title": "Dino War Birds",
    "description": "Dino War Birds multiplayer online shooter game with dragons and heroes to choose from and test your skills. Collect Coins by shooting Each others and win prices toys and more. Play online or with friends.",
    "instructions": "Mouse or touch to move Space to shoot bullets X to missile Z to Rockets",
    "url": "https://html5.gamemonetize.com/3z4mss6go0qkmba3wrx7vj6z6kwizy27/",
    "category": "Shooting",
    "tags": "Dragon, Fight, fly, Plane, Shooting",
    "thumb": "https://img.gamemonetize.com/3z4mss6go0qkmba3wrx7vj6z6kwizy27/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "31677",
    "title": "TimeGems",
    "description": "Embark on an exciting adventure in the colorful world of Time Gems, a delightful match-three game designed for quick, enjoyable gaming moments. In Time Gems, youll be racing against the clock to match stunning gems and score high points. Timed Challenges: Each game session is a fast-paced race against the clock. Match gems to add precious seconds and prolong the excitement!",
    "instructions": "Click and drag gems to swap them",
    "url": "https://html5.gamemonetize.com/hw9hz2my1ezyci7yavxz4cyg33e4o2bw/",
    "category": "Puzzles",
    "tags": "Match 3, Match-3, Match3, Matching, Puzzle, puzzleblock",
    "thumb": "https://img.gamemonetize.com/hw9hz2my1ezyci7yavxz4cyg33e4o2bw/512x384.jpg",
    "width": "600",
    "height": "800"
  },
  {
    "id": "31676",
    "title": "Dodge Ball Jump",
    "description": "Welcome to Dodge Ball Jump Hypercasual Game! Swipe up to fill the guys belly to jump higher and release to shoot the ball at your opponent. When you hit your opponent three times, you will win. Good luck!",
    "instructions": "Swipe up to fill the guys belly to jump and dodge the ball ",
    "url": "https://html5.gamemonetize.com/85xnibxi6da0o3shfewz7hpv5lskpnh4/",
    "category": "Shooting",
    "tags": "Hypercasual, Jumping",
    "thumb": "https://img.gamemonetize.com/85xnibxi6da0o3shfewz7hpv5lskpnh4/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31675",
    "title": "100 Rooms Escape",
    "description": "This is a brain-burning and challenging escape room online game. Interesting gameplay so you wont get bored. You need to open 100 doors to escape the room. Interact with objects and solve puzzles to complete the tasks in the escape game. Each level is unlocked to give you a thrilling adventure experience. Each room requires a collection of clues and you may explore different places with unexpected rewards. Solve the puzzles, and take inventory of the hidden items. You may use them to open the room, move on to the next level, use your skills, and do whatever it takes to escape.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/cwq4oakedj7ro2oi8mtqzgap9fx0422p/",
    "category": "Puzzles",
    "tags": "Escape, Room",
    "thumb": "https://img.gamemonetize.com/cwq4oakedj7ro2oi8mtqzgap9fx0422p/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31674",
    "title": "Diy Dessert Cooking Master",
    "description": "This is a dessert-making game for girls. If you like dessert-making games, then this game is just right for you. Our game has 4 modes which are making fruit salad, strawberry cake, ice cream, and hamburger. You can choose your favorite fruits, or ingredients to use your creativity to make desserts. In this game, you can experience every step of making desserts while enjoying the fun of making your own. In the process of making desserts, you will exercise your creativity and imagination. Now, join the game and make your style of dessert.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/2nhii9k25be5wdu0l782wlp1gnhh2psh/",
    "category": "Hypercasual",
    "tags": "Cake, Cooking",
    "thumb": "https://img.gamemonetize.com/2nhii9k25be5wdu0l782wlp1gnhh2psh/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31673",
    "title": "Stick Ninja Survival",
    "description": "Stick Ninja Survival is a rogue-like arcade game with 2D stickman characters and monsters. When the Red Sun comes, the sky is covered by the Red Moon, and the world becomes extremely terrifying. People fled in fear from the monsters mouth. You only need to dodge enemies and their bullets because of automatic attack. When you earn some gem resources, you can use them to upgrade your character, Skills, and Talents.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/qtolds7l6m9gguste68ktzr31jjlt7tu/",
    "category": "Arcade",
    "tags": "Stickman",
    "thumb": "https://img.gamemonetize.com/qtolds7l6m9gguste68ktzr31jjlt7tu/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31672",
    "title": "Skate Boy",
    "description": "Are you ready to skateboard in the city? It may look very dangerous, but its time to ride in the city. Grab your skateboard and start riding. Be very careful, as there are obstacles everywhere that you could crash into and lose.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/ynjzx2uz8r0bcveur915gxbvttf1c3s3/",
    "category": "Arcade",
    "tags": "1 Player, Adventure, Arcade, Pixel, Skateboard",
    "thumb": "https://img.gamemonetize.com/ynjzx2uz8r0bcveur915gxbvttf1c3s3/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31671",
    "title": "Monster Match Mania",
    "description": "Embark on a monstrous adventure in Monster Match Mania! Match 3 monsters of the same color to eliminate them and progress through challenging levels!",
    "instructions": "Touch in collumns to drop a monster",
    "url": "https://html5.gamemonetize.com/ecfzzuzdam1pkz8id43kziiaswlm0fjw/",
    "category": "Puzzles",
    "tags": "Halloween, Logic, Monster, Puzzle",
    "thumb": "https://img.gamemonetize.com/ecfzzuzdam1pkz8id43kziiaswlm0fjw/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31670",
    "title": "Fantastic Orange",
    "description": "Collect the orange to the bucket, physics based orange balance Game story begins with Richer and his grandfather. Grandfather suggested to Richer to play a game as he is busy most of the time for study. Game is simple but a little bit tricky. Player has to help Richer to collect oranges in the specified bucket by balancing them one to another blocks. Be careful! Orange is destroyed if it collides with the spikes, so be wise and use your brain to find a simple way to collect it. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests.",
    "instructions": "How to play Android Use On-Screen touch buttons to control the blocks PC Move Left - Press ldquo Left Arrow rdquo Move Right - Press ldquo Right Arrow rdquo ",
    "url": "https://html5.gamemonetize.com/3uq5btqw1bkjiclgcapq5szc74p0mz8w/",
    "category": "Hypercasual",
    "tags": "2D, Casual, Hypercasual",
    "thumb": "https://img.gamemonetize.com/3uq5btqw1bkjiclgcapq5szc74p0mz8w/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31669",
    "title": "Noob vs Pro Sand island",
    "description": "In the adventure of Noob and Pro, there are very dangerous desert monsters. You must kill all the monsters and animals. Although Noob is clumsy and unintelligent, only he can activate the portal. Noob needs to collect iron and flint to activate the portal. Of course, Pro needs to help Noob. Pro must kill all the monsters and animals and collect all the coins. Together, Noob and Pro must reach the portal.",
    "instructions": " Use the WASD keys to move Press the P key to attack with the sword and throw the sword Mobile controls are available for playing on mobile Double jump is active in the game You can jump twice ",
    "url": "https://html5.gamemonetize.com/byukioh9zbd300wj1gi537bl15sdjcan/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, mineblock, Minecraft, Mobile, Pixel",
    "thumb": "https://img.gamemonetize.com/byukioh9zbd300wj1gi537bl15sdjcan/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31668",
    "title": "BitBall 2",
    "description": "A unique tile ball puzzle game from coin base bitcoin games loved by millions of players around the world. Make a lot of coins and become a rich.",
    "instructions": "Just click on buttons ",
    "url": "https://html5.gamemonetize.com/snsa7ay3lf1wmpamo0a9ag6jqjty5rrz/",
    "category": "Hypercasual",
    "tags": ".io, .io Games, 2D, 8 Ball Pool, Casino, gambling, Hypercasual, iPhone, Mobile, Physics",
    "thumb": "https://img.gamemonetize.com/snsa7ay3lf1wmpamo0a9ag6jqjty5rrz/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31667",
    "title": "King guard",
    "description": "Let you command a strategic tower defense mission, your goal is very clear: to protect the crown at all costs! Build powerful towers and deploy troops to resist ruthless enemy attacks. Use gold mines to increase your resources and wisely plan your soldiers routes to enemy territory. Every victory can bring you some precious gems to permanently upgrade your skills",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/ggk17hg85vxt2xznfr9e9cojowh3jp27/",
    "category": "Hypercasual",
    "tags": "Fighting, Strategy, War",
    "thumb": "https://img.gamemonetize.com/ggk17hg85vxt2xznfr9e9cojowh3jp27/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31666",
    "title": "Pet Fall",
    "description": "You can move animals from side to side. You have to collect full horizontal lines to make them disappear. Some animals are frozen and must be released twice, some are locked in cages and cannot be moved. Use bonuses when necessary",
    "instructions": "Slide Pet blocks and create full lines Move Pet blocks to empty positions and create full lines to remove lines ",
    "url": "https://html5.gamemonetize.com/sam2ciecqesknsk6ectirbhug39obb25/",
    "category": "Puzzles",
    "tags": "Animal, Funny, Logic, Matching, Puzzle, Tetris",
    "thumb": "https://img.gamemonetize.com/sam2ciecqesknsk6ectirbhug39obb25/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31665",
    "title": "Army Car Truck Transport Game",
    "description": "Simulator Game Offline is aware that you have played many driving simulation games such as truck games, car bus driving games, or other truck transport games but I am sure that no one is much entertained by army truck games as this military truck driving games. army truck transport games contain multiple challenging levels of army truck driving games. In this truck simulation, fauji wala games show your truck wali game skills under different weather conditions of the truck wala game.",
    "instructions": "use keyboard arrows to move vehicles and use space button to stop truck",
    "url": "https://html5.gamemonetize.com/xrxvkgstmxs9o6kopu49tmjxtafb0gti/",
    "category": "Adventure",
    "tags": "Army, Battle, Fight, Fighting, Gun, monstertruck, Truck",
    "thumb": "https://img.gamemonetize.com/xrxvkgstmxs9o6kopu49tmjxtafb0gti/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31664",
    "title": "Missile Escape. Jet Era",
    "description": "Missile Escape. Jet Era is a simple, fast and addictive game where your mission is to eliminate all the homing rockets that comes toward you with the one purpose: shooting you down! Use the simple flight control to fly your airplane and avoid the missiles. Make them collide with each other and collect stars to increase the final score. Missile Escape: Jet Era features : - Exciting arcade gameplay; - Four game modes; - Collect stars to raise your final tokens quantities and unlock new planes; - Make the rockets collide with each other to increase the final score; - Survive as long as possible to gain more score; - If the plane are hit,",
    "instructions": "Use the keys A and D or arrows to control to fly your airplane and avoid the missiles For mobile devices used bittons left and right on the screen ",
    "url": "https://html5.gamemonetize.com/uagk43mzl1etlhjdrfr33kyyajxu1nz7/",
    "category": "Arcade",
    "tags": "1 Player, Action, Aircraft, airplane, Avoid",
    "thumb": "https://img.gamemonetize.com/uagk43mzl1etlhjdrfr33kyyajxu1nz7/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31663",
    "title": "Real Flight Simulator",
    "description": "Real Flight Simulator plays like an airplane driving simulation game with 3D models. In 6 levels, you can learn how to drive an airplane including starting, steering, and landing. All of the complicated instrument panels are simplified for players to learn. The more expensive the airplane you drive, the better acceleration of it you can enjoy including the Power, Speed, Solution, and Brake. Good luck in the sky!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/qomp8q8bgmkbkwitrb5mc6ba7k3shj1m/",
    "category": "Boys",
    "tags": "airplane, Simulation",
    "thumb": "https://img.gamemonetize.com/qomp8q8bgmkbkwitrb5mc6ba7k3shj1m/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "31662",
    "title": "Party Games Mini Shooter Battle",
    "description": "Party Games: Mini Shooter Battle is a battle-royale shoot-em-up game with 2D cartoon models. In 4 modes, you can shoot other players to earn scores for coins and gems. Then you can buy more roles and guns in the Shop. Your character can aim at the closest target automatically so that you only need to fire and dodge bullets from enemies. More kills and less death will make you claim more coin and gem rewards. Good luck!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/ss99whqqix1wim1twd1aq59xtdqw8iu5/",
    "category": "Fighting",
    "tags": ".io Games, Battle",
    "thumb": "https://img.gamemonetize.com/ss99whqqix1wim1twd1aq59xtdqw8iu5/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31661",
    "title": "DIY Slime Art",
    "description": "This is a DIY simulation game. If you like DIY games, then this game is for you. You can make your models in different shapes, round, heart, and star shapes. You can also make small animal shapes such as peacocks, hedgehogs, and mergansers. Our game also has levels for beautiful girls, sugarplums, and trees for you to choose from. After choosing your model you can start making it. You can also choose your favorite decorations, and when they are ready you can knead them as much as you want. This game has beautiful graphics that will bring you visual enjoyment. You can also enjoy the fun of DIY. Ready or not, join the game now.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/rnnkn5vhybkd9tjipe7eqjae4b8nl477/",
    "category": "Puzzles",
    "tags": "Simulation",
    "thumb": "https://img.gamemonetize.com/rnnkn5vhybkd9tjipe7eqjae4b8nl477/512x384.jpg",
    "width": "1080",
    "height": "1290"
  },
  {
    "id": "31660",
    "title": "Mushroom Fight For The Kingdom",
    "description": "Mushroom Fight For The Kingdom is an exciting and strategic mobile game where players embark on a thrilling journey to defend and expand their magical mushroom kingdom. Set in a vibrant and fantastical world, players take on the role of a brave mushroom warrior tasked with battling hordes of enemies, conquering territories, and building a powerful kingdom.",
    "instructions": "Movement Left Button Move your mushroom character to the left Right Button Move your mushroom character to the right Jump Up Button Make your mushroom character jump Hold the button for higher jumps Pause Button Pause the game and open the pause",
    "url": "https://html5.gamemonetize.com/46nsye7o4hesbk48kuhz740cizu3jqem/",
    "category": "Adventure",
    "tags": "1 Player, 2D, Action, Adventure, Android",
    "thumb": "https://img.gamemonetize.com/46nsye7o4hesbk48kuhz740cizu3jqem/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31659",
    "title": "Puppy Merge",
    "description": "Puppy Merge is a unique merge game where you must grab and combine identical puppies to create a new and bigger one. Puppies will fall automatically into the arena; what you must do is drag the puppies around and merge them into identical ones. Dont let the puppies fall outside the box, or the game will end. You can try to catch the puppy and bring it back to the arena if the puppy falls.",
    "instructions": "Drag the left mouse button to move the puppies ",
    "url": "https://html5.gamemonetize.com/hm39vas4paot7bsrhcafrn923ied28xp/",
    "category": "Puzzles",
    "tags": "Animal, Funny, Matching, Puzzle, Summer",
    "thumb": "https://img.gamemonetize.com/hm39vas4paot7bsrhcafrn923ied28xp/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31658",
    "title": "Cat Puzzle Slider",
    "description": "Cat Puzzle Slider is a delightful 4x4 picture slider game where players rearrange scrambled images of adorable cats to complete the puzzle. Perfect for cat lovers and puzzle enthusiasts alike, this game offers a fun and challenging experience for all ages.",
    "instructions": "To play Cat Puzzle Slider use your mouse or touchpad to click and drag tiles to rearrange the image of the cat ",
    "url": "https://html5.gamemonetize.com/mfdjvnn3wh2p668o1wlnt132jqbrszju/",
    "category": "Puzzles",
    "tags": "Cat, HTML5, Jigsaw, Mobile, Puzzle",
    "thumb": "https://img.gamemonetize.com/mfdjvnn3wh2p668o1wlnt132jqbrszju/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "31657",
    "title": "BlockFit Puzzler",
    "description": "Step into a world of challenging puzzles and intriguing perspectives with BlockFit Puzzler! Strategically align the blocks in the upper layer to match perfectly with the patterns in the lower layer from an isometric perspective. With levels ranging from 3&amp;times;3 to 5&amp;times;5 grids, youll need keen logical reasoning and sharp visual skills to conquer each stage. As you progress, the difficulty will increase, testing your puzzle-solving abilities and pushing you to think outside the box. Embark on this block-aligning journey and solve captivating puzzles while overcoming various challenges in your pursuit of perfection! Each level offers a unique and e",
    "instructions": "Touch to remove the cubes",
    "url": "https://html5.gamemonetize.com/jmf13smtag004vciz6kgz8mctvvvuhct/",
    "category": "Puzzles",
    "tags": "Educational, Logical, Puzzle",
    "thumb": "https://img.gamemonetize.com/jmf13smtag004vciz6kgz8mctvvvuhct/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31656",
    "title": "Retro Running Boxes",
    "description": "Retro Running Boxes features an exciting one-player mode and a unique two-player mode where two players can play simultaneously on one device. This adds a competitive edge and makes it perfect for playing with friends. In Retro Running Boxes, your goal is simple: run as far as possible while jumping over and avoiding dangers along the way. The game captures the essence of classic arcade games with its super retro feel, specially made for arcade lovers around the world. Enjoy the vibrant 8-bit graphics and nostalgic sound effects that will take you back to the golden age of gaming.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/7hm91ofghhjvl8bmpx34hicu5tseacaf/",
    "category": "Racing",
    "tags": "Block, HTML, jump, Jumping, mapi games, Mobile, Pixel, Race, Racing, Retro, running",
    "thumb": "https://img.gamemonetize.com/7hm91ofghhjvl8bmpx34hicu5tseacaf/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31655",
    "title": "Friends Battle Eat A Food",
    "description": "Are you ready to grow and shrink? In this adventure, you need to be careful about what you eat. The one who grows the most before time runs out wins. To grow, you need to eat apples. But dont forget, you need to eat the right apples because some apples are poisonous and can make you shrink. Stay away from the poisonous apples. Catch the falling apples from above and win the game. You should compete with your friend in a competitive showdown. Collect the apples and grow like a giant.",
    "instructions": " Press the S key or the Down Arrow key to push or hit The player with the most points in 120 seconds wins Use the WASD keys or the Arrow keys to move ",
    "url": "https://html5.gamemonetize.com/sbiwa5sb6shigab1ou8p2vust64a6w3j/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Battle",
    "thumb": "https://img.gamemonetize.com/sbiwa5sb6shigab1ou8p2vust64a6w3j/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31654",
    "title": "Baby Panda Pet Care Center",
    "description": "Baby Panda Pet Care Center is an interesting educational game. In this game, you will have the opportunity to rescue 2 cute animals with Baby Panda. They are a stray kitten and a fainted bunny. If you are a child who likes small animals and is willing to help others, then this game is very suitable for you. We provide you with professional rescue tools. In this game, you can not only enjoy the fun of playing but also learn basic rescue knowledge. This game also has bright colors and smooth animations.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/clcklutfn92ch4q2o2crsc38rmzuohpx/",
    "category": "Hypercasual",
    "tags": "Educational",
    "thumb": "https://img.gamemonetize.com/clcklutfn92ch4q2o2crsc38rmzuohpx/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31653",
    "title": "Majestic Dash",
    "description": "Welcome to the world of Fantasy. This Fantasy adventure game will challenge your capability to overcome the hardships and got into the next level. In this &amp;lsquo;Majestic Dash&amp;rsquo; Milo and his friend Nova lived happily.One day some bad guy went to them and took Nova. The game is all about the rescue of his friend Nova. Main object is the Crystal , find the Crystal to rescue Nova which is the main purpose of the game. If you like genres such as Fantasy adventure, platform, quests or just want to have a good time then this game is for you. Features of this game: High Quality graphics Game size is minimal Super simple controls Interesting quests.",
    "instructions": " How to play Android The player is always moving You will have to manage the player by pressing the lsquo Jump rsquo button which is on the right side of the screen And the lsquo Power rsquo button is on the left side to generate power and attack P",
    "url": "https://html5.gamemonetize.com/7b6g4b2uuo6l0a23zivs8t0xg908vsx4/",
    "category": "Adventure",
    "tags": "2D, Action, Adventure, Platform",
    "thumb": "https://img.gamemonetize.com/7b6g4b2uuo6l0a23zivs8t0xg908vsx4/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31652",
    "title": "Girl Mini Games Collection",
    "description": "Girl Mini Games Collection is a game collection for girls, including 10 different types of mini-games. You can eat rainbow jelly, and design different colors for plaster dolls, plaster girls, and plaster puppies. You can be a simulation doctor to see animals, draw cartoon rabbits, kittens, and pigs, and be a detective. Exquisite cartoon pictures bring you visual enjoyment. A variety of gameplay will keep you coming back for more. If you dont like to play one type of game, then this game is just right for you. Join the fascinating game world now.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/s6vi75m837k350ul86z5l3aenj3fgkrr/",
    "category": "Hypercasual",
    "tags": "Collection",
    "thumb": "https://img.gamemonetize.com/s6vi75m837k350ul86z5l3aenj3fgkrr/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31651",
    "title": "Anime Princess Cosplay Asmr",
    "description": "Anime Princess Cosplay ASMR is a dress-up game carefully created by Yiv.com. This game allows you to experience the fun of dressing up anime characters and gives you visual enjoyment. This game has refreshing colors that are comfortable for the eyes and can relieve visual fatigue. We have also added dynamic effects to this game. Her head and arms can swing with the dynamic music, which not only adds to the fun of the game but also allows you to immerse yourself in the game. We have also prepared hundreds of carefully selected fashion costumes that will satisfy your fashion taste. Want to know more about this game?",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/rn08tnt5t5jj1go7jqe8vrg3n2ooa1sb/",
    "category": "Hypercasual",
    "tags": "Dress Up",
    "thumb": "https://img.gamemonetize.com/rn08tnt5t5jj1go7jqe8vrg3n2ooa1sb/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31650",
    "title": "Candy Kingdom Skyblock Parkour",
    "description": "In this adventure, the king and queen need to escape from the skyblock world. You must help them escape from this world. Along with your friend, assist them in escaping this challenging parkour-like world. Complete each parkour stage one by one. At the end of each level, there is a portal that both players must reach. Safely guide the king and queen to the portal. Watch out for spikes and dont fall down. Collect all the candies along the way, or else the portal wont open. Gather all the candies to activate the portal and earn the right to move on to the next level.",
    "instructions": " Use WASD and Arrow Keys to move Double Jump is active Collect all the candies to create the portal Safely reach the portal ",
    "url": "https://html5.gamemonetize.com/16225yzym4zmg4z84erv8fle937pkawm/",
    "category": "Adventure",
    "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Cartoon, Cartoon Network, mineblock, Minecraft",
    "thumb": "https://img.gamemonetize.com/16225yzym4zmg4z84erv8fle937pkawm/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31649",
    "title": "Runic Block Collapse",
    "description": "Welcome to Runic Block Collapse! Tap any block to clear connected blocks in a chain reaction. Removing one block costs 250 points. Removing 2 or more blocks earns points, with larger groups earning more per block. Reach the target score to advance. If you fail, start over. Enjoy endless fun!",
    "instructions": "Use a mouse or touchpad to play this game ",
    "url": "https://html5.gamemonetize.com/fuilbykpsyucv0srtmi9al3kwnuryf7c/",
    "category": "Puzzles",
    "tags": "Block, HTML5, Matching, Mobile, Puzzle, Skill",
    "thumb": "https://img.gamemonetize.com/fuilbykpsyucv0srtmi9al3kwnuryf7c/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "31648",
    "title": "SEVEN CARD GAME",
    "description": "** SEVEN CARD GAME is A FREE-TO-PLAY ONLINE H5 GAME. * SEVEN CARD GAME, which is called SEVEN CARD STUD, is a classic poker game which can take a lifetime to master. ** SEVEN CARD GAME lets you: * PLAY CARD GAME ONLINE WITH MILLIONS OF REAL PLAYERS ~ SEVEN CARD GAME is essentially seven card stud. This is a betting game with a 52-card deck. ~ In SEVEN CARD GAME, players are individually dealt seven cards throughout the course of the hand, but only the best five-card poker hand possible for each player is used to determine the winner.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/9ozup2d4051p0km7zna0749e6q2nvdqt/",
    "category": "Multiplayer",
    "tags": "Board, Card, gambling, Multiplayer, Online, Poker",
    "thumb": "https://img.gamemonetize.com/9ozup2d4051p0km7zna0749e6q2nvdqt/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31647",
    "title": "Plug Man Race",
    "description": "Plug Head Race plays like a collecting arcade game with battery items. To win the level, you need to overpass the finish line in first place. Each platform requires a lot of red battery items, collect them, and use them to pass the current switch. When you are weaker than others, keep away from them and collect red battery items only. Remember to buy your favorite skins when you have enough gold coins.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/kqanb5x38iamu5oqbd1mhkdk7yaoon0f/",
    "category": "Boys",
    "tags": "1 Player, Collection",
    "thumb": "https://img.gamemonetize.com/kqanb5x38iamu5oqbd1mhkdk7yaoon0f/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31646",
    "title": "misland online",
    "description": "Misland is a placement/management game that allows you to turn a deserted island into a prosperous paradise! Starting from picking apples from trees with bear hands, your skills and tools can be upgraded one by one! This island is filled with resources waiting to be discovered. By trading resources with ships, your wealth will increase. Once you have enough resources, you will have a team of assistants to complete tasks such as apple harvesting, tree felling, and quarrying! Be careful of invading monsters attempting to steal your resources; You need to wave your sword to protect your island. Are you ready to oversee the transformation of the",
    "instructions": "Move Use directional keys WASD or click and drag with the mouse to move ",
    "url": "https://html5.gamemonetize.com/snpxjzlasrg7hfbe6r3538ys1h08gfe6/",
    "category": "Boys",
    "tags": "Adventure, Management, Relaxation, Simulation",
    "thumb": "https://img.gamemonetize.com/snpxjzlasrg7hfbe6r3538ys1h08gfe6/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31645",
    "title": "Euro Champ 2024",
    "description": "Awesome 3D Soccer actionthat will keep your going for a while. Can you go through all 4 elimination games and became the latest Euro Champ? You will score from free kicks and volleys as the ball is passed to you from the side",
    "instructions": "Mouse to move position mouse lower around players legs to shoot higher On mobiles use touch controls to move and tap the boot ball on the right side to kick ",
    "url": "https://html5.gamemonetize.com/oid03ewux4ogtr5g48wqjh9x0k6j4uji/",
    "category": "Sports",
    "tags": "Football, Soccer, Sports",
    "thumb": "https://img.gamemonetize.com/oid03ewux4ogtr5g48wqjh9x0k6j4uji/512x384.jpg",
    "width": "960",
    "height": "540"
  },
  {
    "id": "31644",
    "title": "Puppy Pet Vet Care",
    "description": "Puppy Pet Vet Care is a cute caring game. In this game, you will take care of stray cats and dogs. First, bathe them, because they must not have the opportunity to take care of their hair and appearance when they are wandering. Then give the kittens and puppies a full body check, because they will inevitably encounter ferocious animals and bad people in the wild, which will cause them to have some diseases. After checking their bodies, you can choose suitable clothes for them to dress them up. Want to know more about this game? Come and enjoy it.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/yjc29tigt9a83uz4hwt5ut4xpsra195l/",
    "category": "Hypercasual",
    "tags": "Cat, Cute",
    "thumb": "https://img.gamemonetize.com/yjc29tigt9a83uz4hwt5ut4xpsra195l/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "31643",
    "title": "starpoly",
    "description": "Pc trading board game which can be played against AI and among family and friends.contains unique features such as lottery and appreciation of properties draws.accept or decline loan and the starbridge.Use site management to settle amount,upgrade,downgrade and sell properties which can be done also by clicking on the corresponding sites/slots.Relax n enjoy A",
    "instructions": "Mouse click to play",
    "url": "https://html5.gamemonetize.com/stp68cw05n283o49a9n8qym64knqpbmz/",
    "category": "Puzzles",
    "tags": "Board, Card, Casual, Family, Strategy",
    "thumb": "https://img.gamemonetize.com/stp68cw05n283o49a9n8qym64knqpbmz/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31642",
    "title": "TicToc Urban Outfits",
    "description": "Your favorite TicToc stars are back, and theyre ready to have fun and dress up in urban fashion! Discover the latest fashion trends from your favorite social media app, TicToc, in this fresh new dress-up game. Weve collected four of our most fashionable BFFs to show you all their hottest looks, so join us in this brand-new dress-up game for girls.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/6tdorjmdkvwfk8gjj6e603u85jn0pz0o/",
    "category": "Girls",
    "tags": "1 Player, Dress Up, Fashion, Girl, Princess",
    "thumb": "https://img.gamemonetize.com/6tdorjmdkvwfk8gjj6e603u85jn0pz0o/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "31641",
    "title": "Arrows Edge",
    "description": "Explore arching adventure. Shoot the skeletons with great arching skills. Game story starts with an archer and a trainer, the archer accepts a challenge from the trainer and goes to kill the skeletons. Player has to help to aim on the skeletons. Be careful! While aiming as those arrows could harm the player also then the game would be over. Features of this game: High Quality graphics will leave only positive feedback Game size is minimal (but not compromised the graphics) and it is good for your device health Super simple controls make it easy to start playing Interesting quests will not let you get bored while playing the game.",
    "instructions": "How to play Android Use On-Screen touch amp tap to shoot PC Use Mouse Left click to aim amp shoot ",
    "url": "https://html5.gamemonetize.com/saw31s5y9lbhxlvahb7u0ry3a9olqm0g/",
    "category": "Hypercasual",
    "tags": "2D, arrow, Casual, Shooting",
    "thumb": "https://img.gamemonetize.com/saw31s5y9lbhxlvahb7u0ry3a9olqm0g/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31640",
    "title": "Angry Birds Go! Hidden Stars",
    "description": "Angry Birds Go! Hidden Stars is a free online fun and hidden object game. Find out the hidden stars in the specified images. Each level has 10 hidden stars. There are 12 levels in total. The time is limited so be fast and find all hidden objects before time runs out. Clicking in the wrong place several times reduces the time by an additional 5 seconds. So, if you are ready, start the game and have fun!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/wxbk6q3cxeg1q5b57ofd0cxkfcronwui/",
    "category": "Puzzles",
    "tags": "angrybirds, Best, Cars, Fun, Funny, Hidden, Kart, Mobile, Skill",
    "thumb": "https://img.gamemonetize.com/wxbk6q3cxeg1q5b57ofd0cxkfcronwui/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "31639",
    "title": "Box Smasher",
    "description": "Box Smasher is the ultimate fun game where your aim is to launch a ball and destroy as many funny boxes as you can! The goal is to resist for as long as possible, showcasing your skills and endurance. In Box Smasher, each level presents a unique set of challenges with different box formations and obstacles. The more boxes you destroy, the higher your score. Calculate the perfect angle and force to launch the ball and watch the boxes topple and crash in a satisfying cascade of destruction. Designed for all ages, Box Smasher offers endless fun and excitement. Whether youre a casual gamer or a competitive player, Box Smasher will keep you ent",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/s97prlfkzxb5b5f7xszz00pr0dux4bdc/",
    "category": "Clicker",
    "tags": "Arcade, Block, Casual, HTML, smash",
    "thumb": "https://img.gamemonetize.com/s97prlfkzxb5b5f7xszz00pr0dux4bdc/512x384.jpg",
    "width": "320",
    "height": "420"
  },
  {
    "id": "31638",
    "title": "Mad Max Zombie Arena",
    "description": "Mad Max Zombie Arena is a 3D game about driving a modified automobile across a zombie-infested landscape. Its enjoyable and addicting, and it came just in time for the apocalypse. In order to remain alive in the face of a zombie apocalypse, you must pilot your preferred vehicle while avoiding the undead. Keep going, race your war vehicle throughout the arena, and annihilate the undead. You can play this and similar games for free on kiz10.com.",
    "instructions": "Controls Use W A S D to move your car and space to handbrake Also you have N button for nitro As for mobile controls are on screen ",
    "url": "https://html5.gamemonetize.com/gmyo0eoy41wbibg657zurkl3zio5nt8f/",
    "category": "Racing",
    "tags": "Cars, drifting, Driving, Zombie",
    "thumb": "https://img.gamemonetize.com/gmyo0eoy41wbibg657zurkl3zio5nt8f/512x384.jpg",
    "width": "900",
    "height": "550"
  },
  {
    "id": "31637",
    "title": "Kaiju Run Dzilla Enemies",
    "description": "Kaiju Run - Dzilla Enemies plays like a normal running arcade game with 3D vertical-version play rules. It is managed for you to collect green items and defeat the final dinosaur boss at all levels. The stronger you grow, the more scores you can win by punching the monster farther. The diamonds you win are used to unlock more skins in the Shop. There are also 6 challenges in the DIY map. You can try different animals!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/amoqndcryfxbha3j49rwxuol1g35jtng/",
    "category": "Racing",
    "tags": "1 Player, run",
    "thumb": "https://img.gamemonetize.com/amoqndcryfxbha3j49rwxuol1g35jtng/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "31636",
    "title": "Draw And Guess",
    "description": "In Draw And Guess, players take turns drawing while others guess the word or phrase being depicted. Its a fun and interactive game that tests creativity and guessing skills. Players often use quick sketches or doodles to convey the idea within a time limit, adding an element of urgency and excitement. The game fosters communication and teamwork as players collaborate to decipher the drawings and advance through rounds.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/4ghb4zb3666ty94ds5ywp87hvqfaoe1d/",
    "category": "Hypercasual",
    "tags": "Boys, Draw, Drawing, Hypercasual, Kids, Mentolatux, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/4ghb4zb3666ty94ds5ywp87hvqfaoe1d/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "31635",
    "title": "Jungle Cafe",
    "description": "Jungle Cafe is a time management game with a jungle restaurant theme. You have to manage the restaurant by helping the waiter monkey serve the customer monkeys and deliver the fruits promptly as customers demand. Use the money earned to purchase new fruits and add them to the cafe menu. Also, you can buy upgrades for the shop which improves customer satisfaction and helps you to earn more money.",
    "instructions": "Use mouse click to play the game ",
    "url": "https://html5.gamemonetize.com/8f8y8hdqowc5kxgdctobmez67ykgymi2/",
    "category": "Hypercasual",
    "tags": "Animal, Casual, Food, Forest, Fruits, Fun, HTML5, jungle, Kids, Management, Monkey, Restaurant, Timing",
    "thumb": "https://img.gamemonetize.com/8f8y8hdqowc5kxgdctobmez67ykgymi2/512x384.jpg",
    "width": "960",
    "height": "540"
  },
  {
    "id": "31634",
    "title": "Crazy Town",
    "description": "Create your puzzle logic room with Crazy Town. Enjoy a new style of play with great puzzle logic. Puzzle your next room.Combine objects to discover new and fascinating items.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/opye43s2kt6dbfo0r7psjdc64l1im97c/",
    "category": "Hypercasual",
    "tags": "Casual, Crazy",
    "thumb": "https://img.gamemonetize.com/opye43s2kt6dbfo0r7psjdc64l1im97c/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "31633",
    "title": "Mermaids: Spot The Differences",
    "description": "Dive into an enchanting underwater world with Mermaids: Spot The Differences! Explore vibrant ocean scenes teeming with mermaids and sea creatures as you sharpen your observation skills to uncover subtle distinctions. Immerse yourself in the magic of the deep blue and embark on an adventure of keen-eyed discovery!",
    "instructions": "Click or tap to reveal differences in vibrant underwater scenes starring mermaids and sea life Sharpen your observation skills and plunge into the oceanic adventure ",
    "url": "https://html5.gamemonetize.com/28s266w9kn9hfs8cfwxynpds4rz1hjjj/",
    "category": "Puzzles",
    "tags": "Difference, Mermaid, Puzzle, Summer",
    "thumb": "https://img.gamemonetize.com/28s266w9kn9hfs8cfwxynpds4rz1hjjj/512x384.jpg",
    "width": "800",
    "height": "450"
  }
]
